{"status":"publish","pubdate":"Sat, 30 Aug 2014 23:10:53 -0000","tags":"python, javascript, llvm","author":"Brian Schrader","content":"<p><link rel=\"stylesheet\" href=\"http://yandex.st/highlightjs/8.0/styles/default.min.css\"></p>\n<script src=\"http://yandex.st/highlightjs/8.0/highlight.min.js\"></script>\n\n<script>hljs.initHighlightingOnLoad();</script>\n\n<p>In May, Apple announced a <a href=\"https://www.webkit.org/blog/3362/introducing-the-webkit-ftl-jit/\">new feature in WebKit</a> that added a fourth tier of speed optimization for JavaScript in Safari. In this new tier, JavaScript would be compiled to machine code (specifics aside). This kind of optimization (called FTL JIT) gave Webkit a 35% performance boost when compared to the third tier of optimization, pretty impressive.</p>\n<p>It seems someone thought that JavaScript was getting all the love when it came to speed optimizations and thought Python should benefit from this idea as well. That became <a href=\"http://numba.pydata.org\">Numba</a>. Numba allows Python developers to annotate any given segment in their code, that segment will be just-in-time (JIT) compiled using LLVM giving it, potentially, a 2 orders of magnitude improvement in speed! </p>\n<pre><code class=\"python\"># Code from http://numba.pydata.org\nfrom numba import jit\nfrom numpy import arange\n\n# jit decorator tells Numba to compile this function.\n# The argument types will be inferred by Numba when function is called.\n@jit\ndef sum2d(arr):\n    M, N = arr.shape\n    result = 0.0\n    for i in range(M):\n        for j in range(N):\n            result += arr[i,j]\n    return result\n\na = arange(9).reshape(3,3)\nprint(sum2d(a))\n</code></pre>\n\n<p>After talking to someone who'd actually used Numba in their code, they say their code saw anywhere from 2x to 500x speed improvements depending on what they were doing (using regular, old vanilla Python). That's really impressive. I can't wait to try out Numba, and I think I have some very interesting use cases coming up where this might be the solution I've been looking for.</p>","link":"http://brianschrader.com/archive/numba:-compiling-python-using-llvm-the-way-webkit-compiles-javascript","location":"/archive/numba:-compiling-python-using-llvm-the-way-webkit-compiles-javascript/","published":"Sat, 30 Aug 2014 ","title":"Numba: Compiling Python Using LLVM the way WebKit Compiles JavaScript","slug":"numba:-compiling-python-using-llvm-the-way-webkit-compiles-javascript","article-number":42}