{
"title" : "PhotoStream: Apple's beautiful, convoluted dream",
"slug" : "photoStream-apples-beautiful-convoluted-dream",
"author" : "Brian Schrader",
"type" : "blog post",
"published" : "2013-07-24",
"edited" : false,
"link" : "http://brianschrader.com/archive/photoStream-apples-beautiful-convoluted-dream/",
"content" : "<p>All the yearly hype before WWDC has gotten me thinking. What do we want from iOS this \nyear? What do we want Apple to fix? There's been a lot of interesting talk about this topic\nalready. Marco Arment talked about it on his show \n<a href=\"http://atp.fm\">Accidental Tech Podcast</a> and <a href=\"http://imore.com\">iMore</a>\nhas talked about the \"iOS 7 Wish List\" already too, but I wanted to give my take on the whole\nthing, specifically in regards to PhotoStream.</p>\n<p>PhotoStream has been with us now since iOS 5 (2011) and I think I'm right when I say that\n everyone was thrilled when they heard Steve announce the feature, but once\nit arrived, it kind of fell out with a lot of users. Why? Because its confusing. The \nconsumer has a very difficult time grasping PhotoStream, and, since iOS 6, Apple confused \npeople even more with the whole \"Shared PhotoStream\" thing. This whole mess has spiraled into \nchaos as Apple added features to a core that wasn't finished yet.</p>\n\n<h2><u>What's Wrong?</u></h2>\n<img class=\"body-image-right\" width=\"30%\" src=\"http://images.biteofanapple.com/blog/photostream-ios6.png\" \ntitle=\"What PhotoStream looks like now.\">\nOther than having to \n<a href=\"http://www.imore.com/photo-stream-why-so-complicated\">deal with iPhoto</a>,\n(which is a whole other issue that I won't delve into)\nPhotoStream's main problems are in its presentation. As far as I see\nit, there is nothing drastically wrong with PhotoStream internally, it's only confusing\nin the way that it is presented to the user.</p>\n<p>The goal of PhotoStream is simple. Take a picture and PhotoStream will put that picture\non all of your other devices. It's beautiful really. Majestically simplistic. If only it\nwere presented that way. Instead, anyone opening up Photos.app on their iPhone  \nsee's the PhotoStream tab at the bottom, and the Albums tab right next to it. \nThis is a nightmare for most users. What is the\ndifference between the tabs? Why are some of my pictures there and some\naren't? What are Shared PhotoStreams? Why are those different from Albums? Don't both of\nthese tabs do the same thing? This whole mess could be eliminated if the PhotoStream and Albums tabs were combined,\nnot just in a mash up, but in a little more elegant of a way. We all know how PhotoStream\nlooks, so I won't take any more time explaining it, let's just leave it at \"confusing\", and \n\"not elegant\".</p>\n<p>Another great feature of PhotoStream is the \"Shared PhotoStream\" feature. This lets you \norganize your photos in \"Streams\" and share them with other people, or publish them to\na private website. I personally love this feature and my family uses it all the time to \nshare photos. My biggest complaint is that if I have this awesome shared\nstream, why do I still need the \"Albums\" tab? (I know that this is mostly for iTunes sync reasons, as \npictures synced from iTunes go there, but there is no reason for this anymore). Shared Photo\nStreams and Albums do the same thing: Organize photos! Why can't they just be on the same tab?</p>\n\n<h2><u>A Truly Elegant Solution</u></h2>\n<img class=\"body-image-right\" width=\"30%\" src=\"http://images.biteofanapple.com/blog/photostream-ios7-concept2\"\ntitle=\"How PhotoStream could look if it was part of the Camera Roll in iOS 7. Notice the little clouds.\">\n<p>Let's boil PhotoStream down to its essence, what does it do? It syncs camera roll\nphotos between devices. Ok, so why not integrate PhotoStream with the Camera Roll? Lets look\nat an ideal Photos experience.<br><br>\n\n<u><b>PhotoStream in iOS 7</b></u><br>\nInstead of a confusing second tab, that for some reason is out of sync with the first one,\nlets look at a concept like the one here. Instead of two tabs, we have the plain camera roll\nbut with a little cloud, similar to what iTunes does with music. The pictures with a cloud\nare in the cloud (simple enough)! Photos would be uploaded to the cloud just like they are now and until they\nare fully uploaded, they would remain cloud-less. These photos would be organizable in \nshared photo streams and be instantly sharable with others. </p>\n<p>Also, since this is our idealized version, we changed the main tabs too! Gone are the\nold Photostream, and Albums tabs. Now they are combined into on beautiful Photos tab.\nShared Photostreams are treated just like albums and can be shared just as they can be now. \nPictures taken in the Camera Roll are uploaded to the cloud and can be organized into these streams.\nGone is the old 3 different screen malarky, and in its place is one screen, one simple screen\nwith all the previous information bundled up nicely. Albums are PhotoStreams and PhotoStreams\nare Albums. </p>\n<img class=\"body-image-right\" width=\"30%\" src=\"http://images.biteofanapple.com/blog/photosapp-ios7-concept2\"\ntitle=\"What the new Albums tab could look like in iOS 7.\">\n\n<h2><u>The Wrap Up</u></h2>\n<p>Apple announced PhotoStream in the same manor as they did iCloud, as a background service that you knew\nwas there, but didn't have to worry about. It just worked. I think they pulled it off well\nin certain aspects like iCloud Backup which runs every night and you'll never need to \nworry about. PhotoStream was supposed to be the same way, instead though, we got an \naddition to the Photos app that only confused the majority of users. In our concept \nthough, we have removed the additional tabs, and replaced it with a simple UI tweak that\nlets the user know whats going on without confusing them. We have eliminated the confusion \nbetween Albums and PhotoStreams, we have done what Apple prizes most; we made it simpler.\n</p>\n\n<u><b>Update:</b></u><br>\n<p>It looks like the ideal Photos.app experience is already present in iOS. Its part of the\nphoto picker for 3rd party apps. Hopefully, they can expand on this to make the whole \nphotos experience a lot smoother. \n</p>\n\n<p><small>TL;DR: PhotoStream looks bad, I thought of how to fix it. Go look at the pictures \nto see how.</small></p>"
}