{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "http://brianschrader.com/archive/lessons-on-variable-naming-from-breakfast-burritos/", "url": "http://brianschrader.com/archive/lessons-on-variable-naming-from-breakfast-burritos/", "title": "Lessons on Variable Naming from Breakfast Burritos", "date_published": "2021-04-17T01:19:00", "tags": ["programming", "software development", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>This morning I ordered a breakfast burrito from a local taco shop. Normally this would not be news and obviously would not warrant a blog post or any in-depth analysis, but it was early and I hadn't yet had coffee, so my mind was loose and my thoughts wandering. As I looked over the menu, I pondered the two vegetarian breakfast burrito options:</p>\n<ul>\n<li><strong>Mushroom burrito</strong> filled with mushrooms, potatoes, eggs, and cheese</li>\n<li><strong>Potato burrito</strong> filled with potatoes, eggs, beans, and cheese</li>\n</ul>\n<p>At the counter I asked for the potato breakfast burrito, and I intended to order the latter of the two, but it occurred to me that they both contained potatoes and therefor my order was ambiguous. What after all makes a burrito with potatoes, eggs cheese, and mushrooms deserve a different name than a burrito with potatoes, beans, eggs, and cheese? What makes the latter not a bean breakfast burrito, as the beans are the item that is unique to the latter burrito whereas potatoes are common to both? Are potatoes a more significant ingredient? If so, why?</p>\n<p>I received my order&mdash;which was correct by the way&mdash;and went home, but as I walked I wondered, how is it that the cashier and I understood each other? There was so much ambiguity in the names of those menu items. How were we able to make sense of the obvious ambiguity?</p>\n<h2>Naming is <strong>Really</strong> Hard</h2>\n<p>If you haven't seen the connection by now, let me drop the pretext. These same questions also relate to how we choose to name our variables and our functions in code. Naming after all is hard, and I think my burrito example helps explain why.</p>\n<blockquote>\n<p>It is often said that the three hardest problems in computer science are naming and off-by-one errors.</p>\n</blockquote>\n<p>In a more rigorous naming system, I assume that most people would come to the conclusion that the second burrito is probably mis-named. It should be called the \"bean breakfast burrito\" since, as I mentioned, the beans are the distinct ingredient that make the latter burrito not strictly a subset of the former.</p>\n<p>That said, beans are not normally considered a main ingredient in a burrito. In the conventional burrito naming scheme, more appealing or distinct ingredients, or ingredients not considered to be condiments, take precedence. This naming scheme is the reason why a burrito with carne asada, pico de gallo, and guacamole would be simply called a carne asada burrito and not a guacamole burrito.</p>\n<p>These same conventions exist when we name variables and functions. We can imagine a scenario where we have a list of users and need to filter out which users have recently logged in and which among those have active subscriptions to our service.</p>\n<pre><code>def get_active_subscribed_users():\n    all_users = get_all_users()\n    active_users = (user for user in all_users if user.is_active)\n    &lt;variable&gt; = (user for user in active_users if user.has_active_subscription)\n</code></pre>\n<p>The first two variable names are fairly obvious, the question becomes: what do we name the third variable so that it is not ambiguous? We could of course call this new variable <code>active_users_with_active_subscriptions</code>, but to many that would be too long, and to my eyes that makes it seem that this variable contains a list of <code>(user, subscription)</code> pairs.</p>\n<p>We could name the value <code>active_users</code>, <code>actively_subscribed_users</code>, or even just <code>relevant_users</code> if the criteria for what relevancy means is clear enough in context. Some developers prefer to simply refer to these as <code>users</code> but I find that incredibly confusing. Others may prefer to define the variable <code>users</code> and then redefine it as they filter down the list to suit their needs, which I find even more confusing and unclear.</p>\n<p>In practice I tend to prefer the third option along with a comment explaining what I mean by \"relevant\". This only exacerbates our problems though. If two groups of \"relevant\" users meet in a new context, their names would clash and we would need to find new names for these groups.</p>\n<p>The context is here is key. If we instead fetched the same list from another function call, we could drop the qualifier entirely.</p>\n<pre><code>def get_active_subscribed_users():\n    users = get_active_users()\n    # We can avoid the question entirely if we simply return the list here.\n    return (user for user in users if user.has_active_subscription)\n</code></pre>\n<h2>Names are a Leaky Abstraction</h2>\n<p>As with our breakfast burritos, we could simply default to the names being a list of the components, but that can become overly burdensome very quickly. Our potato burrito would be unceremoniously called the \"potato, eggs, bean and cheese breakfast burrito\", which is unambiguous but also cumbersome. It can also cause problems as forgetting to mention a single component could confuse the reader and lead them to believe that a reference to a potato, egg, and bean burrito was not the same as your potato, egg, bean, and cheese burrito even if you were both referring to the same thing.</p>\n<p>As programmers we aren't taxed by the character; we can have longer variable names, but at best those names should be descriptive, succinct, and distinct. Issues arise when names, by their nature, don't convey the whole story. Names almost always convey a summary of their true meaning. They can't effectively convey the context in which the name was given or the inherent value of the named thing. Out of context a name might be confusing, but that confusion may vanish when used in the appropriate context.</p>\n<p>Likewise, in some contexts a potato breakfast burrito is the same thing as a mushroom burrito, but today it wasn't.</p>"}, {"id": "http://brianschrader.com/archive/building-a-personalized-newsletter-with-bash-and-a-raspberry-pi/", "url": "http://brianschrader.com/archive/building-a-personalized-newsletter-with-bash-and-a-raspberry-pi/", "title": "Building a Personalized Newsletter with Bash and a Raspberry Pi", "date_published": "2021-04-03T21:02:00", "tags": ["programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I use <a href=\"https://pinboard.in/\">Pinboard</a> to save articles I've read and, increasingly, to save articles I <em>want</em> to read. That said I rarely go back and actually read things once they disappear into the Pinboard void. This isn't an uncommon problem, I know, but I think I've devised a simple solution.</p>\n<p>I recently set up a Raspberry Pi and mounted it under my desk. I've been playing with RPis for years, but I'd never found a recurring need for them, they've always been toys with fleeting amusement value. But this time around, I've configured it as both a local web server and Samba file share. This allows me to quickly and easily share files with the RPi and, since I configured it to send emails through my Fastmail account, it can now alert me whenever I want.</p>\n<h2>My Pinboard Weekly Newsletter</h2>\n<p>Now that everything on the RPi is set up and easily accessable, I wrote up a simple <a href=\"https://gist.github.com/Sonictherocketman/8504244c5c916f41dc7815e28f297b86\">bash script</a> to pull my most recent bookmarks from Pinboard, filter out the stuff I've already read, and draft an email with everything from the past week that I still haven't gotten to.</p>\n<p>I've posted a simplified version <a href=\"https://gist.github.com/Sonictherocketman/8504244c5c916f41dc7815e28f297b86\">on Github</a>, but my real script isn't much more complex&mdash;all told it comes out to 55 lines of code&mdash;and it's run with a simple, weekly cron job.</p>\n<p><img alt=\"Pinboard Weekly\" src=\"/images/blog/pinboard-weekly.png\" />\n<center><small><i>Here's a sample of the newsletter email&mdash;and yes, my RPi's name is Demin.</i></small></center></p>\n<p>Hopefully this weekly newsletter reminds me to actually go back and read the interesting news and articles I've collected during the week (or it will help remind me just how unimportant certain things really are when you've had a week to let them sit).</p>\n<p>If you use Pinboard, and you constantly find yourself saving articles and never reading them, give my script a try. If you do, let me know what you think!</p>"}, {"id": "http://brianschrader.com/archive/why-all-my-servers-have-an-8gb-empty-file/", "url": "http://brianschrader.com/archive/why-all-my-servers-have-an-8gb-empty-file/", "title": "Why All My Servers Have an 8GB Empty File", "date_published": "2021-03-25T18:39:00", "tags": ["marco", "software development", "web dev"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Last night I was listening to the latest <a href=\"https://www.relay.fm/radar/213\">Under the Radar</a>, where Marco Arment dove into nerdy detail about his recent <a href=\"https://overcast.fm\">Overcast</a> server issues. The discussion was great, and you should listen to it, but Marco's recent server troubles were pretty similar to my own <a href=\"/archive/pineblog-downtime-post-mortem-a-story-of-finite-resources/\">server issues</a> from last year, and so I figured I'd share my life-hack solution for anyone out there with the same problem.</p>\n<h2>The what and where</h2>\n<p>Both hosts, Marco Arment and David Smith, run their own servers on Linode&mdash;as do I&mdash;and I found myself nodding along in solidarity with Marco as he discussed his toils during a painful database server migration. Here's the crux of what happened in <a href=\"https://overcast.fm/+FgnbaF18Q/14:09\">Marco's own words</a>:</p>\n<blockquote>\n<p>The disk filled up, and that's one thing you don't want on a Linux server&mdash;or a Mac for that matter. When the disk is full nothing good happens.</p>\n</blockquote>\n<p>One thing Marco said hit me particularly close to home:</p>\n<blockquote>\n<p>Server administration, when you're an indie, is very lonely.</p>\n</blockquote>\n<p>During my major downtime problem last year, I felt incredibly isolated and frustrated. There was no one to help me and no time to spare. My site was down and it was down for a while. My problem was basically the same: my database server filled up (but for a different reason). And as Marco said, when the disk is full, nothing good happens.</p>\n<p>In the days after I fixed my server issues, I wanted to ensure that even if things got filled up again, I would never have trouble fixing the problem.</p>\n<h2>A cheap hack? Yes. Effective? Also Yes.</h2>\n<p>On Linux servers it can be incredibly difficult for any process to succeed if the disk is full. Copy commands and even deletions can fail or take forever as memory tries to swap to a full disk and there's very little you can do to free up large chunks of space. But what if there was a way to free up a large chunk of space on disk right when you need it most? Enter the <code>dd</code> command<sup>1</sup>.</p>\n<p>As of last year, all of my servers have an 8GB empty <code>spacer.img</code> file that does absolutely nothing except take up space. That way in a moment of full-disk crisis I can simply delete it and buy myself some critical time to debug and fix the problem. 8GB is a significant amount of space, but storage is cheap enough these days that hoarding that much space is basically unnoticeable... until I really need it. Then it makes all the difference in the world.</p>\n<p>That's it. That's why I keep a useless file on disk at all times: so I can one day delete it. This solution is super simple, trivial to implement, and easy to utilize. Obviously the real solution is to not fill up the database server, but as with Marco's migration woes, sometimes servers do fill up because of simple mistakes or design flaws. When that time comes, it's good to have a plan, because otherwise you're stuck with a full disk and a really bad day.</p>\n<div class=\"footnote\">\n<sup>1</sup> There are <a href=\"https://www.cyberciti.biz/faq/howto-create-lage-files-with-dd-command/\"> lots of tools you can use to do</a> this besides dd. I just prefer it.\n</div>"}, {"id": "http://brianschrader.com/archive/all-too-quiet/", "url": "http://brianschrader.com/archive/all-too-quiet/", "title": "All Too Quiet", "date_published": "2021-03-07T02:12:00", "tags": ["blog", "meta"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Other than my last post, it's been pretty quiet here lately. I've spent the majority of the last two months wrapping up the newest update to Pine.blog, which launched silently about a month ago. I meant to do a sort of announcement or retrospective post on the launch, but I just never got around to it.</p>\n<p>A new <a href=\"https://indiedevlife.fm\">IndieDevLife</a> is coming, but I haven't had the mental bandwidth to record an episode lately. I've been spending a lot of time reading and writing policy proposals for <a href=\"http://democracyandprogress.com\">Democracy &amp; Progress</a> and I've been pouring the remainder of my time into a new iOS app.</p>\n<p>That's right, I've started yet another new app! It's in a private, early beta now, and I'm expecting the launch in May. No more details just yet, but I promise this one will be particularly special. I'm doing a lot that I've never done before, and playing with APIs I'd never heard of until now. It's fun stuff.</p>"}, {"id": "http://brianschrader.com/archive/california-democracy-and-progress/", "url": "http://brianschrader.com/archive/california-democracy-and-progress/", "title": "California, Democracy, and Progress", "date_published": "2021-03-05T19:26:00", "tags": ["blog", "announcement", "politics"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Last week I published the first proposal on <a href=\"http://democracyandprogress.com\">Democracy &amp; Progress</a>, my new public policy blog. It's about Democracy Vouchers and how California should adopt them.</p>\n<p>You should read the post, then please consider subscribing. The blog is in its initial launch phase, so your subscription means more than it normally would.</p>\n<p>I've been wanting to write about policy for a long time, but I could never quite figure out the tone or the topic scope. I finally settled on the idea of discussing California politics through the lens of improving and promoting democracy. It's a big topic, and there's a lot to discuss, so I hope you'll follow along and let me know what you think.</p>\n<p>Over the last few years, I've become pretty immersed in the policy world's conversations. I read a lot of policy books, articles and papers, I follow a lot of political writers, and I listen to a lot of politics podcasts. Over time, I started to develop my own policy outlook and then I wanted to participate in the conversation to add what I thought was a different angle on the discussion. Last year I started writing Op-Eds and <a href=\"http://sduptownnews.com\">publishing some in my local paper</a>, but also I wanted to do more than that. I just couldn't figure out what my angle would be, what kinds of topics or ideas I wanted to cover, and through what lens I would cover them.</p>\n<p>A few years back, while listening to the <a href=\"https://www.nytimes.com/column/ezra-klein-podcast\">Ezra Klein Show</a>, Ezra lamented that we as a society didn't spend more time focusing on local and state politics&mdash;where our time and energy is often better spent. Collectively, we don't focus on state and local politics, and yet it's only there where a lot of policy solutions can be done. That conversation stuck with me, and over time the drive to write about state politics has only gotten deeper. It was last summer, when I read <a href=\"https://www.indiebound.org/book/9781568588384\">All Politics is Local</a>, that the idea for what would become <a href=\"http://democracyandprogress.com\">D&amp;P</a> really started to form.</p>\n<p>While I was scoping out the policy-blog space, I did a lot of searching around and while I found lots of medium to long-form policy blogs focusing on the national federal government (a lot of which I was already following), I didn't find a lot of the same thing at the state level. It was then I realized I had found my niche.</p>\n<p>Politics can be a difficult thing to discuss in public, so that's why I wanted to focus on policy, not politics. Hopefully the blog can stay far away from the concerns of the day and avoid kindling a partisan fervor. At D&amp;P, we're going to focus on solutions. California is a solidly Democratic state (the party not the governing strategy), so partisan squabbling is less of an issue&mdash;which is a blessing&mdash;but there are still plenty of difficult issues.</p>\n<p>As part of my work for D&amp;P, I've started compiling a <a href=\"http://democracyandprogress.com/archive/resources/\">list of resources</a> for people to help them follow California politics. I know I wish I'd had something like this to get me started, so hopefully I can pay it forward.</p>\n<p>Please consider giving D&amp;P a follow in your favorite feed reader via <a href=\"https://democracyandprogress.com/rss.xml\">RSS</a>, on <a href=\"https://twitter.com/dem_and_prog\">Twitter @dem_and_prog</a>, or sign up for <a href=\"https://tinyletter.com/democracyandprogress\">the newsletter</a>. Here's to a better, more policy focused California.</p>"}, {"id": "http://brianschrader.com/archive/various-goings-on/", "url": "http://brianschrader.com/archive/various-goings-on/", "title": "Various Goings On", "date_published": "2021-01-03T05:49:00", "tags": ["indie dev", "pine.blog", "metablogging"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I've been a little scatter-brained over the past few weeks. I've started lots of little projects and finished almost none of them. Hopefully, they'll all start to wrap up soon. I mentioned on a previous <a href=\"https://indiedevlife.fm\">Indie Dev Life</a> that I was working on an update to the <a href=\"https://pine.blog\">Pine.blog</a> iOS app, and that is still true. It's coming along nicely. I think I'm about 80% done with it, but I've reached the infamous second 80% and it's become a bit of a slog, so I did what a usually do in this situation: literally anything else.</p>\n<p>To that end, I've been experimenting with a few other projects. I've started the process of adding a dark mode to Pine.blog's Web UI, which is coming along nicely. I've also started building out Micropub support for Pine.blog. Both are features I've wanted for a long time, but never gotten to. Hopefully they'll be done around the same time as the iOS refresh. I've always struggled with putting together a coherent design for the Pine.blog web UI, and it shows. With the newest refactor of Pine.blog for iOS though, I've finally developed a coherent design and I've started using the same layout and components on both iOS and the web. It's looking really good, and hopefully this new design will last a while and bring Pine.blog up to modern standards.</p>\n<p>On Monday the holidays are officially over and I'll force myself to finish the iOS release for Pine.blog. Usually I try to keep myself pretty focused, but for now I'll keep tinkering &mdash; it's a nice thing to do every once in a while.</p>"}, {"id": "http://brianschrader.com/archive/breadcrumbs-and-pinboard/", "url": "http://brianschrader.com/archive/breadcrumbs-and-pinboard/", "title": "Breadcrumbs and Pinboard", "date_published": "2020-12-31T01:44:00", "tags": ["personal", "software"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I use <a href=\"https://pinboard.in\">Pinboard</a>, and I have for some time. For years, I've dumped the occasional interesting article there and then largely forgotten about it. Recently though, I've decided to really dive in and start using the service to solve a problem I routinely have.</p>\n<p>I read a lot of articles, as I'm sure many of you do, and I often refer to them in conversation or in a blog post. When I do reference an article I like to cite it, even in conversation, but I often can't find the article anymore nor can I remember enough about it to effectively search for it. I think it's important to cite your sources, even casually, because it helps you recognize your own filter bubble, and it helps to ground you in the realm of facts. It also helps the other people you're conversing with better understand and counter your argument if they can tell where you're getting your information from. Plus, if you can find the original source, you can always verify that you're remembering the information correctly.</p>\n<p>In an effort to forever solve this problem, I've started archiving essentially every article I read in Pinboard, and I do this whether or not I think the article was any good. This effectively turns Pinboard into a breadcrumb trail that I can use to retrace my path on the Web and hopefully dig up and verify any information that I half-remember.</p>\n<p>A while back, I started <a href=\"https://pine.blog/u/sonicrocketman/archive/e335c9e3-4e5f-4249-ad15-644c33bd658b\">taking notes</a> when I read books so I can more easily remember and refer back to information I may need, but I don't want to keep a notebook for everything I read online. Enter Pinboard.</p>\n<p>There are a few things that my system is lacking so far. Most importantly, I'm still having trouble finding some articles when I know that I've bookmarked them. It seems that either Pinboard's search isn't working how I'd expect or I'm not giving it enough metadata to search through when bookmarking articles.</p>\n<p>Hopefully, as I get more accustomed to this new way of using Pinboard I'll drastically increase the frequency when I can recall some useful fact and also produce a worthy citation.</p>"}, {"id": "http://brianschrader.com/archive/history-myth-and-talking-cows/", "url": "http://brianschrader.com/archive/history-myth-and-talking-cows/", "title": "History, Myth, and Talking Cows", "date_published": "2020-12-27T08:34:00", "tags": ["history", "book"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I started reading <a href=\"https://www.indiebound.org/book/9780140448092\">The Early History Of Rome</a> by Livy a little over two years ago, but today I finally finished it. It's a good book and a fun and illustrative read, but there's a reason it took me so long to get through.</p>\n<p>Livy, or Titus Livius, as he was actually known, was a Roman writer <a href=\"https://en.wikipedia.org/wiki/Livy\">born in 64 or 59 BC</a>, so his writing style is... strange by modern standards. I would often have to re-read multiple pages after realizing that I had no idea who was doing what. This is compounded by the fact that there are literally hundreds of names and, in a very Roman tradition, they are all incredibly similar. I'm also a fairly slow reader, so between the constant re-reading, my overall slow reading speed, and huge reading backlog, I could only finish 20 pages before getting distracted with another <del>easier</del> book.</p>\n<p>That said, Livy's work is certainly worth reading if only for some of the truly amazing stories he tells. Sometimes the stories are so completely outlandish that I have to stop and remind myself that this isn't a fantasy story, it's history. Now, obviously there is myth and legend interspersed with it, and in these early histories they're effectively inseparable. After all, it's claimed &mdash;by multiple Roman authors&mdash; that the city was founded by two children nursed by a wolf, before the oldest kills the youngest, becomes king, and ascends to heaven in a cloud. It's an interesting read.</p>\n<p>I'd like to share just one passage that I earmarked early on in the book. For context, know that the Romans were <em>incredibly</em> superstitious. They were constantly on the lookout for signs from the gods and they rarely did anything without performing some sacred ritual and seeking approval from the gods (see the <a href=\"http://www.anecdotesfromantiquity.net/the-sacred-chickens-of-rome/\">story of the Sacred Chickens</a>). In this passage, the consuls for the year (461 BC) had just been elected, and war would soon come to the Romans though they didn't know it yet.</p>\n<blockquote>\n<p>The year was marked by ominous signs: fires blazed in the sky, there was a violent earthquake, and a cow talked &mdash; there was a rumor that a cow had talked the previous year, but nobody believed it: this year they did. Nor was this all: it rained lumps of meat. Thousands of birds (we are told) seized and devoured the pieces in mid-air, while what fell to the ground  lay scattered about for several days without going putrid. The Sibylline Books were consulted by two officials, who found them in them the prediction that danger threatened, from 'a concourse of alien men' who might attack 'the high places of the City, with the shedding of blood'. There was also found, amongst other things, a warning to avoid factious politics.</p>\n<p>&ndash; Livy, History of Rome, 3.10</p>\n</blockquote>\n<p>There is so much that I love about this passage, but my absolute favorite thing is that Livy reports that <strong>a cow talked</strong>, but for some reason the first time this happened it was dismissed, and that a cow talking is apparently a warning to avoid factious politics. If that's the case, then I kinda wish a cow would talk today.</p>\n<p>I've already purchased the <a href=\"https://www.indiebound.org/book/9780140443882\">second volume</a> of Livy's work and it's on my shelf ready to go. Hopefully I can get through this one a bit quicker.</p>"}, {"id": "http://brianschrader.com/archive/arbitrary-achievement-unlocked/", "url": "http://brianschrader.com/archive/arbitrary-achievement-unlocked/", "title": "Arbitrary Achievement Unlocked", "date_published": "2020-12-10T23:14:00", "tags": ["podcast", "indiedevlife", "personal", "productivity", "indie"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Today marks the 10th episode of my podcast <a href=\"https://indiedevlife.fm\">Indie Dev Life</a>, and while that might not seem like a huge milestone, it's an important one because I decided it was. When I decided to start a podcast I, arbitrarily, set a goal for myself to publish at least ten episodes. After that I would decide if I liked doing it and if I would continue. Today I achieved my arbitrary goal.</p>\n<p>I do plan to continue the podcast. I like doing it, and it's fun to both record and edit. So far, I like both the format and the length. As is hopefully apparent, I'm trying to model IDL on <a href=\"http://developingperspective.com\">_davidsmith's Developing Perspective</a> podcast. I enjoyed that show (and it's casual format) a lot and I think a short show works well for the kind of show I'm trying to create. So, if you like the show, don't worry there's going to be more of it.</p>\n<h3>Arbitrary Deadlines &amp; Achievements</h3>\n<p>I'm a procrastinator by nature, so I have to set, what are often completely arbitrary and unnecessary, deadlines for myself if I want to accomplish basically anything, plus I have a terrible memory. So, I tend to create task lists for myself and assign tight due dates so that I can remember what I need to do and ensure that I actually get it done. And whenever possible, I try to stick to my arbitrary deadlines no matter the work involved. If I decided something will launch tomorrow, then it will. I do the same with arbitrary goals.</p>\n<p>I'm not sure why my brain finds it so much easier to work under a deadline, but it does. Even when I know the deadline is meaningless, simply having one is enough to trick my brain into thinking it's real. The procrastinator in me will always put off work until the last minute (unless it's something I enjoy playing with) so I often make my self-imposed deadlines tighter than they probably should be.</p>\n<p>I do the same thing with setting achievements for myself. When I released <a href=\"https://goingindie.tech\">Going Indie</a>, I set a series of goals for what I'd consider a successful release. My expectations being what they are, I tend to make my first goal incredibly low so that I'm basically guaranteed to hit it. For Going Indie, my first goal was to sell 10 copies, and thanks to you all, I sold many more than that. After the first goal, the rest follow a pretty simple format:</p>\n<ul>\n<li>What is the bare minimum I'd consider successful?</li>\n<li>What would I be happy with?</li>\n<li>What would I want to have happen?</li>\n<li>What would I dream of happening?</li>\n<li>What is basically impossible?</li>\n</ul>\n<p>This tiered structure helps me understand myself and my own expectations. It also keeps me motivated. If I say I'd be happy with something, and set my expectations accordingly, then when I achieve it, I feel good. Without this structure, I tend to trap myself into believing that my wildest dream scenario is just as likely as the rest and then I'm disappointed when that dream doesn't come true.</p>\n<p>I say this in Going Indie, but managing your own expectations is incredibly important, not only to your own motivation, but to your mental health. If you constantly convince yourself that an idea or project is going to make it big, and then it doesn't, you're going to get discouraged. But if you set reasonable goals, and learn to manage your own expectations (of yourself, your capabilities, and your results) then it's a lot easier to appreciate the successes you do achieve and keep going to bigger and better things.</p>\n<p>tl;dr I made 10 episodes of my podcast, and I want to make more.</p>"}, {"id": "http://brianschrader.com/archive/a-false-dichotomy/", "url": "http://brianschrader.com/archive/a-false-dichotomy/", "title": "A False Dichotomy", "date_published": "2020-12-05T00:11:00", "tags": ["politics", "government", "covid-19"], "author": {"name": "Brian Schrader"}, "content_html": "<p>An editorial of mine was <a href=\"https://sduptownnews.com/guest-editorial-the-way-forward-conquering-the-pandemic/\">published today in a local paper</a>. It's the first in a short series about America's future and how we can work together to solve our most pressing problems, and like most things these days this first essay is about the COVID-19 pandemic.</p>\n<blockquote>\n<p>COVID-19 has disrupted our entire way of life and it seems like that will continue for longer than we would like or hope. The race to a vaccine and mass inoculation is ongoing, but it will take time to see the fruits of that labor. In the meantime, we are not helpless...our current situation is not unsalvageable.</p>\n</blockquote>\n<p>The article ends with a phrase I've repeated over and over again since March.</p>\n<blockquote>\n<p>In short, the current choice between a forced reopening during a pandemic or a safe but devastating shutdown is a false dichotomy — one created by a refusal to help fellow Americans during a crisis.</p>\n</blockquote>\n<p>So far, aside from modest measures (one-time checks, boosting UI insurance, and SBA loans) the federal government has yet to fully respond to the pandemic. Many other nations shut down their economies, but they've also provided aid to individuals and businesses so that they can weather those shutdowns and emerge, raring to go, when they're over. Instead of doing that, our federal government has <a href=\"https://www.nytimes.com/2020/04/22/us/coronavirus-mcconnell-states-bankruptcy.html\">refused to help states and local governments</a> with revenue shortfalls, failed to provide adequate financial aid to individuals and businesses in need, and overall acted as if the pandemic is nothing to worry about even though, at time of writing almost 300,000 Americans have died of the disease. Instead, the President and Senate Republicans have simply insisted that their hands are tied, that the incredible capabilities of the most powerful nation on earth simply can't be used to help its people.</p>\n<p>A lot of this disfunction lies at the feet of Republicans in the Senate. To it's credit, the House passed a <a href=\"https://www.vox.com/2020/5/15/21258854/house-three-trillion-stimulus-bill\">new round of pandemic relief months ago</a>, but the Senate never even considered it, and <a href=\"https://www.vox.com/policy-and-politics/2020/7/1/21310194/voxcare-biden-trump-coronavirus-response\">Joe Biden's sizable pandemic plan</a> is probably subject to the same fate.</p>\n<p>In an <a href=\"https://www.nytimes.com/2020/12/03/opinion/covid-relief-mitch-mcconnell.html\">Op-Ed for the New York Times this week</a>, David Brooks wrote about the most recent coronavirus aid talks and Senate Majority Leader Mitch McConnell's efforts to curtail them.</p>\n<blockquote>\n<p>To their great credit, Pelosi and Chuck Schumer embraced the bipartisan framework. Mitch McConnell went on the Senate floor Thursday, pretended to soften, ignored the compromise and did not move an inch.</p>\n<p>If [we don’t see a Covid-19 relief measure pass in the next week or two], McConnell should spend Christmas with people thrown out of work and witness the suffering he has caused.</p>\n</blockquote>\n<p>This is what has infuriated me for months. We have a solution to this pandemic. We know how to curtail its spread: shutdown, pay people to shutdown, and encourage masks and distancing. Then and only then: reopen safely. We could open schools while keeping bars and restaurants closed if those businesses could afford it, and we can make sure they could. Instead we choose not to. This dichotomy: reopen unsafely or suffer safely is a false choice. There are plenty of better options, but we won't take them. Instead we chose this route.</p>\n<p>I'll leave you with an excerpt from an article I wrote but never published.</p>\n<blockquote>\n<p>..we can't control the virus, we can only mitigate its spread. We can, however, directly effect the economy. We could have built up our institutions, we could have helped those that lost their jobs, we could have woven a net to catch those who fall. We chose not to, but we still can.</p>\n</blockquote>"}]}