{"home_page_url": "https://brianschrader.com", "version": "https://jsonfeed.org/version/1", "description": "Thoughts, and ramblings about technology, programming, history, and whatever else I'm interested in.", "feed_url": "https://brianschrader.com/feed.json", "title": "BiteofanApple by Brian Schrader", "items": [{"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/thats-when-i-knew-i-cant-actually-use-macos/", "tags": ["macos", "funny", "adrift", "macbook pro", "productivity", "migrations"], "content_html": "<p>A few months back, I got a new laptop for work: a new 15\" MacBook Pro.<sup>1</sup> It was the first time I'd gotten a new Mac since 2014 when I got the MacBook Pro I'm using to write this post; this Mac has been my primary machine ever since. I use it for everything: I built <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> and <a href=\"https://pine.blog\">Pine.blog</a> with it, I used it for over 4 years as my work computer, I've taken it all across the country and for most of that time I've carried it with me every single day.</p>\n<p>In all that time though, I haven't been using macOS as it comes from Apple, I've heavily customized just about everything. I've written tons of little command-line utilities, keyboard macros, Apple Script extensions, and installed bits of extra utilities to make this laptop work <em>exactly</em> the way I want. What's more, when I got this machine, I migrated my previous MacBook onto it. In short, there's now a decade of customizations and tweaks baked into macOS, and it's been long enough now that I have no idea which behaviors are mine and which are part of the macOS that Apple ships.</p>\n<p>Which presents a problem when setting up a new Mac.</p>\n<p>Nowadays, when I use my Mac, I don't really think about what I'm doing. My hands do things, and the thing I want to happen, does; all in perfect harmony. One thing I knew, coming into this new Mac, was that my hands would likely stumble over this new bigger, chunkier keyboard. I was right, but for this I was prepared. I was less prepared for what came next.</p>\n<h3>That Demoralizing Beep</h3>\n<p>There I was, welcoming a new friend into the world, stumbling sure, but maintaining my balance. It was then, for what reason I know not, I heard a sound I'd not heard in a long time, a long time: the error chime. Instantly, I was lost, adrift on unfamiliar shores that at first glance looked just like the islands I'd called home for a decade, but which, on second glance turned out to be nothing more than a mirage that obscured the sharp rocks on which I was now adrift.</p>\n<p>In a flurry, I reached for <a href=\"\">Alfred</a>. I whacked Command + Space and found only Spotlight. When I asked Spotlight for <code>set</code> and whacked Enter, instead of seeing my familiar System Preferences, I heard only that chime again. I started to panic. It was then I realized that I was truly alone. Pastebot had fallen, Shiori did not heed my call, and Terminal no longer spoke my native tongue. Somehow, I managed to open Safari, but when I searched for <code>alfred</code> I was thrust to Google.com, a far cry from my <a href=\"https://duckduckgo.com\">usual port of call</a>. I was lost; adrift on the farthest shores. Unmoored, scared, and alone.</p>\n<p><img alt=\"Alfred using Settings to Open System Preferences\" src=\"/images/blog/alfred-set.png\" /></p>\n<p>What was this strange world? I knew not. For now I only knew the screams of error demons emanating from the void.</p>\n<h3>The Thrilling Conclusion</h3>\n<p>Eventually, through the most heroic of efforts, I managed to install a few utilities, apps, and copy over some scripts from my personal Mac onto this new one. It still doesn't feel like home, but it's close.</p>\n<p>This harrowing, 15-minute adventure has caused me to reflect more on how I use my tools. I'm not sure I like knowing that I'll either need to migrate this Mac forever, or that I'll need to start over and rebuild my foundations sometime in the future. I like my shortcuts, but that's just it: they're mine, not Apple's not yours, not anyone else's; just mine. I'm not sure I want the burden of migrating or re-learning everything. Is the only answer for me to slowly wean myself off of my little tweaks, my time-savers? I'm not sure.</p>\n<p>But it's been interesting to think about.</p>\n<div class=\"footnote\">\n    <sup>1</sup> This was prior to the 16\" coming out.<br />\n    <sup>2</sup> Somehow Alfred knows that \"set\", short for Settings, refers to System Preferences. I have no idea how it learned this or when, but I've never once asked for that app by its real name.\n</div", "date_published": "2020-02-24T04:06:00-06:00", "title": "That's When I Knew: I Can't Actually Use macOS", "id": "http://brianschrader.com/archive/thats-when-i-knew-i-cant-actually-use-macos/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/pineblog-downtime-post-mortem-a-story-of-finite-resources/", "tags": ["postmortem", "pine.blog", "what-happened"], "content_html": "<p>Pine.blog was down for a while today (~6 hours). What follows is a bit about why and what I've learned from the experience. In the end, nothing was lost and the site is back up. My apologies to all of my users; thanks for your patience.</p>\n<hr />\n<p>Today did not go as planned. As I do, this morning I opened Pine.blog to read the news and instead of seeing a newly updated timeline, the app had logged me out. Worse still, I couldn't log back in, and the website wasn't responding. Sigh.</p>\n<p>Some quick investigation revealed that the disk had filled, which caused the creation of new sessions and access tokens to fail. Admittedly, I don't have any sort of disk usage monitoring on the database server, but because I'd just doubled the amount of storage on that server less than two months ago, I wasn't really thinking it would fill up anytime soon. Regardless, it had.</p>\n<h3>The Causes</h3>\n<p>From what I can tell, a combination of external factors and my own design decisions led to the disk filling up much faster than I was expecting:</p>\n<ol>\n<li>\n<p><strong>Feeds are kinda huge (sometimes).</strong> A few Pine.blog users have feeds that seem to contain hundreds of new items every hour, which Pine.blog will faithfully parse and store in their timelines. In some cases, this meant that such a feed could contain 200,000+ items in only a few weeks. What's worse is that because of a recent change to how timelines work, a timeline can't hold that many items anymore which means Pine.blog was storing a ton of data it would never actually use.</p>\n</li>\n<li>\n<p><strong>Pine.blog stores a lot of data.</strong> By design, Pine.blog doesn't really delete items that it has previously parsed and it stores multiple copies of certain data to make it easier to serve, but this drastically inflates storage requirements.</p>\n</li>\n<li>\n<p><strong>I misunderstood my tools.</strong> I'm not a database guy; I'm an app developer. To me Postgres has always been a bit magical, and today that bit me. About a month ago, I thought I'd read somewhere that the newest versions of Postgres didn't need to be routinely vacuumed, and that running a daily vacuum was an old, outdated practice, so I stopped doing it. <em>This was a bad idea</em>. Without that daily cleaning, the Pine.blog database couldn't reuse space that it no longer needed, and so it kept asking the OS for more disk space, right up until there wasn't any more.</p>\n</li>\n</ol>\n<p>In the end it was the mundane, but powerful combination of a few small things that caused the issues today: some overzealous design choices, a few misunderstandings, and a few overactive feeds.</p>\n<h3>The Solutions</h3>\n<p>Right away, I should admit this whole thing could have been solved a lot sooner. I underestimated the issue at first and tried to keep the site up while I fixed the issue. In hindsight it would have been a lot faster and easier to resize the server to something that had more disk space, vacuum the database, resize the filesystem and scale back down. This whole thing could have been solved in 1-2 hours instead of 6-8.</p>\n<p>That said, here's the two things that I'll be changing about how Pine.blog works in order to prevent this problem in the future:</p>\n<ol>\n<li>\n<p>The nightly vacuum is back. Removing it was a dumb idea.</p>\n</li>\n<li>\n<p><strong>Pine.blog will no longer store the entire history of external feeds.</strong> This one isn't fully in effect yet, but expect the change soon.</p>\n</li>\n</ol>\n<p>As of recently, each Pine.blog timeline has a maximum length of 3000 posts. Once a post falls off the end, you won't be able to find it by scrolling backward in your timeline anymore. This is exactly what Twitter does (although their limit is a modest 800 posts). Feeds will soon do something similar. Pine.blog will keep just the most recent posts in a feed (~3-5000 posts in total) and anything beyond that point will be removed from Pine.blog's database.<sup>1</sup></p>\n<p>I suspect that no one will actually notice these changes once they're rolled out, but to me they mark the end of the road for a naive dream I had back when I started Pine.blog.</p>\n<p><center>\n<strong>tl;dr</strong> Turns out parsing and storing entire portions of the web is hard.\n</center></p>\n<div class=\"footnote\">\n<sup>1.</sup> Hosted blogs are uneffected. Pine.blog will store your entire blog . This change only effects feeds from outside of Pine.blog.\n</div>", "date_published": "2020-02-17T04:57:00-06:00", "title": "Pine.blog Downtime Post-Mortem: A Story of Finite Resources", "id": "http://brianschrader.com/archive/pineblog-downtime-post-mortem-a-story-of-finite-resources/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/an-agency-that-protects-data/", "tags": ["law", "data protection", "privacy", "Kirsten Gillibrand"], "content_html": "<p><a href=\"https://www.gillibrand.senate.gov/news/press/release/confronting-a-data-privacy-crisis-gillibrand-announces-landmark-legislation-to-create-a-data-protection-agency\">New York Senator Kirsten Gillibrand</a> has just announced a bill to create a new Data Protection Agency, which would be in charge of regulating... well data protection.</p>\n<p><a href=\"https://www.gillibrand.senate.gov/imo/media/doc/2.11.2020_Data%20Protection%20Act.pdf\">From the bill</a>:</p>\n<blockquote>\n<p>The privacy of an individual is directly affected by the collection, maintenance, use, and dissemination of personal data.</p>\n<p>In order to protect the privacy of individuals, it is necessary and proper for Congress to regulate the collection, maintenance, use, processing, storage, and dissemination of information.</p>\n</blockquote>\n<p>While I haven't finished reading the actual bill yet, I applaud Senator Gillibrand for proposing the idea. Her bill lays out what the new agency would focus on: regulating how data is collected, used and processed. She also explicitly carving out, what she calls, \"High-Risk Data Practices\" that would require extra protections.</p>\n<p>Some High-Risk Practices (formatting mine):</p>\n<blockquote>\n<p>The term \"high-risk data practice\" means an action by a covered entity that involves...</p>\n<ul>\n<li>any processing of biometric data for the purpose of uniquely identifying an individual...</li>\n<li>processing the personal data of an individual that has not been obtained directly from the individual...</li>\n<li>processing which involves tracking an individual’s geolocation...</li>\n</ul>\n</blockquote>\n<p>According to the Senator's own press release on the topic:</p>\n<blockquote>\n<p>2. [The Agency would maintain] the most innovative, successful tech sector in the world by ensuring fair competition within the digital marketplace.</p>\n<ul>\n<li>The agency would promote data protection and privacy innovation across sectors, developing and providing resources such as Privacy Enhancing Technologies (PETs) that minimize or even eliminate the collection of personal data.</li>\n<li>The agency would ensure equal access to privacy protection and protect against “pay-for-privacy” or “take-it-or-leave-it” provisions in service contracts—because privacy, including online privacy, is a right that should be enforced.</li>\n</ul>\n<p>3. [The Agency would prepare] the American government for the digital age.</p>\n<ul>\n<li>The agency would advise Congress on emerging privacy and technology issues, like deepfakes and encryption. It would also represent the United States at international forums regarding data privacy and inform future treaty agreements regarding data.</li>\n</ul>\n</blockquote>\n<p>From my reading, it looks like this agency would also have the teeth to enforce its rules as opposed to the current FTC rules which companies basically ignore. An agency with this new authority would be utterly transformative for the U.S. Tech Sector and for the lives of everyday citizens.</p>\n<p>I fully support this bill.</p>", "date_published": "2020-02-14T02:30:00-06:00", "title": "An Agency that Protects Data", "id": "http://brianschrader.com/archive/an-agency-that-protects-data/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-sobering-thought/", "tags": ["climate change", "tree planting", "2050"], "content_html": "<p>Rarely do silver bullets actually exist; the truth resists simplicity. <a href=\"https://teamtrees.org\">Tree planting often</a> looked at as a cheap, effective, and catch-all solution to combatting carbon emissions, but that just isn't true. It's two of those things, sure, but it's not all we need to do. Don't get me wrong, I'm a huge fan of planting trees to help trap and store carbon emissions, but it can't be the only thing we do.</p>\n<p>Earlier this morning, I watched a <a href=\"https://www.youtube.com/watch?v=EXkbdELr4EQ&amp;app=desktop\">video</a> from <a href=\"https://www.economist.com/films/2019/09/18/climate-change-the-trouble-with-trees?linkId=100000008031533\">The Economist</a> which covered the topic pretty well (there's even more videos and <a href=\"https://www.economist.com/films/2019/09/18/climate-change-the-trouble-with-trees?linkId=100000008031533\">information in the linked article</a>). While the through-line of the video is that tree planting, when done correctly, can have huge benefits and help combat climate change, Professor Simon Lewis drives home a really sobering point <a href=\"https://youtu.be/EXkbdELr4EQ?t=515\">right at the end</a> (emphasis mine):</p>\n<blockquote>\n<p>Ultimately though, the trouble with trees tackling climate change is space. <strong>There’s just not enough land in the world</strong> to plant enough trees to offset all the carbon emissions from fossil fuels. We could say, let’s restore forest on every single piece of land that used to have forest on from before agriculture. And if we did that it would be about 200bn tonnes of carbon. Now that sounds a lot, but to put it in context, <strong>that’s about 20 years worth of emissions</strong> at present rates.</p>\n<p>- Professor Simon Lewis</p>\n</blockquote>\n<p>So go ahead, plant trees.* Just know: we need a lot more than just trees.</p>\n<div class=\"footnote\">\n* <a href=\"https://teamtrees.org\" title=\"TeamTrees\">TeamTrees</a> is a super easy way to donate to tree planting, btw.\n</div>", "date_published": "2019-11-11T04:18:00-06:00", "title": "A Sobering Thought", "id": "http://brianschrader.com/archive/a-sobering-thought/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/high-tech-empires/", "tags": ["social web", "software", "facebook", "social media"], "content_html": "<p><a href=\"https://stratechery.com/2019/tech-and-liberty/\">Ben Thompson &#8594;</a></p>\n<blockquote>\n<p>In the long run, though, it is very problematic that such a powerful player in our democracy has no accountability. Liberty is not simply about laws, or culture, it is also about structure, and it is right to be concerned about the centralized nature of companies like Facebook.</p>\n</blockquote>\n<p><a href=\"https://www.manton.org/2019/11/06/kill-the-algorithm.html\">Manton Reece &#8594;</a></p>\n<blockquote>\n<p>Platforms that have as many problems as Facebook does can always be improved, but by design they can never be good enough because their size alone is one of the problems.</p>\n</blockquote>\n<p>A difference in scale can become a difference in kind. Facebook and other large Tech companies have more users than most nations have citizens. We look down on autocratic governments, and will hopefully continue to do so. We can't forget that these large corporations are a new form of the same thing.</p>\n<p>We have a words to describe organizations of large enough size that exert control over vastly different groups of people and that aren't answerable to their constituents. We call them autocracies; we call them empires.</p>", "date_published": "2019-11-07T01:20:00-06:00", "title": "High-Tech Empires", "id": "http://brianschrader.com/archive/high-tech-empires/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/remembering-things-is-hard/", "tags": ["code", "software", "preflight", "git"], "content_html": "<p>I'm not very good at remembering things, even simple things, and I'm even worse at grinding (doing a simple or repetitive task more than once). That's one reason why I love being a developer: often times, I can script simple, repetitive, and common tasks.</p>\n<p>When it comes to development, although most of my projects leverage some form of automated continuous testing and linting, by the time I've pushed up my code and the tests have run, I've moved on to some other task. This means that when my code has a failing test or a linting error, I have to stop the new thing that I'm doing, stash my changes, and fix the error. I <em>should</em> remember to run the tests before I push my code, but I never do.</p>\n<p>So in lieu of doing the hard work to remember to run the tests and becoming a better person in the process, I've written a <code>pre-commit</code> script that runs before I commit my code. That way I can't commit my code without fixing the error, or explicitly ignoring it (with the <code>-n</code> flag).*</p>\n<div class=\"footnote\">\n* This also helps avoid the unprofessional looking \"Fixes linting\" commits.\n</div>\n\n<hr />\n<p>Here's my <code>.git/hooks/pre-commit</code> file for any Django project. Give it a shot yourself and let me know if it helps you write better code.</p>\n<pre><code class=\"bash\">#! /bin/bash\nset -e;\nlog() { echo \"[$(date)] $1\"; }\n\ncat << EOF\n-----------------------------------\nRunning the tests...\nYou might want to get a coffee. ☕️\n-----------------------------------\nlog \"Linting the code...\"\nflake8\nlog \"Running the tests...\"\n./manage.py test\nlog \"Done.\"\n</code></pre>\n\n<p><link rel=\"stylesheet\" href=\"http://yandex.st/highlightjs/8.0/styles/default.min.css\">\n<script src=\"http://yandex.st/highlightjs/8.0/highlight.min.js\"></script>\n<script>hljs.initHighlightingOnLoad();</script></p>", "date_published": "2019-11-03T18:59:00-06:00", "title": "Remembering Things is Hard", "id": "http://brianschrader.com/archive/remembering-things-is-hard/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/finally/", "tags": ["pine.blog", "open web", "rss"], "content_html": "<p>Today marks the release of <a href=\"https://blog.pine.blog/2019/10/fall-2019-update-hosted-blogs/\">Pine.blog's Fall Update</a>. It's a release I've been working on for months now and it feels great to finally get it out into the world. With this release, Pine.blog is now what I'd wanted it to be when I started <a href=\"/archive/a-vision-of-the-open-web/\">dreaming of what a the open web could do</a>. On Pine.blog, you can follow your interests, keep up with the latest news, and join the conversation by starting a blog. I can finally say that the core features I want are in place.</p>\n<p>Obviously my goals for Pine.blog have expanded since I originally thought of the idea in 2014 (and began writing it in 2016), so there's still <strong>a lot to do</strong>.</p>", "date_published": "2019-10-08T01:34:00-06:00", "title": "Finally", "id": "http://brianschrader.com/archive/finally/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-new-adventure/", "tags": ["photography", "hobbies", "money sink", ""], "content_html": "<p>Last week, I bought a camera. I've wanted one for a while, but I'd never really looked around for something that would fit my needs. A few of my <a href=\"https://www.instagram.com/photorayg/\">friends</a> and <a href=\"http://www.museofadventure.com\">family</a> are actual photographers, and I knew that I didn't want to do what they do. I'd be carelessly jumping into a deep end to swim with reel big fish.</p>\n<p>I haven't owned a dedicated camera in over a decade. Ever since 2010, the only camera I've owned came with an iPhone attached to it. However, while the iPhone X's camera is great, it's just not enough for a whole myriad of situations, and in the last year I've found myself ever more limited by what my phone's camera could and couldn't do.</p>\n<p>There's an old adage: \"the best camera is the one you have with you\", and if I was going to have this camera with me, even a fraction of the time that I have my phone with me, it had to meet some pretty strict qualifications: It had to be really versatile (inter-changeable lenses was a hard requirement), it had to be compact enough to take almost anywhere, and it had to be a camera that could grow with me as I delve into this new-fangled world. So I talked to some people, read a bunch of articles, watched a bunch of reviews, and got this:</p>\n<div style=\"text-align:center;\">\n    <img\n        alt=\"My new camera\"\n        src=\"/images/collections/a6000/camera-web.jpg\"\n        style=\"width:300px;margin-left:auto;margin-right:auto;\"\n    />\n    <caption>\n        <a href=\"https://www.amazon.com/Sony-Mirrorless-Digitial-3-0-Inch-16-50mm/dp/B00I8BICB2/ref=sr_1_7?keywords=sony+a6000&qid=1566087531&s=gateway&sr=8-7\" title=\"The Sony α6000\">\n            The Sony α6000\n        </a>\n    </caption>\n</div>\n\n<p>I've heard from quite a few people that Sony's α6000 and α6400 are really good for people who want a great camera, but aren't willing to dive into DSLRs. I don't know much about that second bit, but that description matched me to a T. As I've only had it a week so far, my opinions are still riddled with <a href=\"https://www.urbandictionary.com/define.php?term=Ney%20Toy%20Syndrome\">Ney Toy Syndrome</a>. That said, I really like this camera. It's small and light enough to fit in the spare pocket of my daily carry bag, and it uses Sony's E-Mount which means that there's tons of compatible lenses, making it really versatile.</p>\n<p>I ended up getting the α6000 mostly because of the price. The α6400 was more than I wanted to spend and anything below the α6000 didn't have a viewfinder, which was a dealbreaker. I'm still rocking the kit lens for now, but I plan on getting a 50/55mm Prime lens pretty soon. Before that though, I need to get a much more intuitive grasp of how to properly use what I have, and it'll probably take me a while to get the basics down.</p>\n<h3>A Checkpoint in Time</h3>\n<p>While I'll probably be posting most of the good shots I take to my <a href=\"https://photos.brianschrader.com/\">photoblog</a>, below are a few of my favorite shots from the last week. I'm posting them here so that they serve as a record of my skills as a photographer right now. Hopefully, as time goes on and my skills improve, I'll look back on these pictures like I look back on old code I've written: with fond memories, and mild disgust.</p>\n<div style=\"text-align:center;\">\n    <a href=\"/images/collections/a6000/moonlight.jpg\" title=\"Moonlight - Full Image\">\n        <img\n            alt=\"Moonlight\"\n            src=\"/images/collections/a6000/moonlight-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/bark.jpg\" title=\"Bark - Full Image\">\n        <img\n            alt=\"Bark\"\n            src=\"/images/collections/a6000/bark-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/private.JPG\" title=\"Private - Full Image\">\n        <img\n            alt=\"Private\"\n            src=\"/images/collections/a6000/private-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/tank.JPG\" title=\"Tank - Full Image\">\n        <img\n            alt=\"Tank\"\n            src=\"/images/collections/a6000/tank-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n</div>", "date_published": "2019-08-18T01:25:00-06:00", "title": "A New Adventure", "id": "http://brianschrader.com/archive/a-new-adventure/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/dont-ban-infinite-scrolling-license-engineers-instead/", "tags": ["software engineering", "ethics", "legal", ""], "content_html": "<p>Yesterday, the <a href=\"https://www.theverge.com/2019/7/30/20746878/josh-hawley-dark-patterns-platform-design-autoplay-youtube-videos-scrolling-snapstreaks-illegal\">Verge reported that Sen. Josh Hawley sponsored</a> a bill that aims to reduce the tech industry’s use of \"addictive design\" practices by putting a ban on features like infinite scrolling and autoplaying video. While I applaud Congress for focusing on this important issue, the proposed solution is both naive and unproductive. When a surgeon is accused of malpractice, the appropriate solution is not to ban their use of the scalpel, it's to revoke their license.</p>\n<p>I have long argued that Software Engineers (especially those at large companies that affect the lives of millions of people) <a href=\"/archive/software-engineering/\">should be licensed</a>. Requiring a license to practice Software Engineering would finally place software in the realm of the other classical engineering fields and require practitioners to use their skills ethically and for the benefit of society. It would also help educate engineers on the risks and trade-offs with the decisions they make and give the government a lever to pull when trying to encourage ethical practices across the industry. Likewise, licensed engineers are able to refuse to implement unethical or unsafe designs when they fear that they could lose their license.</p>\n<p>One common argument against this point is that the tech industry is filled with lots of independent developers and others who operate relatively small businesses and that licensing them would put an damper on overall innovation in the industry. However, while we do often require Civil Engineers to have a license, we don't apply the same logic to carpenters, and we can apply the same kinds of criteria to Software Enginering licensure.</p>\n<p>We've required licenses for those practicing classical Engineering, Medicine, and Law for a long time<sup>1</sup>, and those licenses have helped governments and the licensed individuals themselves steer industry practice away from things that can be considered unethical or unsafe. Instead of trying to take powerful tools away from Engineers, we should instead be focused on enabling and educating them to make ethical and societally beneficial decisions. The Internet is part of the infrastructure of our modern world, so let's ensure that the people who build and maintain it have society's best interests at heart.</p>\n<div class=\"footnote\">\n<sup>1</sup> As an aside, we even license hairdressers and locksmiths. If unlocking cars or cutting hair requires a license, why doesn't building software that impacts 20% of the world's population?\n</div>", "date_published": "2019-07-31T17:46:00-06:00", "title": "Don't Ban Infinite Scrolling, License Engineers Instead", "id": "http://brianschrader.com/archive/dont-ban-infinite-scrolling-license-engineers-instead/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-social-web/", "tags": ["open web", "social media", "pine.blog"], "content_html": "<p>Things have been quiet here recently, and that's largely because I've been really busy working on lots of cool new stuff for <a href=\"https://pine.blog/\">Pine.blog</a>. While the last few months have been full of steady progress, there's still a ways to go before the next set of features are ready for the world. If everything goes according to plan, the next major release should allow premium users to start their own blog on the site.</p>\n<p>So far, Pine.blog has been mostly focused on being a good feed reader, and while I think it is, there's so much more that can be done with feeds and blogs than just read them.</p>\n<h3>Feed Readers are the First Step</h3>\n<p>I've wanted Pine.blog to support custom blogs since the beginning, and that's largely because I think that by making it easier to both read and write on the open web, we can give people a viable alternative to more traditional social networks and offer them an escape from the problems those platforms have.</p>\n<p>Using tools and technologies that have existed for years, the web itself can be a social network, but in order for people to embrace that idea there have to be easy-to-use tools that are new and powerful, but also familiar and approchable, and importantly, there also have to be people to talk to; the web has to <em>feel</em> like a social network.</p>\n<h3>Pushing Forward</h3>\n<p>One of the things I've come to strongly believe is that as developers (or as anyone who makes a thing) we can work to push the world toward we think it should be, and I think that the Web can and should be our shared social network.</p>\n<p>This is why I'm so excited by what I see as the future for Pine.blog. If we want people to move off of the platforms we think are the cause of so many problems in our world, we need to give those people a place to go. Most people aren't going to start a blog and use a feed reader unless we, as the people with the skills to do so, make the Social Web better than Social Media.</p>", "date_published": "2019-07-28T06:35:00-06:00", "title": "The Social Web", "id": "http://brianschrader.com/archive/the-social-web/"}], "author": {"url": "https://brianschrader.com", "name": "Brian Schrader", "avatar": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "icon": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}