{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "http://brianschrader.com/archive/the-mysterious-potential-of-the-plane/", "url": "http://brianschrader.com/archive/the-mysterious-potential-of-the-plane/", "title": "The Mysterious Potential of the Plane", "date_published": "2024-12-13T02:46:00", "tags": ["mathematics", "math"], "author": {"name": "Brian Schrader"}, "content_html": "<p>In recent years I've embarked on a sort of journey of rediscovery with respect to mathematics. As a kid I was <em>somewhat</em> good at math and I spent my college years doing lots of it&mdash;to the point where I grew to really dislike it. But even in those times, mathematics&mdash;while becoming increasingly difficult&mdash;always seemed like it was trying to tell me something. These days, it fascinates me.</p>\n<p>A common observation among those who study classical engineering fields is that many (if not most) of the problem domains are modelled with very similar techniques. The motion of a cantilevered beam, a road bridge, a plane wing, a mass on a spring, a musical note, and even a planet's orbit can be described by very similar mathematics. Indeed so many physical phenomena can be described by these equations that it can make you wonder if you've stumbled into some <a href=\"https://www.wired.com/2016/07/everything-harmonic-oscillator/\">great secret</a> of the universe.</p>\n<figure>\n<img class=\"image-center\" src=\"/images/blog/Horizontal-mass-on-spring.svg\" />\n<figcaption style=\"display: block; text-align: center;\"><small>To the physics/engineering undergrad, <i>everything</i> is a mass on a spring.</small></figcaption>\n</figure>\n\n<p>But that wonderful truth is only a gateway to something much deeper, more fundamental&mdash;a true capital-S Secret of the Universe. Mathematics tends to deceive with simplicity, and there's few things in this world that hide more secrets than this simplest of concepts.</p>\n<h2>Consider the Plane</h2>\n<p>As children we're taught about the 2-D Plane.<sup>1</sup> At first, students are confused in a manner similar to how they felt when being told <math math;\"><mrow><mi>x</mi><mrow></math> was a number now, and oftentimes that confusion grows into consternation. At worst, plotting and manipulating curves on this plane feels pointless, arbitrary, and unnatural. For those who come to know the plane as a tool, it can be quite an enlightening process. As an undergrad engineering student, you become familiar with the plane and its rules; you learn to shape curves and solve perspective puzzles with it. Modern <a href=\"https://www.youtube.com/watch?v=r6sGWTCMz2k\">video animations</a> make this so much more intuitive because they're able to show a figure on the plane change over time: you can watch it squish and stretch as you adjust the coefficients of a quadratic.</p>\n<p><img class=\"image-center\" src=\"/images/blog/cos-grid.png\" style=\"width:500px\" /></p>\n<p>What's more Geometry holds so much deeper meaning in our world than I think most people imagine. Vast numbers of people can use mathematics to do every day tasks: measure the square-footage of a room, scale up a recipe for a family dinner, or plan their finances, but Geometry does so much more. Simple rules about finding the angles in a triangle can help measure the curvature of the universe, and simple sines and cosines (which form the backbone of many vector operations) enable the ability to encode the meaning of abstract linguistic concepts in modern Large Language Models. Our universe is made of math in truly fascinating ways.</p>\n<p>But this isn't my point. So far, this has all been backstory.</p>\n<h2>Exploring the Plane</h2>\n<p>What's truly wondrous about the 2-D Plane isn't what you can plot, but what you can discover. There are infinitely many lines, curves, and shapes one can draw on the 2-D Plane and while most of them are useless, quite a few are incredible. Those are the ones we plot to find the motion of a ball in the air, or the speed of a planet's orbit over time. But there are some curves that hold incredible secrets. We know of a few and there are likely many, many more. These magical curves transform our understanding of mathematics itself.</p>\n<p>Consider the logarithm:</p>\n<div>\n    <math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n      <mrow>\n        <mi>x</mi>\n        <mo>=</mo>\n        <mn>1,000</mn>\n        <mtext> or </mtext>\n        <msup>\n          <mn>10</mn>\n          <mn>3</mn>\n        </msup>\n      </mrow>\n    </math>\n\n    <center style=\"display: block; padding: 0.25rem;\">therefore</center>\n\n    <math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n      <mrow>\n        <mi>l</mi>\n        <mi>o</mi>\n        <mi>g</mi>\n        <mo form=\"prefix\" stretchy=\"false\">(</mo>\n        <mi>x</mi>\n        <mo form=\"postfix\" stretchy=\"false\">)</mo>\n        <mo>=</mo>\n        <mn>3</mn>\n      </mrow>\n    </math>\n</div>\n\n<p>This is a function that can be used to do all sorts of practical, useful operations, but it can also <strong>convert multiplication into addition</strong>.</p>\n<math display=\"block\" class=\"tml-display\" style=\"display:block math; margin-bottom: 0.5rem;\">\n  <mrow>\n    <msup>\n      <mn>10</mn>\n      <mn>3</mn>\n    </msup>\n    <mo>*</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>5</mn>\n    </msup>\n    <mo>=</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>8</mn>\n    </msup>\n  </mrow>\n</math>\n\n<math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n  <mrow>\n    <mi>l</mi>\n    <mi>o</mi>\n    <mi>g</mi>\n    <mo form=\"prefix\" stretchy=\"false\">(</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>3</mn>\n    </msup>\n    <mo form=\"postfix\" stretchy=\"false\">)</mo>\n    <mo>+</mo>\n    <mi>l</mi>\n    <mi>o</mi>\n    <mi>g</mi>\n    <mo form=\"prefix\" stretchy=\"false\">(</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>5</mn>\n    </msup>\n    <mo form=\"postfix\" stretchy=\"false\">)</mo>\n    <mo>=</mo>\n    <mn>8</mn>\n  </mrow>\n</math>\n\n<p>Plotted, the <a href=\"https://www.youtube.com/watch?v=OjIwCOevUew\">logarithm function</a> makes a curve on the 2-D Plane. This means that there exists a curve on the plane which converts multiplication to addition! What other <a href=\"https://www.youtube.com/watch?v=f8CXG7dS-D0\">magical curves</a> exist with incredible properties? Perhaps there's a curve that plots itself? Oh wait! <a href=\"https://www.youtube.com/watch?v=_s5RFgd59ao\">There is</a>!</p>\n<p>At it's core, a function is a thing that takes a number(s) and returns another. This sequence of values can be plotted to form a curve on the plane. There's a curve mapping subtraction to multiplication, one for the GDP of the U.S. over time, and (given some encoding trickery) a curve describing the lifespan in seconds of each and every being that will ever exist! They're all in there somewhere; we just have to find them.</p>\n<p>This is one of the true wonders of mathematics<sup>2</sup>, and more specifically of geometry. Who would think that simple shapes and curves could tell such great truths? Yet so much hides within the expanse. In this way, the work of finding such curves is one of exploration in a treacherous wilderness. With simple tools, one carves a path of discovery amid the endless vastness, returning to share the knowledge they have found.</p>\n<h2>The Secrets Within</h2>\n<p>Held within the depths of this infinite expanse there are perhaps infinitely many fundamental secrets. We only find them through careful study, or occasionally by accident, and we have no idea how many we might be missing&mdash;even amidst the sectors of that expanse we've so thoroughly explored.</p>\n<p>It's so wondrous to me that such a simple concept could hold such great truths and that shapes and curves upon the plane could so accurately model the natural world. Perhaps it should be the Plane or the Triangle that stands beside Fire as our most powerful invention.</p>\n<div class=\"footnote\">\n<sup>1</sup> For most of my life, I'd been confused when people mentioned \"the complex plane\" or \"the number line\" rather than \"a plane\" or \"a number line\", but the beauty in properly capitalizing the name \"The 2-D Plane\" is that, in a Platonic-Forms kind of way, it reveals the truth that we're all talking about the <i>same</i> plane. There's only one. We may depict some fragment of it on a board, but the true 2-D Plane exists in singular and only in Form.\n</div>\n<div class=\"footnote\">\n<sup>2</sup> No doubt some people out there will read a few of my points here and correctly point out that these are more points about infinity rather than specifically the 2-D plane. You are correct, but my point remains valid.\n</div>"}, {"id": "http://brianschrader.com/archive/nothing-throughout-the-ages/", "url": "http://brianschrader.com/archive/nothing-throughout-the-ages/", "title": "Nothing Throughout the Ages", "date_published": "2024-11-13T04:23:00", "tags": ["history", "knowledge"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I'm fascinated by the systems by which we, as humans, make and communicate knowledge. From the very beginning of our species we've done our best to devise ways to understand the natural world and our place in it, and we've used a huge number of different systems of thought to organize, piece together, and build a more complete picture of the world for ourselves.</p>\n<p>I think a lot of people may misunderstand my point here, so let me be very clear, when I say a <em>system of knowledge-making</em> I mean <em>any</em> system, no matter how misunderstood, how imprecise, or how flawed it might seem to modern sensibilities. Religion is a knowledge system, science is a knowledge system, oral tales and legends are a knowledge system, so is writing, music, folklore, culture, and any other way humans pass down forms of knowledge from one generation to the next.</p>\n<p>Every system like this has its flaws and its benefits. Oral tales and folklore for example are excellent ways to pass down traditions and values, but they're terrible ways to ensure later generations understand the precise temperature at which water boils.</p>\n<p>But in particular, I'm very interested in the places where systems of knowledge converge on similar or identical truths, even if they do so for different reasons.</p>\n<div class=\"image-container-center\">\n    <img src=\"/images/blog/corpuscle.jpg\" style=\"width: 400px;\" class=\"image-center\">\n    <small><center>An early-modern diagram of atoms. Drawing: me.</center></small>\n</div>\n\n<p>For example, an alchemist by the name of George Starkey, living in England in the 1650s, discovered a process by which he could chemically cause water to freeze via the endothermic reaction of sal ammoniac (ammonium chloride) with water, though he explained the phenomenon very differently than we would today&mdash;believing instead that he had isolated the quality of coldness and dryness by manipulating the fundamental particles of the compound. Nevertheless, his method worked (and worked well enough for his friends to try persuading him to sell \"artificial ice\" to Italian nobles in the summer).<sup>1</sup></p>\n<h3>Nothing, Null &amp; the Void</h3>\n<p>Likewise the concept of Nothing has puzzled generations of knowledge-makers. Famously the number Zero was absent from Western mathematics until it was introduced around 1200 C.E.. Adding Nothing to a number was considered nonsense. Why even do the math problem then?</p>\n<p>In regard to physics, Aristotle <a href=\"http://classics.mit.edu/Aristotle/physics.5.v.html\">argued</a>, rather forcefully, that Nothing (what he called the <a href=\"https://en.wikipedia.org/wiki/Horror_vacui_(physics)\">void</a>) simply cannot exist because such an existence would be paradoxical. Aristotle viewed matter as continuous, and did not accept the idea of the \"atom\" (that is, a smallest particle of matter) precisely because it would beg a very obvious question: what's between the atoms? It couldn't be nothing, because Nothing couldn't exist.</p>\n<div class=\"image-container-center\">\n    <img src=\"/images/blog/n-corpuscle.jpg\" style=\"width: 400px;\" class=\"image-center\">\n    <small><center>Another depiction of corpuscles. Drawing: me.</center></small>\n</div>\n\n<p>This school of thought lasted for over a thousand years. Eventually though particle theory, or what was called at the time \"the corpuscular theory of matter\" became increasingly popular right around the time of the Scientific Revolution. All the while, the question that Aristotle posed went unanswered.</p>\n<p>Today we know that the vacuum does indeed exist*. <small>(Uh oh)</small></p>\n<p>Indeed the classical vacuum: without air or other gross matter, exists in plenty. Most of space is empty, even most of what we call matter is empty. This is the truth of space and of matter: they are made of mostly nothing. However there are several <a href=\"https://www.youtube.com/watch?v=PhfqdBk8qxk\">kinds of nothing</a>, and empty space is only one of those kinds. At the barest level, our current understanding suggests that space, even when devoid of matter or force particles, is still filled with something: namely <a href=\"https://www.youtube.com/watch?v=ATcrrzJFtBY\">quantum fields</a>, and even more abstractly with potential.</p>\n<p>And this is where the asterisk from before comes in: as far as we know, there is no patch of space that is truly devoid of these fundamental building blocks, so in a way: Aristotle was right.<sup>2</sup></p>\n<h3>Math ado about Nothing</h3>\n<p>As I mentioned before, Western mathematics had to wait until the thirteenth century to be introduced to the concept of Zero in a formal way. Though once incorporated, Nothing, represented by the number zero, proved to be incredibly useful.</p>\n<p>Today the concept of Nothing underpins our entire understanding of numbers. Indeed it seems one can <a href=\"https://www.youtube.com/watch?v=S4zfmcTC5bM\">construct all the natural numbers</a> out of it. In this way Mathematics scoffs at poor Aristotle, for unlike matter which is <em>mostly nothing</em>, the counting numbers and therefore all numbers are really nothing at all!<sup>3</sup></p>\n<p>Nothing, it turns out, is Everything.</p>\n<div style=\"border:1px solid #ccc; border-radius: 3px; padding: 0.5rem;\">\n<pre><code>Consider constructing ℕ using the Empty Set\n(i.e. a set containing nothing):\n  0 = {}\n  1 = {{}}\n  2 = {{{}}}\n  ...\n</code></pre></div>\n\n<h3>Religious Nothing</h3>\n<p>The Abrahamic Religions (along with many other faiths) also feverishly debate the concept of Nothing. In particular, there is the idea that the Christian God created the universe \"ex nihilo\", from nothing, as written in the Book of Genesis. Likewise faiths from all over the world deal with the question of Nothing, though usually in the context of the question: Why is there Anything?</p>\n<p>Creation stories, like that in Genesis, exist all over the world and come in many truly incredible forms.</p>\n<p>All across the world, throughout time and space, humans have needed an answer to the same fundamental questions and we've found a bunch of conflicting and corroborating ways to answer them. Each of these answers have some truth to them and some methods of knowledge-making attempt to answer questions that others simply cannot. Each system is therefore one of partial truths. Science, for example, can answer the question of how matter moves, but it cannot answer what it means to exist.</p>\n<p>I think that's what I love about studying knowledge-systems. I find myself trying to inhabit the minds of those who lived under very different presuppositions about the world, to see the universe through their eyes, and in doing so to find some new and partial truths about the world.</p>\n<h3>Nothing Is</h3>\n<p>In particular, the concept of Nothing has confounded our reasoning for millenia, and while we seem to have a good grip on it now, it's important to remember that we really only guess at its properties (if Nothing can even have properties&mdash;Aristotle, help!).</p>\n<p>Indeed, the concept of Nothing has evolved over the past several thousand years, and even still we debate what it really means. That's something I love about questions like this: the debate will likely never end. Questions posed before the Fall of Rome still rattle around in the minds of people today and while sometimes Physics, or Mathematics, or one's Faith can make attempts to answer these questions, we may truly never know. Such truths may be beyond us.</p>\n<div class=\"footnote\">\n<sup>1</sup> See <a href=\"https://bookshop.org/p/books/gehennical-fire-the-lives-of-george-starkey-an-american-alchemist-in-the-scientific-revolution-william-r-newman/6709407?ean=9780226577142\">Gehennical Fire</a> by William Newman.<br />\n<sup>2</sup> Just not in the way he intended.<br />\n<sup>3</sup> Since all types of numbers are ultimately based on the so called Natural Numbers.\n</div>"}, {"id": "http://brianschrader.com/archive/running--securing-servers-a-concise-guide/", "url": "http://brianschrader.com/archive/running--securing-servers-a-concise-guide/", "title": "Running & Securing Servers: A Concise Guide", "date_published": "2024-10-21T17:47:00", "tags": ["software", "programming"], "author": {"name": "Brian Schrader"}, "content_html": "<p>It might be pretty out-of-vogue to host your own servers in 2024, but I still do it and I quite like it. There's a lot of great benefits to building software on basic infrastructure and I always find myself appreciating the flexibility that simple VPS hosting brings. That said, you do need to be careful. Life as a developer on the Internet requires a pretty decent familiarity with security best-practices.</p>\n<p>Being self-hosted, there's also a lot of simple design decisions that you need to make when running a system on simple VPSs, and there's really not a lot of good info out there to help with this.</p>\n<p>So, here's a simple guide to some of the things I do when setting up my servers.</p>\n<p><span style=\"padding: 0.5rem; border: 1px solid gray; border-radius: 3px;\" class=\"image-center \">\nThis post isn't sponsored by Linode. It's just what I know best.\n</span></p>\n<p><strong>1. Follow <a href=\"https://techdocs.akamai.com/cloud-computing/docs/set-up-and-secure-a-compute-instance\">Linode/Akamai's Great Guide</a> for Securing Your Server.</strong></p>\n<p>Always set up ssh key forwarding and use it. That said, I usually end up leaving Password Authentication Enabled, since I've had problems remoting in from a known machine (i.e. my laptop isn't available). In these cases I use a very strong password (Apple's Keychain app will make up to 31 character random passwords) and synced with iCloud so it's on my phone.</p>\n<p><strong>2. Set Up a Cloud Firewall</strong></p>\n<p>These days, I prefer using the cloud firewalls provided by the platform (here's a <a href=\"https://techdocs.akamai.com/cloud-computing/docs/getting-started-with-cloud-firewalls\">guide for setting this up on Linode</a>). I still do set up simple on-device firewalls on the server itself, but I depend more on the cloud firewall since it's easier to configure.</p>\n<p><strong>3. Configure Basic Maintenance Cronjobs</strong></p>\n<p>These days, I usually set up a few basic cron jobs to monitor things and keep things running. Here's a list of my typical cron jobs. This list will vary a bit depending on what kind of server you're setting up.</p>\n<ul>\n<li>Postgres nightly/weekly vacuum.</li>\n<li>Disk Usage &amp; Avg CPU Usage monitoring using <a href=\"https://nine9s.cloud/kb/measure-quickstart\">Nine9s Measures</a></li>\n<li>Nightly DB Backup &amp; Archive (if needed, see 4)</li>\n<li>Nightly <a href=\"https://unix.stackexchange.com/questions/139513/how-to-clear-journalctl#194058\">Log Trimming</a> (keep 30 days)</li>\n<li>Automatic Deploys (see 5)</li>\n</ul>\n<p>As an aside here, I use <a href=\"https://pushover.net\">Pushover</a> in a lot of my shell scripts. I send a quick API call to the service which forwards Push Notifications to my phone. That way I get notified of things like build failures which normally fail silently.</p>\n<p><strong>4. Set Up Automated Backups</strong></p>\n<p>If your platform supports it, just use the automated backups for your servers. It's so easy and well worth a few extra bucks per month. If you're not in the position to use those (e.g. Linode when wont't back up encrypted partitions), then make sure you have a cron job that backs up your database. I use simple <code>pgdump | gzip</code> commands in those cases.</p>\n<p>If you do the backups yourself, be sure to test <em>restoring from your backups as well!</em></p>\n<p><strong>5. Apps go in Containers</strong></p>\n<p>I use Docker, but any container system works. I've been told this setup isn't \"how Docker is intended to be used\", but that's fine with me. It works. I deploy my apps to my servers using a build script that usually runs automatically. It uses the production git repo for my docker compose files and runs a simple <code>docker compose up</code> with the configuration for production. I even have it set up to boot a backup copy of the current app while it deploys the new one so I get zero-downtime deployments.</p>\n<p>It's probably overkill to do this, but it works well and avoids the possibility of corrupting code files on the host machine. The automatic deploy (which I frequently do nightly) is awesome because it means I never have to think about which changes have made it to production. If it's in <code>main</code> it's in prod.</p>\n<p>I also run my databases (which is almost always Postgres) in a container as well, only because it makes minor upgrades easier.</p>\n<p><strong>6. Run Webservers on the Host</strong></p>\n<p>Above, I told you that I use Docker. However these days I always run the webserver (nginx in my case, though Caddy is also very nice) directly on the host. Nginx then proxy-passes to my my containers using the <a href=\"https://stackoverflow.com/a/20778887\">loopback address</a>. That way nothing is exposed (Docker likes to punch holes in firewalls). Running nginx on the host let's <code>certbot</code> work as expected.</p>\n<p><strong>7. Set Up Break-Glass Measures</strong></p>\n<p>The single most popular post on this blog is about my (in)famous <a href=\"https://brianschrader.com/archive/why-all-my-servers-have-an-8gb-empty-file/\">8GB Empty File</a> break-glass measure. I don't always do this anymore, but it has saved me a bunch of times. To me, SSH password auth is a kind of break-glass fallback too.</p>\n<h3>What Else?</h3>\n<p>That's all I can think of at the moment. It's a lot, but it's also not too bad. You don't need to be scared of hosting things yourself, but you do need to be careful. It's a wild world out there on the internet.</p>\n<p>As a final note, if you're looking to get a handle on web architecture stuff, I recommend this <a href=\"https://marco.org/2014/03/27/web-hosting-for-app-developers\">blog post</a> for a quick rundown on that. Practical Web Architecture is difficult to learn in my experience, and it takes a lot of pondering, trial, and error to do it right. Most resources are intended for enterprise-scale deployments and not smaller projects. In general, don't over-complicate things if you don't need to. One of the best parts about hosting your own apps this way is that you have the flexibility to change things around as you grow (at the cost of some work and likely some downtime).</p>\n<p>I've been doing this for a while now, but I'm sure there's something I've missed. This guide is certainly not extensive, but it should at least help you avoid some major headaches. I can say that from experience.</p>"}, {"id": "http://brianschrader.com/archive/the-joys-of-playing-live-music/", "url": "http://brianschrader.com/archive/the-joys-of-playing-live-music/", "title": "The Joys of Playing Live Music", "date_published": "2024-08-30T18:46:00", "tags": ["music"], "author": {"name": "Brian Schrader"}, "content_html": "<p>My band, <a href=\"https://thefourthsection.com\">The Fourth Section</a> has been playing more frequent shows lately and along side all of that we've been recording select songs and publishing them on YouTube.</p>\n<p>We're well on the way to another album (though the timing is very uncertain). That said though, it feels good to be able to share these live versions of some of our new music. We've even put together a <a href=\"https://www.youtube.com/playlist?list=PLno125jj5NexCAVxnXk8cKI6ZAvfH01p6\">playlist</a> of these edited versions which will continue to grow as we write and perform new material.</p>\n<div class=\"image-center\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/TpeQgpwBSlI?si=lP8ztEP9NJBW1Zo_\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div>\n\n<p>I've been playing in a band for nearly a decade now and while my love of writing and playing music has been a crucial release valve and creative outlet for me, one of the best parts of playing in a band is playing live. It's hard work, but it's so fulfilling.</p>\n<blockquote>\n<p>[For nearly all of human history] in order to hear a piece of music you had to be within earshot of someone playing it.<br />\n- John Green (vlogbrothers)</p>\n</blockquote>\n<p>Live music is something special. Unlike recorded music&mdash;which really hasn't been around all that long in human history&mdash;live music has been with us since the beginning. Regardless of form, there's something primal about being in a room where music is being played. It's a communal experience where a group of people sit and appreciate a thing together. Live music is where art meets mind.</p>\n<p>And it's not just bands. I'm always struck by just how captivating a solo artist with a guitar can be in a live performance. I love a good acoustic song, but there's something indescribable about being in the room that just can't be replicated by the best recording. A good acoustic song recording can make me feel things, but a good live performance can enthrall me; it can make time stop.</p>\n<p>Live music is one of many reminders that we are still very human. Even in this modern and increasingly disconnected world, we still need the same things that drove early humans in times long gone to pound a drum and sing together.</p>\n<p>There's tremendous beauty in that, I think.</p>"}, {"id": "http://brianschrader.com/archive/the-times-and-i-are-changing/", "url": "http://brianschrader.com/archive/the-times-and-i-are-changing/", "title": "The Times and I Are Changing", "date_published": "2024-06-09T04:51:00", "tags": ["personal"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Yesterday I went hiking at Lake Cuyamaca and took some pictures. Let's look at them as we discuss something I've been wanting to write for a long time.</p>\n<p><img\n    class=\"image-center\"\n    style=\"width: 750px;\"\n    alt=\"Geese on the Lake\"\n    src=\"/images/blog/Geese.png\"\n    height=\"500\"\n    width=\"750\"\n/></p>\n<h2>The Past</h2>\n<p>When this blog began in 2012 I was in the very early days of learning to code. In fact I built this site back then exactly for the purpose of teaching myself how websites (and the internet) actually worked. Back then I was in school to become an Aerospace Engineer (a subject I never really liked) and I found myself both excelling at and being interested in web development.</p>\n<p>For the next almost-decade I hopped between jobs, built several apps and services, joined a startup, founded more than one company, and worked as a contractor. Then, as go most stories in our present era: 2020 happened.</p>\n<p>It was a very strange time. I was unemployed for a while with nothing but my side projects to occupy my time. I built a bunch of new things&mdash;and even wrote a book about how to build things. I was perhaps the most productive developer I've ever been. To this day there are times when I wax nostalgic for those days (just without the 2020-current-events part).</p>\n<p>But when things finally settled down I found myself working full-time, finally, for my own company: SkyRocket Software, doing software contracting. I'm decent enough at the work that I suspect I'll be fine professionally for some time, but during all the 2020/21 craziness something changed. Not just with the world, but with me.</p>\n<p><img\n    class=\"image-right\"\n    style=\"width: 350px; margin-right: 0; padding-right: 0;\"\n    alt=\"Mustard Grass with a Mountain Behind\"\n    src=\"/images/blog/Mustard.png\"\n    height=\"525\"\n    width=\"350\"\n/></p>\n<h2>The Present</h2>\n<p>My thirties came and with that my interests began to shift dramatically. I still love coding and I still do it for a living, but it's not something I obsess over anymore. It's not something I want to do much outside of work (though this isn't universally true). I still run my own servers and all that, but I've stopped dreaming up new projects and instead I've begun to consider shutting most of my existing ones down. As time has gone on I've even found that I care less and less about tech in general. I still exist within this world, but I don't feel anymore that I live <em>in</em> it. As well I feel the industry has drifted away from the things I'm personally interested in&mdash;or I'm just getting cranky and old. <code>¯\\_(ツ)_/¯</code></p>\n<p>Either way something has changed.</p>\n<p>These days I'm far more interested in reading, writing, and music than coding. I <a href=\"/archive/reading-report/\">read more books</a> now than I have at any point in my life and I write a lot as well (yes <a href=\"/archive/more-on-handwriting-amp-cursive/\">by hand</a>). In part this change hasn't been reflected much in this blog because I haven't wanted to write this very post explaining the shift. This is that attempt.</p>\n<p>I've spent a fair bit of time over these past four or five years now thinking about this experience I've had, and I've kept coming back to one particular method of describing what I mean when I say something has changed.</p>\n<p>In short, when I think about myself and what I call myself that definition has changed. I used to say I was a software developer who did a bunch of other stuff too. These days, I don't much <em>feel</em> like a developer. I still am of course, but I don't see myself through that lens anymore. My self-conception has changed.</p>\n<h2>The Future</h2>\n<p>This blog has always been a general-purpose place where I could write about anything that interests me, but it's always had a technical bent. That is very likely to change in the months and years to come. I have a lot of things on my mind (and a few new projects I'm working on) and while some of those are tech-related, most are not&mdash;as such the subject matter on this blog is going to reflect that shift.<sup>1</sup></p>\n<p>I hope everyone reading this will stick around and see what's coming. I'm very excited about the future and I'm excited to have a space here where I'll be more willing to write about the things I'm doing these days. It should be fun.</p>\n<p>🚀</p>\n<div class=\"footnote\">\n    <sup>1</sup>If you follow my Mastodon account, you've seen a preview of what's coming.\n</div>"}, {"id": "http://brianschrader.com/archive/podcasts-the-universe-and-everything/", "url": "http://brianschrader.com/archive/podcasts-the-universe-and-everything/", "title": "Podcasts, the Universe, and Everything", "date_published": "2024-04-27T19:01:00", "tags": ["podcasts", ""], "author": {"name": "Brian Schrader"}, "content_html": "<p>Recently, John Green announced a now-released podcast, <a href=\"https://crash-course-pods-the-universe.simplecast.com\">The Universe</a> hosted by himself and Dr. Katie Mack, which attempts to detail the entire history, present, and future of our universe as we currently understand it. While I haven't listened to the podcast beyond the trailer, I am confident it will be quite good. But that isn't really what I wanted to talk about here.</p>\n<p>Instead I wanted to talk about how the trailer for that podcast reminded me of my own journey with the topic of Astronomy and Astrophysics.</p>\n<p>As a teenager, I spent a fair bit of time in my school library doing one of three things:</p>\n<ol>\n<li>Playing games on the library computers on whatever sites were as-of-yet undiscovered (read unblocked) by the IT admin.<sup>1</sup></li>\n<li>Reading fantasy (see <a href=\"/archive/novels-and-insurmountable-tasks/\">Ursula Le Guin's Earthsea Series</a>).</li>\n<li>Trying to read whatever I could to answer what I thought was a pretty simple question.</li>\n</ol>\n<h2>What is Time?</h2>\n<p>Why I was trying to answer this question is lot to my memory, but if I recall correctly the Doctor Who episode Blink came out around that time with its famous \"<a href=\"https://www.youtube.com/watch?v=q2nNzNo_Xps\">wibbly wobbly</a>\" description of time. And Doctor Who was my jam at the time.</p>\n<p>Einstein famously quipped: \"time is what clocks measure\". Which is delightfully unhelpful to the philosophically inclined.</p>\n<p>To answer this question I read whatever I could find on the subject including Steven Hawking's <em>A Brief History of Time</em>, <em>The Universe in a Nutshell</em>, and others. Most of what I read went over my head as you'd expect for a teenager reading books on Theoretical Physics, but books like ABHoT lead me eventually to Astronomy. Perhaps if I was going to undertand Time, I needed to understand how it began.</p>\n<h2>Introduction to Stars, Galaxies, &amp; the Universe</h2>\n<p>I don't remember exactly how, but eventually I stumbled on the medium of Podcasts and specifically a podcast by Professor Richard Pogge at Ohio State University called <a href=\"https://www.astronomy.ohio-state.edu/pogge.1/Ast162/Audio/\">Astronomy 162</a>. The podcast is effectively just the lectures for that class which Pogge describes as astronomy for non-science majors. In other words, it's an overview without all the math. A perfect find!</p>\n<p>I listened to that podcast (and it's predecessor Astronomy 161) over and over again in order to extract the maximum amount of information from them. I can recall sitting in the backyard of my parent's house for hours devouring these episodes. In particular, the episode that fascinated me the most (and which is the subject of the first episode of <a href=\"https://crash-course-pods-the-universe.simplecast.com\">The Universe</a>) is titled, <em>The First Three Minutes</em>.</p>\n<p>I'd recommend that episode today for anyone who is curious about astronomy. The whole series of lectures is very approachable and understandable to anyone, and but <em>The First Three Minutes</em> is what truly gripped me. As many of my friends know, I <em>love</em> things like that.</p>\n<h2>An Aside</h2>\n<p>I remember discovering other podcasts by similarly forward-thinking professors and those podcasts both indulged my curiosity and augmented my own college education later on.</p>\n<p>The Internet serving to make more college-level content available to the general public has been one of the coolest things to see happen in recent decades. And it was through podcasting that I also discovered the excellent show <a href=\"https://writingexcuses.com\"><em>Writing Excuses</em></a> which taught me so much about the craft of writing and continues to be a show I go back to when I need help.</p>\n<h2>Bringing it Back</h2>\n<p>The release of <a href=\"https://crash-course-pods-the-universe.simplecast.com\">The Universe</a> by John Green and Dr. Katie Mack has put me in a bit of a reminiscent mood. I'm thrilled to see a new show attempt to capture the next generation of curious minds and I hope those who listen to it find what I did in Professor Pogge's podcast nearly two decades ago. That podcast was ultimately the reason I wanted to study Astrophysics in college&mdash;something I later abandoned to study Aerospace Engineering which turned out to be decidedly less interesting to me&mdash;and to this day I am still very interested in Astronomy and Physics.</p>\n<p>In a way, perhaps I can credit Doctor Who, Professor Pogge, Steven Hawking, and being a 6th period Library Assistant for the path I eventually took and for kindling the ongoing desire for learning that I keep to this today.</p>\n<p>I'm not sure, but it's been fun to think about. What I can be sure of is that podcasts are incredible.</p>\n<div class=\"footnote\">\n    <sup>1</sup> Including a really cool 3D, Halo-esq, capture the flag game that only seems more impressive the more I think about such a thing running in a web browser on a candy-shell iMac in 2007.\n</div>"}, {"id": "http://brianschrader.com/archive/users-tools-platforms-and-the-shifting-goals-of-software/", "url": "http://brianschrader.com/archive/users-tools-platforms-and-the-shifting-goals-of-software/", "title": "Users, Tools, Platforms, and the Shifting Goals of Software", "date_published": "2024-03-22T19:04:00", "tags": ["software", "technology"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I've been around long enough now to remember when we used different words to refer to our favorite apps and websites. Long before the words <q>Platform</q>, <q>Service</q>, or <q>Ecosystem</q> infected our discourse there were <q>Tools</q>. And I think we need fewer of the former and more of the latter.</p>\n<p>The word <q>User</q> is also partly a holdout of this now bygone age. A User is anyone (even a dog) that <q>uses</q> the website or app. By traditional parlance, a User is the person being served by the software. On an Ecosystem, Service, or Platform though the User is likely not the Customer, they're often the Product.</p>\n<p>A hammer is a tool and it is <em>used</em> for a purpose by a <em>user</em>&mdash;it's right there in the name. The user uses the tool to accomplish a goal in their lives and the tool exists to make the user's life easier in doing the thing they want to do. We used to think of software that way, but alas that mode of thought has long faded from popular conception. These days a User is more likely to be a person <em>used by</em> the software rather than someone who <em>uses</em> it to accomplish a goal. The software's goal is paramount, not the human's.</p>\n<p>No doubt many of us out there still believe the old adage I've recited as:</p>\n<blockquote>\n<p>A computer is a tool. I don't wait for a hammer, it waits for me. Hammers exist to make life easier not harder. Computers and software should be no different.</p>\n</blockquote>\n<p>These days it is more likely for software to feel like an entertainment product, a movie theatre. The User then isn't a person trying to accomplish a goal, but is a captive audience who paid for one experience but gets a bunch of extra content thrown at them for the privilege of getting what they paid for. Though, thinking about it more, perhaps the better comparison is that of an airport. A user's every movement is tracked and monitored both for security and sales, everything is overpriced and cheaply-made, yet at the end of the day you still  get where you need to go (assuming your bags make it and the plane has no loose bolts).</p>\n<p>Perhaps this transformation is part of the increased scope and scale of modern software or perhaps it has to do with the professionalization and financialization of the industry. Maybe it's something else. I don't know.</p>\n<p>Apps like <a href=\"https://netnewswire.com\">NetNewsWire</a> or <a href=\"https://mastodon.social/\">Mastodon</a> (just to name two examples) remind me of what we've lost. They're not trying to get me to adopt some platform. They're tools to help me get work done, like good software should.</p>"}, {"id": "http://brianschrader.com/archive/more-on-handwriting-amp-cursive/", "url": "http://brianschrader.com/archive/more-on-handwriting-amp-cursive/", "title": "More on Handwriting &amp; Cursive", "date_published": "2024-03-07T20:51:00", "tags": ["writing", "personal"], "author": {"name": "Brian Schrader"}, "content_html": "<p>My <a href=\"/archive/on-handwriting-and-switching-to-cursive/\">last post</a> seemed to garner a fair amount of interest and so I figured it would be good to cover some of the unspecified particulars that I left out of the previous post.</p>\n<h2>On Writing Cursive Left-Handed</h2>\n<p>I mentioned in the previous post that I write using a fountain pen (and occasionally with a dip pen). Given that, it may come as a surprise to some, but I am left handed. And while yes, writing with a dip pen does occasionally leave me with blackened palms from ink-smear, I've found this to be increasingly rare. It was certainly the case early on, but it's actually rare these days. Most modern inks dry incredibly quickly (so long as the right amount of ink lands on the page). That said I do end up with lots of ink on my fingers whenever I change the cartridges on my fountain pen.</p>\n<p>I've also found that the amount of ink that smears on my hand <em>went down</em> now that I write in cursive. That may seem strange as cursive uses a lot more ink than print, but I think it has to do with the extreme bias I tend to write with. As I'm left-handed, I also tilt the page the <q>wrong</q> way. This helps with ink smear because I'm almost always writing on already dry text.</p>\n<div class=\"image-center\">\n    <figure title=\"This figure depicts a piece of legal paper tilted 32 degrees. It may not render correctly outside of a browser because it's just a hacky HTML div.\">\n        <div style=\"\n            margin-right: auto;\n            margin-left: auto;\n            padding-top: 0.4rem;\n            width: 8.5rem;\n            height: 11rem;\n            transform: rotate(-32deg);\n            background-color: antiquewhite;\n            border-top: solid #444 0.4rem;\n        \">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n        </div>\n    </figure>\n    <figcaption class=\"text-center\">\n        <small>I tend to write on a 30-35° bias (32° is depicted here).</small>\n    </figcaption>\n</div>\n\n<p>I was taught to write in the <a href=\"https://en.wikipedia.org/wiki/Zaner-Bloser_(teaching_script)\">Zaner-Bloser</a> cursive style as a kid and that's what I picked up again last year. As with all forms of handwriting, I've simplified my take on the style to be what I now consider to be a mix of Zaner-Bloser and the New American style which incorporate several print letters for capitals (ridding me of the annoying Zaner-Bloser F, G, H, and its uninspired A). None of these tweaks were born of me trying to adopt a formal style, instead each came from me tweaking my own style which happened to converge and resemble those above.</p>\n<p>As part of this quest of mine, I spent a fair amount of time researching the history of cursive and its various styles. I learned a lot about how different  techniques evolved and how the style I most recognize as \"fancy, old-style cursive\" (i.e. the <a href=\"https://en.wikipedia.org/wiki/Palmer_Method#/media/File:Palmer_Method_sample.jpg\">Palmer Method</a>) lost the battle mid-century to the style that I was taught as a kid. I still think the Palmer Method is cooler looking, but I have no interest in breaking my brain again to learn it.</p>\n<h2>On the Gear</h2>\n<p><img alt=\"Pen and paper on my desk\" src=\"/images/blog/pen-paper.jpg\" /></p>\n<div class=\"text-center\"><small>\n    My daily driver.\n</small></div>\n\n<p>As this is partly a techie blog, I'd be remis if I didn't talk about the gear I use, though it's not particularly exciting.</p>\n<p>I use a wide variety of notebooks (<a href=\"https://www.amazon.com/gp/product/B07YLTJHH4/\">some</a>. <a href=\"https://www.amazon.com/gp/product/B0BLC876QN/\">are</a>. <a href=\"https://www.amazon.com/gp/product/B0027Z14AG/\">linked</a>. <a href=\"https://www.amazon.com/gp/product/B07PLR8DJZ/\">here</a>), though most of the time I just write on <a href=\"https://www.amazon.com/gp/product/B004YK4VHA/\">cheap legal pads</a>.</p>\n<p>As for the pens I use, my daily driver is a <a href=\"https://www.amazon.com/Schneider-Fountain-Medium-Barrel-160201/dp/B001B2IFLM?th=1\">Schneider Base Uni</a>. I have two of them (one stocked with black ink and the other with blue which I rarely use).</p>\n<p>For my dip pen, I really like <a href=\"https://www.amazon.com/gp/product/B004YK4VHA/\">this ink</a>. It's nothing special but it's cheap and works well.</p>\n<h2>Now What?</h2>\n<p>I continue to write a fair amount each day, and like I mentioned in my other post, that's largely because I find it fun to do. I've ended up performing a sort of near-nightly ritual where I write about something, anything just to feel the pen in my hand and hear the scratch of nib on paper. Sometimes it's (bad) poetry other times it's just stream-of-conscious rambling. Most of what comes out is uninspired or repetitive, but some aren't! Some are (dare I say it) even good!</p>\n<p>Writing for me has become a new hobby, something I do to unwind and de-stress. That's not something I expected, but it is what happened.</p>"}, {"id": "http://brianschrader.com/archive/on-handwriting-and-switching-to-cursive/", "url": "http://brianschrader.com/archive/on-handwriting-and-switching-to-cursive/", "title": "On Handwriting and Switching to Cursive", "date_published": "2024-02-25T07:25:00", "tags": ["writing", "personal"], "author": {"name": "Brian Schrader"}, "content_html": "<blockquote>\n<p>I'm a software developer; I make my living on a computer. In this age there just isn't much reason for me to bother improving my handwriting.</p>\n</blockquote>\n<p>I've thought that for years. While like most people my age, I learned to write in cursive in school (and to write in general) I'd essentially stopped using such an all-important skill in my daily life, save for the odd sticky-note here and reminder scribble there.</p>\n<h2>How It Began</h2>\n<p><img alt=\"Examples of my typical print writing\" src=\"/images/blog/writing-example-print.png\" /></p>\n<p>I never wrote by hand. Why would I? You can't <code>⌘+f</code> handwritten text, you can't change-control it, you can't even back it up easily. Why would you bother writing anything significant by hand at all?</p>\n<p>An old programming teacher of mine once quipped:</p>\n<blockquote>\n<p>People say that stuff on a computer isn't real, it's just digital. You can't touch it or save it. If the computer dies, it's gone. But I say they've got it backwards. Files on a computer are so much more real. I can prevent them from getting old, I can back them up for free, and I can send them to you without losing my original. On a computer, it's <strong>more</strong> real than it is on paper.</p>\n</blockquote>\n<p>While I'm not sure I ever truly agreed with his point there, I did take that advice to heart for most of the past 12 years. In college, most of my work was digital already, and once school ended, I stopped writing by hand for all but a few rare tasks. I've always been a fan of writing <em>in principle</em> and many years ago I got a few fountain pens as a gift. Mostly they sat in a drawer, but occasionally I'd take them out and pine over how cool they were, then go about my day. I do keep a journal by hand, but writing in it has been an oft-forgot afterthought for most of my adult life.</p>\n<p>Until last year.</p>\n<h2>How it Went</h2>\n<p><img alt=\"Examples of my slightly enhanced print writing\" src=\"/images/blog/writing-examples-better-print.png\" /></p>\n<p>I've been working on a bit of a project now for over two years and part of that project has been writing a ton of notes for myself. I used to keep them in Notes.app on my Mac (since it syncs with all my devices), but after a while I got sort of disillusioned on doing that. As mentioned above, I <em>live</em> on my computer and it was starting to really get to me just how much time I spend at my desk, staring at a screen. So I took out a fresh notebook I'd been given years ago, and I started to take notes there instead.</p>\n<p>I was hooked.</p>\n<p>Within a few short weeks I had dozens of pages of notes, sketches, and musings in this little book (that was poorly made and now falling apart), so I dusted off the old fountain pens, bought some <a href=\"https://www.amazon.com/gp/product/B07YLTJHH4/\">better notebooks on Amazon</a>, and kept at it. I'd been taken in by writing. Writing by hand had so many downsides, but there were incredible upsides too. I no longer got distracted by notifications while writing. I loved flipping through my notes to review them. I rarely lost track of notes because I <em>knew where they were</em> in relation to other notes because human brains know where stuff is in space (mind-blowing, I know). I even got to talking to some friends about this new hobby of mine.</p>\n<p>And that's when I went into overdrive. You see, a friend of mine gifted me a dip pen as a birthday present and I was supercharged.</p>\n<p>One thing I've learned, that I find difficult to describe, is just how expressive it feels to write with pen on paper, even when you have nothing to write about. I was genuinely taken in by the sound of scritches of metal on paper. Over that first half of the year I wrote, by hand, over <em>one hundred pages</em> of text! That's likely more than I'd written in the past decade (and likely even further back) combined!</p>\n<p>One thing still bothered me though: my terrible handwriting.</p>\n<p>It's always been bad. It was bad when I was 5, 12, 20, and it's still bad. I knew it, everyone knew it. I never bothered to improve it either because:</p>\n<ol>\n<li>I knew how to read it (most of the time).</li>\n<li>Writing is something I rarely did, so why get better?</li>\n<li>I'm lazy.</li>\n</ol>\n<p>However, writing poorly didn't just mean my scribbles were sometimes difficult for me to read (and impossible for others to do so), it also meant something more important: my hand hurt when I wrote. My grip was too tight and my hand was unpracticed and sloppy. That meant I couldn't write for very long, even when I wanted to. What's more I've always romanticized writing (see the fountain pens above). I <em>wanted</em> to write better, but I didn't want it enough and I never really needed to. Now though, I was writing constantly and my bad penmanship was getting in my way.</p>\n<p>It was time. I needed to revisit cursive.</p>\n<h2>How It's Going</h2>\n<p><img alt=\"Examples of my cursive writing\" src=\"/images/blog/writing-examples-cursive.png\" /></p>\n<p>I hadn't written in cursive since second grade. I stopped doing it the moment it was no longer required and I never looked back &mdash; until last October.</p>\n<p>I can confidently say that I've written more cursive in the past four months than I have in my whole life before, combined. Easily. Over two hundred pages.</p>\n<p>And it's great.</p>\n<p>I'm by no means <em>good</em> at it, but I'm improving. I started with just trying to remember the letters. I have to imagine this is how learning to type on a DVORAK keyboard feels: your brain just breaks for a while. I even used those <a href=\"https://www.worksheetworks.com/english/writing/handwriting/cursive-practice.html\">cursive worksheets</a> they give to kids (with <a href=\"https://tolkiengateway.net/wiki/Song_of_Parting#In_The_Silmarillion\">custom text</a> of course).</p>\n<p>After that I graduated to journaling in cursive and later writing in general in cursive. After four months, I can say that almost everything I write these days is in cursive <em>by default</em>. In fact I really only print when I need to scribble down a quick sticky-note or reminder (exactly as I did before all this).</p>\n<p>My handwriting is by no means good, but I think my cursive is better than my print (especially if you take into account how long I've been practicing the latter vs. the former).</p>\n<p>I've fallen in love with writing by hand. It's something I've always wanted to do well, but it took until now for me to set aside the time and effort to do it. I only regret waiting this long.</p>"}, {"id": "http://brianschrader.com/archive/my-favorite-books-from-2023/", "url": "http://brianschrader.com/archive/my-favorite-books-from-2023/", "title": "My Favorite Books from 2023", "date_published": "2024-01-14T22:14:00", "tags": ["books", "book", "book recommendations", "book review"], "author": {"name": "Brian Schrader"}, "content_html": "<p>In what seems to be a new annual tradition, I'd like to discuss my favorite books from 2023. While I didn't achieve the same level of reading as 2022, last year was still one of the most productive reading years I've ever had&mdash;18 in total! You can see the totals of the books on my <a href=\"/archive/reading-report/\">reading progress</a> page, which at time of writing will look off since it doesn't count audiobooks in the counts (something I need to fix).</p>\n<p>As a side note, I am curious if I can somehow automate the posting of recommended/recent books on that page. An interesting idea 🤔</p>\n<p>In no particular order here are the books I recommend from last year:</p>\n<h3>The Book of Hidden Things, Francesco Dimitri</h3>\n<p>Francesco is quickly becoming my favorite author. I read <em>Never the Wind</em> last year and fell in love with his writing, and <a href=\"https://bookshop.org/p/books/the-book-of-hidden-things-francesco-dimitri/9925689?ean=9781785657078\"><em>The Book of Hidden Things</em></a> is more of the same excellent storytelling. Seriously, check him out.</p>\n<p>Also he has a <a href=\"https://www.amazon.com/Dark-Side-Sky-Francesco-Dimitri-ebook/dp/B0CF11RY1H\">new book</a> coming out this year, which I have already pre-ordered.</p>\n<h3>The Ocean at the End of the Lane, Neil Gaiman</h3>\n<p><a href=\"https://books.google.com/books?id=erG2zQEACAAJ&amp;hl=&amp;source=gbs_api\">This one</a> was a really fun read. Neil Gaiman is a master and it shows. Really enjoyed this one, but I don't have much to say about it. A lovely story.</p>\n<h3>The Internet Newspaper, Adam Gnade</h3>\n<p>The <a href=\"https://books.google.com/books?id=T80tzwEACAAJ&amp;hl=&amp;source=gbs_api\">cover hooked me</a> immediately when I picked this one up on a whim from a local bookstore. The story takes place in San Diego (the author's and my hometown). If you like San Diego, 90's/00's music, and early 20-somethings mischief you'll like this. Also I love the size of this thing. Pocket novels are a lost medium.</p>\n<h3>The Secrets of Alchemy, Lawrence Principe</h3>\n<p>The book is an overview of the history of the practices of alchemy (mostly attempts to create a philosopher's stone and turn lead to gold), though it touches on the other uses for alchemy including metallurgy, medicine, and pre-modern chemistry. However the book really hits it out of the park when Principe does the homework and attempts to replicate several of the ancient alchemical recipes! Instantly I was hooked.</p>\n<p>I read a lot of ancient history and one things I always try to keep in mind is that while ancient worldviews are very different from our own, and scientific thinking as we know it today didn't exist yet, that doesn't mean that people weren't experimenting, verifying, and sharing their ideas. For years people dismissed old alchemical recipes because we know their goal (chemically turn lead to gold) to be impossible, but that doesn't mean their experiments were useless, as Principe discovers. Some were very nuanced and precise. 10/10, fascinating read. Highly recommended.</p>\n<p>It's available to <a href=\"https://archive.org/details/secretsofalchemy0000prin\">rent for free</a> on the Internet Archive, so please check it out.</p>\n<h3>Beren and Luthien, J.R.R. Tolkein</h3>\n<p>I read a lot of Tolkien this year and <a href=\"https://www.audible.com/pd/Beren-and-Luthien-Audiobook/0008214239\">this one</a> was my favorite. It's a little happier than the excellent <em>Children of Hurin</em> and features some of my favorite scenes from <em>The Silmarillion</em>. Basically if you enjoyed that chapter with the same name in <em>The Silmarillion</em>, you'll love this.</p>\n<p>My favorite part: the song battle between a demi-god and an elf lord. 10/10. No notes.</p>"}]}