{"home_page_url": "https://brianschrader.com", "version": "https://jsonfeed.org/version/1", "description": "Thoughts, and ramblings about technology, programming, history, and whatever else I'm interested in.", "feed_url": "https://brianschrader.com/feed.json", "title": "BiteofanApple by Brian Schrader", "items": [{"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/remembering-things-is-hard/", "tags": ["code", "software", "preflight", "git"], "content_html": "<p>I'm not very good at remembering things, even simple things, and I'm even worse at grinding (doing a simple or repetitive task more than once). That's one reason why I love being a developer: often times, I can script simple, repetitive, and common tasks.</p>\n<p>When it comes to development, although most of my projects leverage some form of automated continuous testing and linting, by the time I've pushed up my code and the tests have run, I've moved on to some other task. This means that when my code has a failing test or a linting error, I have to stop the new thing that I'm doing, stash my changes, and fix the error. I <em>should</em> remember to run the tests before I push my code, but I never do.</p>\n<p>So in lieu of doing the hard work to remember to run the tests and becoming a better person in the process, I've written a <code>pre-commit</code> script that runs before I commit my code. That way I can't commit my code without fixing the error, or explicitly ignoring it (with the <code>-n</code> flag).*</p>\n<div class=\"footnote\">\n* This also helps avoid the unprofessional looking \"Fixes linting\" commits.\n</div>\n\n<hr />\n<p>Here's my <code>.git/hooks/pre-commit</code> file for any Django project. Give it a shot yourself and let me know if it helps you write better code.</p>\n<pre><code class=\"bash\">#! /bin/bash\nset -e;\nlog() { echo \"[$(date)] $1\"; }\n\ncat << EOF\n-----------------------------------\nRunning the tests...\nYou might want to get a coffee. ☕️\n-----------------------------------\nlog \"Linting the code...\"\nflake8\nlog \"Running the tests...\"\n./manage.py test\nlog \"Done.\"\n</code></pre>\n\n<p><link rel=\"stylesheet\" href=\"http://yandex.st/highlightjs/8.0/styles/default.min.css\">\n<script src=\"http://yandex.st/highlightjs/8.0/highlight.min.js\"></script>\n<script>hljs.initHighlightingOnLoad();</script></p>", "date_published": "2019-11-03T18:59:00-08:00", "title": "Remembering Things is Hard", "id": "http://brianschrader.com/archive/remembering-things-is-hard/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/finally/", "tags": ["pine.blog", "open web", "rss"], "content_html": "<p>Today marks the release of <a href=\"https://blog.pine.blog/2019/10/fall-2019-update-hosted-blogs/\">Pine.blog's Fall Update</a>. It's a release I've been working on for months now and it feels great to finally get it out into the world. With this release, Pine.blog is now what I'd wanted it to be when I started <a href=\"/archive/a-vision-of-the-open-web/\">dreaming of what a the open web could do</a>. On Pine.blog, you can follow your interests, keep up with the latest news, and join the conversation by starting a blog. I can finally say that the core features I want are in place.</p>\n<p>Obviously my goals for Pine.blog have expanded since I originally thought of the idea in 2014 (and began writing it in 2016), so there's still <strong>a lot to do</strong>.</p>", "date_published": "2019-10-08T01:34:00-08:00", "title": "Finally", "id": "http://brianschrader.com/archive/finally/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-new-adventure/", "tags": ["photography", "hobbies", "money sink", ""], "content_html": "<p>Last week, I bought a camera. I've wanted one for a while, but I'd never really looked around for something that would fit my needs. A few of my <a href=\"https://www.instagram.com/photorayg/\">friends</a> and <a href=\"http://www.museofadventure.com\">family</a> are actual photographers, and I knew that I didn't want to do what they do. I'd be carelessly jumping into a deep end to swim with reel big fish.</p>\n<p>I haven't owned a dedicated camera in over a decade. Ever since 2010, the only camera I've owned came with an iPhone attached to it. However, while the iPhone X's camera is great, it's just not enough for a whole myriad of situations, and in the last year I've found myself ever more limited by what my phone's camera could and couldn't do.</p>\n<p>There's an old adage: \"the best camera is the one you have with you\", and if I was going to have this camera with me, even a fraction of the time that I have my phone with me, it had to meet some pretty strict qualifications: It had to be really versatile (inter-changeable lenses was a hard requirement), it had to be compact enough to take almost anywhere, and it had to be a camera that could grow with me as I delve into this new-fangled world. So I talked to some people, read a bunch of articles, watched a bunch of reviews, and got this:</p>\n<div style=\"text-align:center;\">\n    <img\n        alt=\"My new camera\"\n        src=\"/images/collections/a6000/camera-web.jpg\"\n        style=\"width:300px;margin-left:auto;margin-right:auto;\"\n    />\n    <caption>\n        <a href=\"https://www.amazon.com/Sony-Mirrorless-Digitial-3-0-Inch-16-50mm/dp/B00I8BICB2/ref=sr_1_7?keywords=sony+a6000&qid=1566087531&s=gateway&sr=8-7\" title=\"The Sony α6000\">\n            The Sony α6000\n        </a>\n    </caption>\n</div>\n\n<p>I've heard from quite a few people that Sony's α6000 and α6400 are really good for people who want a great camera, but aren't willing to dive into DSLRs. I don't know much about that second bit, but that description matched me to a T. As I've only had it a week so far, my opinions are still riddled with <a href=\"https://www.urbandictionary.com/define.php?term=Ney%20Toy%20Syndrome\">Ney Toy Syndrome</a>. That said, I really like this camera. It's small and light enough to fit in the spare pocket of my daily carry bag, and it uses Sony's E-Mount which means that there's tons of compatible lenses, making it really versatile.</p>\n<p>I ended up getting the α6000 mostly because of the price. The α6400 was more than I wanted to spend and anything below the α6000 didn't have a viewfinder, which was a dealbreaker. I'm still rocking the kit lens for now, but I plan on getting a 50/55mm Prime lens pretty soon. Before that though, I need to get a much more intuitive grasp of how to properly use what I have, and it'll probably take me a while to get the basics down.</p>\n<h3>A Checkpoint in Time</h3>\n<p>While I'll probably be posting most of the good shots I take to my <a href=\"https://photos.brianschrader.com/\">photoblog</a>, below are a few of my favorite shots from the last week. I'm posting them here so that they serve as a record of my skills as a photographer right now. Hopefully, as time goes on and my skills improve, I'll look back on these pictures like I look back on old code I've written: with fond memories, and mild disgust.</p>\n<div style=\"text-align:center;\">\n    <a href=\"/images/collections/a6000/moonlight.jpg\" title=\"Moonlight - Full Image\">\n        <img\n            alt=\"Moonlight\"\n            src=\"/images/collections/a6000/moonlight-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/bark.jpg\" title=\"Bark - Full Image\">\n        <img\n            alt=\"Bark\"\n            src=\"/images/collections/a6000/bark-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/private.JPG\" title=\"Private - Full Image\">\n        <img\n            alt=\"Private\"\n            src=\"/images/collections/a6000/private-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/tank.JPG\" title=\"Tank - Full Image\">\n        <img\n            alt=\"Tank\"\n            src=\"/images/collections/a6000/tank-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n</div>", "date_published": "2019-08-18T01:25:00-08:00", "title": "A New Adventure", "id": "http://brianschrader.com/archive/a-new-adventure/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/dont-ban-infinite-scrolling-license-engineers-instead/", "tags": ["software engineering", "ethics", "legal", ""], "content_html": "<p>Yesterday, the <a href=\"https://www.theverge.com/2019/7/30/20746878/josh-hawley-dark-patterns-platform-design-autoplay-youtube-videos-scrolling-snapstreaks-illegal\">Verge reported that Sen. Josh Hawley sponsored</a> a bill that aims to reduce the tech industry’s use of \"addictive design\" practices by putting a ban on features like infinite scrolling and autoplaying video. While I applaud Congress for focusing on this important issue, the proposed solution is both naive and unproductive. When a surgeon is accused of malpractice, the appropriate solution is not to ban their use of the scalpel, it's to revoke their license.</p>\n<p>I have long argued that Software Engineers (especially those at large companies that affect the lives of millions of people) <a href=\"/archive/software-engineering/\">should be licensed</a>. Requiring a license to practice Software Engineering would finally place software in the realm of the other classical engineering fields and require practitioners to use their skills ethically and for the benefit of society. It would also help educate engineers on the risks and trade-offs with the decisions they make and give the government a lever to pull when trying to encourage ethical practices across the industry. Likewise, licensed engineers are able to refuse to implement unethical or unsafe designs when they fear that they could lose their license.</p>\n<p>One common argument against this point is that the tech industry is filled with lots of independent developers and others who operate relatively small businesses and that licensing them would put an damper on overall innovation in the industry. However, while we do often require Civil Engineers to have a license, we don't apply the same logic to carpenters, and we can apply the same kinds of criteria to Software Enginering licensure.</p>\n<p>We've required licenses for those practicing classical Engineering, Medicine, and Law for a long time<sup>1</sup>, and those licenses have helped governments and the licensed individuals themselves steer industry practice away from things that can be considered unethical or unsafe. Instead of trying to take powerful tools away from Engineers, we should instead be focused on enabling and educating them to make ethical and societally beneficial decisions. The Internet is part of the infrastructure of our modern world, so let's ensure that the people who build and maintain it have society's best interests at heart.</p>\n<div class=\"footnote\">\n<sup>1</sup> As an aside, we even license hairdressers and locksmiths. If unlocking cars or cutting hair requires a license, why doesn't building software that impacts 20% of the world's population?\n</div>", "date_published": "2019-07-31T17:46:00-08:00", "title": "Don't Ban Infinite Scrolling, License Engineers Instead", "id": "http://brianschrader.com/archive/dont-ban-infinite-scrolling-license-engineers-instead/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-social-web/", "tags": ["open web", "social media", "pine.blog"], "content_html": "<p>Things have been quiet here recently, and that's largely because I've been really busy working on lots of cool new stuff for <a href=\"https://pine.blog/\">Pine.blog</a>. While the last few months have been full of steady progress, there's still a ways to go before the next set of features are ready for the world. If everything goes according to plan, the next major release should allow premium users to start their own blog on the site.</p>\n<p>So far, Pine.blog has been mostly focused on being a good feed reader, and while I think it is, there's so much more that can be done with feeds and blogs than just read them.</p>\n<h3>Feed Readers are the First Step</h3>\n<p>I've wanted Pine.blog to support custom blogs since the beginning, and that's largely because I think that by making it easier to both read and write on the open web, we can give people a viable alternative to more traditional social networks and offer them an escape from the problems those platforms have.</p>\n<p>Using tools and technologies that have existed for years, the web itself can be a social network, but in order for people to embrace that idea there have to be easy-to-use tools that are new and powerful, but also familiar and approchable, and importantly, there also have to be people to talk to; the web has to <em>feel</em> like a social network.</p>\n<h3>Pushing Forward</h3>\n<p>One of the things I've come to strongly believe is that as developers (or as anyone who makes a thing) we can work to push the world toward we think it should be, and I think that the Web can and should be our shared social network.</p>\n<p>This is why I'm so excited by what I see as the future for Pine.blog. If we want people to move off of the platforms we think are the cause of so many problems in our world, we need to give those people a place to go. Most people aren't going to start a blog and use a feed reader unless we, as the people with the skills to do so, make the Social Web better than Social Media.</p>", "date_published": "2019-07-28T06:35:00-08:00", "title": "The Social Web", "id": "http://brianschrader.com/archive/the-social-web/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/updates-on-using-nsoperation/", "tags": ["development", "nsoperation"], "content_html": "<p>Last time <a href=\"/archive/i-love-nsoperation/\">I talked about NSOperation</a>, I mentioned that I really liked using it to do things like networking and asynchronous operations in my app. Well, I've made a few tweaks to my <code>BackgroundNetworkingController</code> recently (alas a new name was not among them) and I think the new version is even more readable and expressive.</p>\n<p>For those who don't know, NSOperation (or just Operation in Swift) is a class that when paired with (NS)OperationQueue allow you to order and track long running and often asynchronous tasks in your apps. You can use it to do API calls, animate transitions, walk a user through a process, and a lot more.</p>\n<p>In my last blog post I demoed this piece of code as an example of how I use Operations in the Pine.blog app.</p>\n<p><code class=\"swift\"><pre>\nfunc updateTimeline() {\n    let reauthorize = TokenReauthorizationOperation()\n    let fetchTimeline = FetchTimelineOperation()\n    fetchTimeline.delegate = self\n    fetchTimeline.addOperation(reauthorization)\n    BackgroundQueueController.queue?.addOperations(\n        [reauthorize, fetchTimeline],\n        waitUntilFinished: false\n    )\n}\n</pre></code></p>\n<p>And while that example is pretty straight forward, I knew it could be better. There's so many times when I just need to tell my app: do these things in the background, in this order, and tell me when you're done (and let me know if something comes up). Operations allow me to do that, but setting up delegates and adding dependencies seems like cruft that I don't really want to care about.</p>\n<p>With that in mind, I added a new set of methods to my queue controller: <code>performInSeries(operations:)</code> and <code>performInSeries(operations: with:)</code>. Using those instead, the above example becomes:</p>\n<p><code class=\"swift\"><pre>\nBackgroundNetworkingController.performInSeries(\n    operations: [\n        TokenReauthorizationOperation(),\n        FetchTimelineOperation(),\n    ],\n    with: self\n)\n</pre></code></p>\n<p>This code sets up the given operation with each previous operation as a dependency and assigns their delegate to <code>self</code>. Reading this it becomes pretty clear that I want these operations to be performed in the order I specify and I want them to alert me if anything comes up, which is exactly what I want.</p>\n<p>Even the most complex uses in all of the Pine.blog app still retain their readability (aside from array concatenation). This example reauthorizes the user's token, then fetches the most recent posts in  each of the user's timelines, finds any new posts that the user has liked, and finally calls the given completionHandler to let the app know that it has completed updating its data.</p>\n<p><code class=\"swift\"><pre>\nBackgroundNetworkingController.performInSeries(\n    operations:\n        [ ReauthorizationTask() ]\n        + timelines.map { FetchNewestPostsInTimeline(timeline: $0) }\n        + [ FetchLikesOperation(), BlockOperation { completionHandler?(self.fetchResult) }],\n    with: self\n)\n</pre></code></p>\n<p>There's still a bit further I can go with this, but I'm really happy with the readability and clarity improvement that these changes have made to my codebase.</p>\n<p><link rel=\"stylesheet\"\n      href=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/styles/default.min.css\">\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/highlight.min.js\"></script><script>hljs.initHighlightingOnLoad();</script></p>", "date_published": "2019-06-29T19:31:00-08:00", "title": "Updates on using NSOperation", "id": "http://brianschrader.com/archive/updates-on-using-nsoperation/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/lots-of-little-things/", "tags": ["pine.blog", "update"], "content_html": "<p>Recently I've been focused on finishing the next set of major features for <a href=\"https://pine.blog/\">Pine.blog</a>, but as happens from time-to-time I got a bit distracted and ended up knocking out a whole lot of little features that I've wanted to build for a long time. Today's update was entirely server-side, and I'll have a new update for the iOS app coming in a few days.</p>\n<h3>Wordpress Enhancements</h3>\n<p>In addition to making a lot of things just plain faster, I've also added a new <a href=\"https://pine.blog/kb/add_external_blog\">feature for Wordpress users</a> so that when users post on their blog, Wordpress will automatically let Pine.blog know and their posts show up much more quickly in their (and other user's) timelines.</p>\n<p>For me, this feature involved yet another foray into undocumented XML-RPC APIs from over a decade ago. So much of the information just isn't easy to find anymore so building features that use them is more archeology than software development.</p>\n<h3>API Keys and Webhooks</h3>\n<p>Users that want to write scripts using Pine.blog (or build custom applications) can now get an API key quickly and easily that lets you access the full range of Pine.blog APIs.</p>\n<p>For those who want to dive even deeper into their data with Pine.blog, users can now add a Webhook URL if they'd like to receive updates from Pine.blog whenever a feed they're subscribed to changes.</p>\n<h3>API Documentation Revamp</h3>\n<p>I've completely redone the Pine.blog API documentation. Hopefully this makes it much easier for developers to discover and use the Pine.blog/Feed Directory API. The new documentation includes much more detailed information about the throttling limits, what to expect from each endpoint, and much much more. If you're looking to use the Pine.blog/Feed Directory API in your app or service <a href=\"https://pine.blog/api/documentation\">you can find out more from the documentation here</a>.</p>\n<p>A lot of these developer-focused features are test runs for much broader features that I have cooking in the background. Meanwhile I'm trying to keep the majority of what I do with Pine.blog a lot more user-focused.</p>", "date_published": "2019-06-29T04:02:00-08:00", "title": "Lots of Little Things", "id": "http://brianschrader.com/archive/lots-of-little-things/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/changing-tides/", "tags": ["software", "pine.blog", "payments"], "content_html": "<p>It's a big day: <strong><a href=\"https://pine.blog/?r=bs\">Pine.blog</a> is now free to use!</strong></p>\n<p>Pine.blog has been out for over a year now and it's been getting better and better over that time. However, although quite a few people have signed up, most have stopped short of signing up for a premium subscription. At first I thought that adding a free trial to Pine.blog would help, but that doesn't seem to do much to encourage signups.</p>\n<p>I want <a href=\"https://pine.blog/?r=bs\">Pine.blog</a> to be useful to as many people as possible because I think Pine.blog and a lot of other Open Web tools (i.e. Micro.blog, Mastodon, etc) represent what social networking <em>should be</em>. In order to reach a wide audience, Pine.blog needs to let people know what it is and then convince them to use it. I've made pretty good progress on that first goal: Pine.blog's traffic numbers keep going up and responses are generally positive, it's just that those numbers don't really translate into subscriptions.</p>\n<p>In that light, <a href=\"https://pine.blog/?r=bs\">Pine.blog</a> no longer requires a subscription to use: just create a free account and you're good to go! If you want to organize your feeds into multiple timelines or start a blog<sup>*</sup> you'll still need a premium subscription, and don't worry, you still get a free trial.</p>\n<hr />\n<p>At time of writing, the newest version of the iOS app is \"Waiting for App Review\", so you'll have to sign up on the website to start a free account, but you can use the app once you've created your account.</p>\n<div class=\"footnote\">\n<sup>*</sup>Coming soon!\n</div>", "date_published": "2019-06-09T02:43:00-08:00", "title": "Changing Tides", "id": "http://brianschrader.com/archive/changing-tides/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-hidden-cost-of-cheap-hardware/", "tags": ["software development", "programming", "complexity", "engineering"], "content_html": "<p>Most times, when developers debate code-level optimizations, someone will eventually bring up the classic platitude:</p>\n<blockquote>\n<p>Developer-time is more expensive than Compute-time.</p>\n</blockquote>\n<p>And it's true: paying a developer to optimize code is generally more expensive than adding additional hardware to run the existing, slow code faster. Servers and storage are so cheap these days that most developers don't need to know or care about the actual hardware that runs the code they write. Hardware is fast, cheap, and available in huge surplus, but this overabundance of cheap computing power has caused this throw-more-hardware-at-it mindset to proliferate into other aspects of development, namely how systems are designed.</p>\n<h2>Let's face it, modern web stacks are complex</h2>\n<p>A typical web stack contains a lot of co-dependent software, and Developers, Admins, and DevOps will each have their own tools to improve, manage, and add some semblance of comprehensibility to a running system. But, each additional proxy, app instance, and physical or virtual server adds multiple possible points of failure to your production system and lots of additional complexity to development.</p>\n<p>Over time, developers add more and more layers of software and tooling to their project until the hardware can't handle it anymore, and then instead of reevaluating their tools, they make the fateful decision to break the system out into smaller, isolated pieces, turning their simple website into a complex distributed system, because after all, adding hardware is cheaper, right?</p>\n<blockquote>\n<p>\"Complexity is a bug-lamp for smart people. We're just drawn to it.\"</p>\n<p>Maciej Cegłowski, <a href=\"https://idlewords.com/talks/website_obesity.htm#top\">The Website Obesity Crisis (2015)</a></p>\n</blockquote>\n<p>The hardware is cheap, yes, but the developer-time needed to design a system who's pieces communicate over dozens of network connections and physical or virtual machines often far, far exceeds the costs of keeping things simpler from the get-go. Most small and medium systems can exist on very little hardware, and that, in turn, keeps the project design much simpler than spreading less efficient work over dozens of machines.</p>\n<p>None of this is to say that an unoptimized codebase is the same as a large or possibly over-engineered system, but there are parallels between them. Both are made possible because of the fact that we have cheap and abundant access to powerful hardware that can run inefficient code and all of the layers of abstraction that slow down and sometimes overcomplicate modern software. It might be then that developers working in these large systems, as with some developers working on inefficient code, might not realize just how powerful their hardware really is.</p>\n<h2>Empathy for the machine</h2>\n<p>Today's hardware is fast, really fast, and we can use that power to our advantage, but only if we, as developers, have an intuitive sense of just how fast it is.</p>\n<p>In a totally related, I promise, anecdote: An old coworker of mine was complaining one day that a Perl script he'd written took too long to run, and he didn't know why. I asked him how long it took, and he said, \"About 2 seconds, but it should be instant.\" At first I thought it was silly that he was spending so much time optimizing for 2 seconds, but what I didn't know was that this script was only processing a few hundred kilobytes of testing data. Eventually, it would need to process a few hundred gigabytes. We had a High Performance Computing Cluster he could run his analysis on, but he didn't want to use it because, as he put it, \"This analysis isn't complicated, it should be able to run on my machine\". He didn't want to move his work to the cluster because he'd have to add a lot of code to ensure it would run correctly in a distributed environment that was harder to debug. After he fixed the issue, processing the test data took an imperceptible amount of time, and he was able to run the entire analysis on his 6-core workstation in a little under an hour.</p>\n<p>Without that kind of intuitive understanding of how much time a task \"should take\" it's extremely difficult to know when, or if, something is wrong. You might just assume that your analysis really does take 2 seconds, or that your webapp really does take 3 seconds to send a simple response, and that you need to use more powerful hardware to get it done. What's worse is that developing that intuition is harder and harder the further you are from the actual hardware. With layers of virtualization and tooling between developers and their hardware, it's difficult to perform controlled experiments, or do any sort of real comparisons between revisions. Your gut instinct is your only gauge.</p>\n<h2>We need some sort of an anchor</h2>\n<div class=\"image-container\">\n    <img\n        class=\"image-right\"\n        src=\"/images/blog/some-sort-of-a-rock.jpg\"\n        style=\"width:300px;\"\n    /><br />\n    <caption><center><small>\n    Defining Deviancy Down\n    </small></center></caption>\n</div>\n\n<p>Armed with cheap hardware and the conventional wisdom that adding more servers is cheaper and easier than optimizing what we already have, we've arguably made our systems slower, more complicated, and over-engineered for the problems they claim to solve. It's time we all take a look at the systems we build, and ask ourselves if they need to be as complex as we're making them. We, as a community tend to want to copy what the big companies do, but those enormous companies have different needs than the rest of us. Facebook, Netflix, and Google have different problems than the vast majority of sites. We don't need to use their tooling, apply their designs, or live with their compromises, but we often do exactly that.</p>\n<p>What we need is some sort of test, one we can apply to our systems to anchor our thinking about what hardware our systems need day-to-day. I've half-joked several times that any website that has less than a hundred concurrent users should be able to run on my spare Raspberry Pi on my apartment's internet. If you're building a small-business site or internal tool, that same half-joke applies to your site too.<sup>1</sup> Such a  small, cheap system-on-a-chip is way too fragile for any real, production use, but it's more than powerful enough to be a good testing rig. Get one, deploy your production system on it, and see if you can serve a hundred users quickly and efficiently. Older systems have done more with a lot less.</p>\n<p>We're not building a space ship here, just a website.<sup>2</sup></p>\n<div class=\"footnote\">\n    <sup>1</sup> My Raspberry Pi B+ (Quad-Core 800MHz CPU & 1 GB of RAM) is hooked up to a 150x15 Mbps connection, and runs a standard build of Debian Linux. If you can't host your website on that, then you're either building a fairly complex site with lots of computing demands, or have some pretty inefficient code.<br />\n    <sup>2</sup> Disregard this message if you actually are building space ships or otherwise very complex software that for obvious reasons cannot be run on a $35 SOC meant for teaching children. Web Devs building CRUD apps: you're not excluded.\n</div>", "date_published": "2019-01-23T18:08:00-08:00", "title": "The Hidden Cost of Cheap Hardware", "id": "http://brianschrader.com/archive/the-hidden-cost-of-cheap-hardware/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/i-love-nsoperation/", "tags": ["development", "software", "nsoperation"], "content_html": "<p>I've <a href=\"/archive/multithreading-in-java/\">talked before</a> about how much I like using Apple's Grand Central Dispatch API for multithreading on iOS, but over the last year I've become a huge fan of NSOperation and it's become my preferred way to do multitasking on iOS over bare-bones GCD.</p>\n<p>NSOperation (or just Operation in Swift) can be used a layer of abstraction over GCD that provides built-in dependency tracking, and task isolation. When combined with NSOperationQueue (OperationQueue in Swift) you also get powerful throttling APIs and more. Typically I've used Operations for background networking and processing, but the API is designed to be used for any set of discrete tasks including UI workflows and more.</p>\n<h2>As a Networking Layer</h2>\n<p>My most common use case for NSOperation is in doing networking. In Pine.blog for example I need to always ensure that a user's OAuth Access Token is valid before making a resource request, say for their timeline. That code looks something like this:</p>\n<p><code class=\"swift\"><pre>\nfunc updateTimeline() {\n    // This task must always happen first. It ensures that the OAuth token\n    // is going to be valid when I request it, or it attempts to refresh the token.\n    let reauthorize = TokenReauthorizationOperation()\n    // Now we attempt to fetch the user's timeline and add ourselves as a delegate\n    // so the Operation will tell us when new data is available. We also set the\n    // reauthorization operation as a dependency of the FetchTimelineOperation\n    let fetchTimeline = FetchTimelineOperation()\n    fetchTimeline.delegate = self\n    fetchTimeline.addOperation(reauthorization)\n    // Add the tasks to the queue and process them asyncronously.\n    // The custom delegate will be alerted when new data is available.\n    BackgroundQueueController.queue?.addOperations(\n        [reauthorize, fetchTimeline],\n        waitUntilFinished: false\n    )\n}\n</pre></code></p>\n<p>What I've really liked about my NSOperation-based networking is that from the ViewController's perspective, it doesn't care what these tasks do or how, they're just notified when they've received results and I've finally stashed away my networking code into it's own little corner of the codebase, rather than in a custom controller or nestled inside the ViewController where it just gets in the way.</p>\n<p>The FetchTimelineOperation takes care of fetching the JSON from the API and creating Core Data Managed Objects. Then my ViewController's FetchedResultsController just worries about displaying the changes to the user. It's simple, clean, and there's a clear seperation between the ViewController and the Networking Stack.</p>\n<h2>Gotchas</h2>\n<p>If there's one thing that frustrates my iOS development it's that Core Data Contexts aren't thread-safe. Originally, I thought that just meant that I couldn't write to the same Core Data store from another thread, but that's simply not the full story. <strong>Never read from or write to Core Data objects from a thread or context other than the one they came from.</strong> Better yet: do all your Core Data writing inside a <code>performAndWait() {}</code> block.</p>\n<p>Keep in mind, these aren't so much issues with NSOperation as they are overall tips for using Core Data.</p>\n<h3>The Bad Way</h3>\n<p>When it comes to my Operations, what that means is that although you'd be tempted to write something like this:</p>\n<p><code class=\"swift\"><pre>\nclass MarkPostAsRead: Operation {\n    var post: Post\n    init(post: Post) {\n        self.post = post\n    }\n    override main() {\n        let context = getManagedObjectContext()\n        context.performAndWait {\n            self.post.read = true\n            do {\n                context.save()\n            } catch {\n                NSLog(\"Failed to save post read status for Post: (id)\")\n            }\n        }\n    }\n}\n</pre></code></p>\n<p><strong>You should never do this.</strong> You're violating a number of Core Data's assumptions and you'll get a crash.</p>\n<h3>The Good Way</h3>\n<p>The best way I've found to do Core Data work in a Background Operation is something like this:</p>\n<p><code class=\"swift\"><pre>\nclass MarkPostAsRead: Operation {\n    var id: NSManagedObjectId\n    init(postWith id: NSManagedObjectId) {\n        self.id = id\n    }\n    override main() {\n        let context = getBackgroundManagedObjectContext()\n        context.performAndWait {\n            // Get the post from CoreData\n            var post: Post!\n            do {\n                post = try context.existingObject(with: id) as? Post\n            } catch {\n                NSLog(\"Unable to mark post as read because it doesn't exist.\")\n                return\n            }\n            // Mark it as read\n            post.read = true\n            // Save the Context\n            do {\n                context.save()\n            } catch {\n                NSLog(\"Failed to save post read status for Post: (id)\")\n            }\n        }\n    }\n}\n</pre></code></p>\n<p>This method ensures that you're never passing managed objects between threads and you're only modifying that object within the background context you created\nfor that purpose.</p>\n<p>Keep in mind though, any <code>FetchedResultsControllers</code> you've made won't be immediately notified of the changes because they happened in a background context instead of the View Context they're using. To fix this add something like this into your Core Data Stack Code:</p>\n<p><code class=\"swift\"><pre>\n    func initializeCoreDataStack() {\n        // ... Do startup work...\n        // Listen for background context changes\n        NotificationCenter.default.addObserver(\n            self,\n            selector: #selector(contextDidSave),\n            name: .NSManagedObjectContextDidSave,\n            object: nil\n        )\n    }\n    @objc func contextDidSave(notification: Notification) {\n        guard let sender = notification.object as? NSManagedObjectContext else {\n            // Not a managed object context. Just leave it alone.\n            return\n        }\n        // Don't listen for changes to the view context.\n        let viewContext = DataController.persistentContainer.viewContext\n        if sender != viewContext {\n            ensureMainThread {\n                viewContext.mergeChanges(fromContextDidSave: notification)\n            }\n        }\n    }\n</pre></code></p>\n<p>Now the View Context will automatically merge changes from the background contexts when you call <code>context.save()</code>.</p>\n<h3>Dispatching Concurrent Groups of Operations</h3>\n<p>In some cases your app will need to dispatch an operation that could need to dispatch multiple, concurrent suboperations. In this case I've found it really helpful to wrap the group of asynchronous operations inside of a synchronous operation that simply waits for them to complete.</p>\n<p><code class=\"swift\"><pre>\nclass LotsOfConcurrentRequests: Operation {\n    var urls: [URL]\n    var results: [JSONObject]? = nil\n    init(responsesFrom urls: [URL]) {\n        self.urls = urls\n    }\n    override main() {\n        let suboperations = urls.map { url in\n            return AsyncFetchURLOperation(url: url)\n        }\n        // Add the tasks to the queue and wait until they're all done. Easy.\n        BackgroundQueueController.queue?.addOperations(\n            suboperations,\n            waitUntilFinished: true\n        )\n        // Gather the results\n        results = suboperations.map { $0.result }\n    }\n}\n</pre></code></p>\n<p>And that's pretty much it. NSOperation has basically replaced GCD for me in all but a few niche use-cases since NSOperation allows you to define complex workflows in a simple, clear way that you can invoke and control from any aspect of your app and it nicely separates your networking code from the other parts of the system.</p>\n<p><link rel=\"stylesheet\"\n      href=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/styles/default.min.css\">\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/highlight.min.js\"></script><script>hljs.initHighlightingOnLoad();</script></p>", "date_published": "2018-12-23T22:29:00-08:00", "title": "I Love NSOperation", "id": "http://brianschrader.com/archive/i-love-nsoperation/"}], "author": {"url": "https://brianschrader.com", "name": "Brian Schrader", "avatar": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "icon": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}