{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "http://brianschrader.com/archive/what-if-bookclub-but-with-ai/", "url": "http://brianschrader.com/archive/what-if-bookclub-but-with-ai/", "title": "What if: Bookclub, but AI?", "date_published": "2025-06-04T06:00:00", "tags": ["programming", "ai"], "author": {"name": "Brian Schrader"}, "content_html": "<p>A while back I had a free evening and a silly idea, and what resulted was an interesting exploration of the large-context behavior and analytical capabilities of modern LLMs (ChatGPT in my case). The idea was very simple:</p>\n<blockquote>\n<p>What would happen if ChatGPT hosted a bookclub with itself?</p>\n</blockquote>\n<p>Now, this is&mdash;of course&mdash;a very serious question with very serious implications for the trajectory of modern technology, so I set out on a quest to answer mankind's greatest curiosity.</p>\n<p>A few hours later, <a href=\"https://github.com/Sonictherocketman/bookclub/\">I had my answer</a>, so let's go over it, shall we?</p>\n<h2>The Why</h2>\n<p>There has long been a common notion in the Discourse that&mdash;since LLMs are trained on public internet data and since that data is increasingly polluted with AI spam content&mdash;the general quality of AI-generated results would degrade over time.</p>\n<p>As well it's widely known that even the most top-quality LLMs today generally return banal, shallow, and overly friendly responses, even when prompted not to (in some cases because of explicit training to do so), and I was curious to see what would happen if GPT was given the opportunity to converse, long-form, over time with a disparate group of minds. I was interested to see if GPT would overcome its preference for lackluster observations when summarizing text and genuinely discover something novel. To do this, I knew I couldn't simply ask it questions about a given text in its training set, I would need to instruct it to conduct an elaborate play of personalities, each of whom would read and summarize the text in their own way.</p>\n<h2>Getting it Together</h2>\n<p>The code itself isn't very exciting. I cobbled together a little Python script that would take in a set of personality files for each of my several bookclub participants and then randomly choose between them for who was going to speak next. To keep things consistent, the script would keep a log of the dialogue as it went and submit that with each request.</p>\n<p>As I played with the script, I made two changes, each of which significantly improved the conversation. First, I made it so that each participant would be primed by feeding ChatGPT the given personality and the chapter text, and then I asked GPT to summarize the chapter in the perspective of the given person. That summary would then be added to the given person's <code>mind-state</code>. Second, I added a bias in the random choice of speaker that preferred any names mentioned in the prior response&mdash;GPT often referred to other characters by name and it would be natural for that person to respond directly.</p>\n<p>Both of these changes inspired several additional ideas for future improvements, but we'll get to that in a minute. For now, let's see what happened when the script did its thing.</p>\n<h2>Ready, Set, Bookclub!</h2>\n<div class=\"image-right\" style=\"max-width: 300px;\">\n<img alt=\"The Cover of the Book assigned for that week's session: The Purple Cloud\" src=\"/images/blog/purple-cloud.jpg\" style=\"max-width: 100%\">\n</div>\n\n<p>The book I had originally lined up for this was <q>Pride and Prejudice</q> as it's <a href=\"https://www.gutenberg.org/files/1342/1342-h/1342-h.htm\">easily available</a> in the public domain. However that choice proved useless as ChatGPT knew too much about the book from its training set. I needed something it had rarely encountered before so that I could test its observational prowess.</p>\n<p>Hence I chose a book I read a few years back: <q>The Purple Cloud</q>, by M.P. Shiel.</p>\n<p>All that was left was to craft a series of personalities to enact my little play, and so I set to crafting some backstories and, like a director: I set the scene.</p>\n<details>\n  <summary>ChatGPT's Scene Instructions &amp; Motivation</summary>\n<img alt=\"GPT receiving character motivations before the show\" src=\"/images/blog/gpt-scene-directions.png\">\n<p>\n    I workshopped these quite a bit, but I know there's more to do. Obviously I could have tried custom assistants, but that is discussed more below.\n</p>\n</details>\n\n<p>At first, I was pleasantly surprised. Each of GPT's personas invented motivations and expanded on their backstories, and GPT never seemed confused about who was talking and easily tracked the flow of the conversation. Characters routinely invented novel conversation topics and helped to slowly invent the character of the world around them.</p>\n<p>However it didn't take long before things went awry.</p>\n<p>On several attempts, one of my characters would pour wine for the group (a kind enough gesture), and the group would all toast and thank each other for coming out for the evening. However, it seems no where in GPT's training data does it contain any reference to narrative pacing or what to do in order to <em>finish</em> a toast, and so the conversation would inanely continue on and on as each character added more to the toast, and never once did any of them decide to actually drink. 🥂</p>\n<div class=\"image-container-center\">\n<img class=\"image-center\" alt=\"A screenshot of the output of the script.\" src=\"/images/blog/bookclub-log.png\" />\n</div>\n\n<p>In future attempts, I intend to add another personality to act as a sort of <em>stage direction</em> bot, whose only job is to add occasional scene changes that the characters would be assumed to observe. This, hopefully, would alleviate this issue and help to avoid the next one:</p>\n<p>Once GPT established a scene, it never changed or evolved. This was surprising as over time all sorts of conversational details were being added to the chat: discussions of the book chapter, character moments, and backstory were ripe for use, but the conversations only ever got duller as they went on. Soon characters were agreeing to visit a consistently invented, newly-opened, vegan cafe with apparently fantastic croissants, but as the small talk progressed characters would endlessly revisit topics, gush pointlessly, and never add anything novel of value.</p>\n<p>And that leads me to my most interesting observation: the conversation always died without any insight into or worthwhile analysis of the book chapter provided. Sure, characters would discuss the most superficial of elements and it was all incredibly mundane. Discussion was largely focused on the sense of foreboding mood found in the chapter or on the director's stage direction for some of the characters to be put off by the often unwieldy prose. For all it's might, GPT couldn't even be bothered to bring up specifics of the main character's arctic expedition, comment on any specific character's motivations or plot drama, or even try to predict the ending.</p>\n<div class=\"image-container-center\">\n<img class=\"image-center\" alt=\"A screenshot of the output of the script.\" src=\"/images/blog/gpt-conversation-quality.png\" style=\"border-radius: 5px; max-width: 100%; padding: 0;\" />\n<small><center>Overall (perceived) conversational quality.</center></small>\n</div>\n\n<p>And invariably, one of my characters would ask when the eponymous Purple Cloud would appear, to which another would reply that it \"sounded ominous\". GPT it seems is about as good at analyzing novel text as a high-schooler who only read the back-of-the-book blurb (read: myself in high-school).</p>\n<h2>What Does It All Mean?</h2>\n<p>In general, I was less-than-impressed with GPT's abilities in this task. As I mentioned before, it quickly became apparent that GPT could spout off vapid insights regarding the text of <q>Pride and Prejudice</q> even without the chapter text (I had a bug originally that prevented the text from being included in the chat log, but nevertheless GPT knew about the plot and characters), however with a less-familiar text it proved much less insightful than I expected.</p>\n<p>In general, I'm not sure what to make of this little experiment. I'm more certain that I'd like to try it all again with several specific, technical improvements that will hopefully address some of the limitations I encountered.</p>\n<h2>Bookclub 2.0</h2>\n<p>While I haven't gotten around to implementing any of these yet, here's the list of features I came up with to improve the process:</p>\n<p><em>Use Stage Direction:</em> As I said, one of the chief limitations of this process was the fact that the scene itself never evolved. That meant that after each character had explored their backstory and current setting, there was no where to go and so they babbled on incessantly about nothing. Adding another agent whose primary job is to insert novel change would hopefully disturb the equilibrium and allow for new insights.</p>\n<blockquote>\n<p>A dump truck drives by and outside a dog barks.</p>\n</blockquote>\n<p><em>Improve each Character's Mental Model:</em> Here I'd hope to track not only the character dialogue but improve on the priming process I mentioned before by asking (at every step) what each character <em>thinks</em> about the current situation and allow their own mental state to evolve beyond what is present in the spoken dialogue. Currently it's not possible for characters to have separate internal and external states which also likely flattens their complexity. As well I'd hope to include much more detail in each character's backstory and education including other materials they found interesting or recently encountered.</p>\n<p><em>Consider Different LLMs:</em> One critical limitation of this approach is that it only uses one LLM and therefore is biased toward one set of training data and methods. Perhaps if a given character were assigned a different LLM that could help matters. There's bound to be implicit baises in each model that could affect the conversational tone (and who knows! perhaps then it would be possible to have a jerk participate in the conversation).</p>\n<p>In addition to these two improvements, I'd hope to investigate some technical changes as well. The sheer volume of tokens being submitted (including the entire chapter text and dialogue history) means that the project quickly racked up a tab. However in order to have richer character personas I'd likely need to investigate training custom assistants rather than feeding it all through the chat log API.</p>\n<p>Anyways that's it. I don't really have a through-line for this post. I just tried a thing and thought it was worth sharing. If you have suggestions or feedback, please file an issue or shoot me an email. The project is up <a href=\"https://github.com/Sonictherocketman/bookclub/\">on GitHub</a> if you want to play with it yourself.</p>"}, {"id": "http://brianschrader.com/archive/a-counting-meta-post/", "url": "http://brianschrader.com/archive/a-counting-meta-post/", "title": "A Counting Meta-Post", "date_published": "2025-01-14T01:50:00", "tags": ["blogging", "meta"], "author": {"name": "Brian Schrader"}, "content_html": "<p>It's been a while since we've run this little snippet, so let's see what we get!</p>\n<p><code>$ find archive/ -name \"*.md\"|xargs -I {} cat {} | wc -w</code><br />\n<code>124582</code></p>\n<p>That means that there's roughly 124,582 total words written on this blog, not bad! That means I've managed to increase the total word count on this blog by nearly 24% in two years.</p>\n<p>I'm not going for word count here, but it's still an interesting metric mostly because I post so much less frequently than I used to. That realization lead me to a much more interesting question about the overall length of individual blog posts over time. I posted the preliminary results over <a href=\"https://mastodon.social/@sonicrocketman/113680787236911331\">on Mastodon</a> where I also discussed my reasoning behind the obvious trend of post length increasing over time.</p>\n<p><img alt=\"A chart of the length of blog posts over time with a trend line that clearly goes up and to the right.\" src=\"/images/blog/post-length-vs-time.jpg\" class=\"image-center\"/></p>\n<p>In general, my posts get longer as time goes on, and you can see that even more clearly in this chart which groups posts by the year they were\n<img alt=\"A boxplot of the posts on this blog grouped by year\" src=\"/images/blog/words-by-year-boxplot.jpg\" class=\"image-center\"/></p>\n<p>The general trend for a given post's word count had been slightly upward for a long time, but the trend seems to take off in 2021 (with a huge dip in 2023 due to a lot of quick project posts). 2024 however is the clear outlier.</p>\n<blockquote class=\"mastodon-embed\" data-embed-url=\"https://mastodon.social/@sonicrocketman/113680790417578033/embed\" style=\"background: #FCF8FF; border-radius: 8px; border: 1px solid #C9C4DA; max-width: 540px; min-width: 270px; overflow: hidden; padding: 0; margin-left: auto; margin-right: auto;\"> <a href=\"https://mastodon.social/@sonicrocketman/113680790417578033\" target=\"_blank\" style=\"align-items: center; color: #1C1A25; display: flex; flex-direction: column; font-family: system-ui, -apple-system, BlinkMacSystemFont, 'Segoe UI', Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', Roboto, sans-serif; font-size: 14px; justify-content: center; letter-spacing: 0.25px; line-height: 20px; padding: 24px; text-decoration: none;\"> <svg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" width=\"32\" height=\"32\" viewBox=\"0 0 79 75\"><path d=\"M74.7135 16.6043C73.6199 8.54587 66.5351 2.19527 58.1366 0.964691C56.7196 0.756754 51.351 0 38.9148 0H38.822C26.3824 0 23.7135 0.756754 22.2966 0.964691C14.1319 2.16118 6.67571 7.86752 4.86669 16.0214C3.99657 20.0369 3.90371 24.4888 4.06535 28.5726C4.29578 34.4289 4.34049 40.275 4.877 46.1075C5.24791 49.9817 5.89495 53.8251 6.81328 57.6088C8.53288 64.5968 15.4938 70.4122 22.3138 72.7848C29.6155 75.259 37.468 75.6697 44.9919 73.971C45.8196 73.7801 46.6381 73.5586 47.4475 73.3063C49.2737 72.7302 51.4164 72.086 52.9915 70.9542C53.0131 70.9384 53.0308 70.9178 53.0433 70.8942C53.0558 70.8706 53.0628 70.8445 53.0637 70.8179V65.1661C53.0634 65.1412 53.0574 65.1167 53.0462 65.0944C53.035 65.0721 53.0189 65.0525 52.9992 65.0371C52.9794 65.0218 52.9564 65.011 52.9318 65.0056C52.9073 65.0002 52.8819 65.0003 52.8574 65.0059C48.0369 66.1472 43.0971 66.7193 38.141 66.7103C29.6118 66.7103 27.3178 62.6981 26.6609 61.0278C26.1329 59.5842 25.7976 58.0784 25.6636 56.5486C25.6622 56.5229 25.667 56.4973 25.6775 56.4738C25.688 56.4502 25.7039 56.4295 25.724 56.4132C25.7441 56.397 25.7678 56.3856 25.7931 56.3801C25.8185 56.3746 25.8448 56.3751 25.8699 56.3816C30.6101 57.5151 35.4693 58.0873 40.3455 58.086C41.5183 58.086 42.6876 58.086 43.8604 58.0553C48.7647 57.919 53.9339 57.6701 58.7591 56.7361C58.8794 56.7123 58.9998 56.6918 59.103 56.6611C66.7139 55.2124 73.9569 50.665 74.6929 39.1501C74.7204 38.6967 74.7892 34.4016 74.7892 33.9312C74.7926 32.3325 75.3085 22.5901 74.7135 16.6043ZM62.9996 45.3371H54.9966V25.9069C54.9966 21.8163 53.277 19.7302 49.7793 19.7302C45.9343 19.7302 44.0083 22.1981 44.0083 27.0727V37.7082H36.0534V27.0727C36.0534 22.1981 34.124 19.7302 30.279 19.7302C26.8019 19.7302 25.0651 21.8163 25.0617 25.9069V45.3371H17.0656V25.3172C17.0656 21.2266 18.1191 17.9769 20.2262 15.568C22.3998 13.1648 25.2509 11.9308 28.7898 11.9308C32.8859 11.9308 35.9812 13.492 38.0447 16.6111L40.036 19.9245L42.0308 16.6111C44.0943 13.492 47.1896 11.9308 51.2788 11.9308C54.8143 11.9308 57.6654 13.1648 59.8459 15.568C61.9529 17.9746 63.0065 21.2243 63.0065 25.3172L62.9996 45.3371Z\" fill=\"currentColor\"/></svg> <div style=\"color: #787588; margin-top: 16px;\">Post by @sonicrocketman@mastodon.social</div> <div style=\"font-weight: 500;\">View on Mastodon</div> </a> </blockquote>\n<script data-allowed-prefixes=\"https://mastodon.social/\" async src=\"https://mastodon.social/embed.js\"></script>\n\n<p>Of course the early days of this blog were a huge outlier as well, but that's another topic. Excluding the early days, things are trending up.*</p>\n<div class=\"footnote\">\n* In terms of word count. Offer not valid in all states.\n</div>"}, {"id": "http://brianschrader.com/archive/foundational-texts/", "url": "http://brianschrader.com/archive/foundational-texts/", "title": "Foundational Texts", "date_published": "2024-12-19T19:11:00", "tags": ["book", "book recommendations", "books"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Recently, I saw <a href=\"https://kottke.org/24/12/what-are-your-personal-foundational-texts\">this post</a> from Kottke about so called Foundational Texts, and it got me thinking.</p>\n<blockquote>\n<p>Writer Karen Attiah recently wrote about the pleasure of perusing other people’s personal libraries and then asked her followers what their “personal foundational texts” were…those books that people read over and over again during the course of their lives…</p>\n<p>How about you? What are your personal foundational texts?</p>\n</blockquote>\n<p>The question is a super interesting one. What books one reads shape their worldview. All media does this but, at least to me, books seem to hold an outsized influence. A few movies or TV shows stand out to me as being my favorites, fewer still exert a shaping force on me. Books seem to possess a more potent staying power.</p>\n<p><img src=\"/images/blog/foundational-books.png\" style=\"max-width: 100%;\" /></p>\n<p>The thing is, I don't really <em>re-read</em> books (especially non-fiction). Sure, there's a couple I've revisited over the years, but it's a very small list. That said there are select set of books that, once I'd read them, I've never gotten them out of my head.</p>\n<p>So let's get into it (in no particular order):</p>\n<ul>\n<li>The Wizard of Earthsea by Ursula K. LeGuin</li>\n<li>The People vs. Democracy by Yascha Mounk</li>\n<li>The Scientific Revolution by Steven Shapin</li>\n<li>Pale Blue Dot by Carl Sagan</li>\n<li>The Silmarillion by J.R.R. Tolkien</li>\n<li>Zen and the Art of Motorcycle Maintenance by Robert M. Pirsig</li>\n<li>Gödel's Proof by Ernest Nagel</li>\n</ul>\n<p>Most of these I read in high school and college (or right after college), which is probably why they are so foundational. What's interesting is that, looking at them now, I clearly see a set of themes that stand out to me as foundational to my thinking about the world: optimism vs. caution, systems vs. the individual, agency vs. limits. Perhaps I'll expound more on these in a future post.</p>\n<p>Usually, when I to get interested in a topic, I dive in whole hog, and so my reading list tends to be very single-minded for a while until eventually it takes a sharp detour one day toward something usually unrelated. From 2017-2022 that topic was U.S. Politics and Government. When I'm not in that sort of research-mode, I tend to revert to either some classic American novel or Fantasy.</p>\n<p>But this means that what \"foundational\" means to me is that it is heavily influential and formative as to how I think about a topic. When I think of each of the books in the list above, I can immediately recall the change it had on my thinking.</p>\n<p>As I've <a href=\"/archive/podcasts-the-universe-and-everything/\">mentioned before</a> podcasts have had a huge impact on me, especially in my late high-school and early college years. Both the Writing Excuses podcast and the lectures from Astronomy 162 at Ohio State stand out in my memory as shaping my interests.</p>\n<p>Now, to continue Jason's call to action, what about you? What are your foundational texts?</p>"}, {"id": "http://brianschrader.com/archive/science-models-and-squeaking-lead/", "url": "http://brianschrader.com/archive/science-models-and-squeaking-lead/", "title": "Science, Models, and Squeaking Lead", "date_published": "2024-12-18T07:54:00", "tags": ["history", "alchemy", "philosophy"], "author": {"name": "Brian Schrader"}, "content_html": "<p>At the dawn of the 14th century the Franciscan alchemist <a href=\"https://en.wikipedia.org/wiki/Paul_of_Taranto\">Paul of Taranto</a> crouched over the strange lump of metal he'd created. He gaped, in awe of what he had done. It should have been impossible. The scholars told him he was a fool to even try, yet he'd <em>done</em> it. It wasn't gold that he'd created. He was still far from achieving that goal, but he'd made an important step. According to the book he would later publish under the title <em>Summa perfectionis magisterii</em>, Paul&mdash;writing under a deliberately confusing pseudonym&mdash;had just transmuted Lead into Tin!<sup>1</sup></p>\n<p>For those of us in the 21st century, it's second nature to dismiss this sort of claim as obviously ridiculous. There is no known, chemical way to do what Paul intends. But that begs a very obvious question: what <em>had</em> he done? If we take the man at his word, he certainly seems to have done <em>something</em> to his bar of lead, but what? And why did he believe his experiment had succeeded?</p>\n<p>These questions will lead us down a very fascinating path, and one that reveals the striking truth about our knowledge of the natural world.</p>\n<h2>Theory &amp; Practice</h2>\n<p>We take so much for granted these days about the knowledge of the natural world. We consider obvious and teach to children what took generations of the brightest minds to figure out, and it can be very easy to forget that.</p>\n<p>Today we break apart systems to understand them; this is Reductionism. And we use material analysis to understand and manipulate the properties of physical objects: that is we melt, dissolve, chemically alter, and then recombine materials in order to create what we want. But in order to do all that&mdash;and better to make predictions about what <em>exactly</em> our methods will accomplish in doing so&mdash;we must accept the following assumption: that an object is nothing more than a physical assortment of indivisible components.<sup>2</sup> This assumption may seem obvious to most people today, but it wasn't always that way! Indeed most serious philosophers in the past considered the idea ludicrous.<sup>3</sup></p>\n<p><img src=\"/images/blog/alchemy/book-wide.jpg\" style=\"width: 100%; max-width: unset; padding: 0;\" class=\"image-center\" /></p>\n<p>I won't go into the history of Classical &amp; Medieval Matter Theory, but suffice it to say that before a pre-modern version of what we today would call Atomic Theory would emerge, the dominant view of \"What is Stuff?\" was far more <strong>qualitative</strong> than <strong>quantitative</strong>. For the programmers out there, think of their Matter Theory as a sort of Duck Typing.<sup>4</sup></p>\n<blockquote>\n<p>If it walks like a duck and it quacks like a duck, then it's a duck.</p>\n</blockquote>\n<p>Matter <em>was</em> it's qualities. Gold is yellow, ductile, resists being tarnished. Lead tarnishes easily, it's heavy. Tin is silvery and <a href=\"https://www.youtube.com/watch?v=kzIsvbKHgfU\">when you bend it</a>, <strong>it squeaks</strong>. Therefore the process of turning one metal into another is a matter of giving it the desired qualities!</p>\n<div style=\"float: right; min-width: 270px;\" class=\"image-container\">\n<img src=\"/images/blog/alchemy/geber.jpg\" style=\"height: 425px; max-width: unset;\" />\n<caption><small>Photos: mine</small></caption>\n</div>\n\n<p>As at every point in history, there were differing view points about what exactly matter is made of and scholarly opinions differed greatly. However, one theory&mdash;preferred by alchemists like our old friend Paul&mdash;held that the four prime elements were bound together into a duopoly of two higher-level substances to make the metals. What were those substances? Why <a href=\"https://en.wikipedia.org/?title=Sulfur-mercury_theory_of_metals&amp;redirect=no\">sulfur and mercury</a>!</p>\n<p>Yup, literal sulfur (or brimstone) and mercury (or quicksilver).</p>\n<p>Now before we make fun of Paul too much (or rather <a href=\"https://en.wikipedia.org/wiki/Pseudo-Geber\">Geber</a> as he called himself in his writing), let's try to understand <em>why</em> he thought sulfur and mercury were the foundational elements underpinning all metals. Under this theory, the difference between say lead and gold was simply in the relative proportions of these primary ingredients!</p>\n<p>Paul, like so many alchemists, was seemingly quite the avid experimentalist, and so based his theories on what he could determine by the fire. Among many other experiments, he noticed the sulfurous smell given off by impure metals during refining and assumed that such a smell was due to a volatile sulfur within the metal itself. Additionally, according to Dr. William Newman:</p>\n<blockquote>\n<p>The fact that calcined [i.e. burned] metals often appear in the form of yellow, red, or white powder (what we coul call oxides) suggests to Geber that they also contain...sulfur that remains after the volatile sulfur has been forced out by calcination.<br />\n- <a href=\"https://www.amazon.com/Atoms-Alchemy-Experimental-Scientific-Revolution/dp/0226576973\">Atoms &amp; Alchemy</a> by William R. Newman, p. 33</p>\n</blockquote>\n<p>As for the mercury, that brings us back to our earlier tale. Again Newman writes:</p>\n<blockquote>\n<p>Geber proves [his] point by washing lead with quicksilver and then melting it. whereupon the lead gains the creak that the tin had lost&mdash;as he puts it, the lead is converted to tin.<br />\n- <a href=\"https://www.amazon.com/Atoms-Alchemy-Experimental-Scientific-Revolution/dp/0226576973\">Atoms &amp; Alchemy</a> by William R. Newman, p. 33</p>\n</blockquote>\n<p>According to his theory this worked because tin had more intrinsic mercury than lead. Therefore, to transform it, one simply needed to add mercury into the lead. Sure enough, once lead is washed in this way, <em>it squeaks when it bends</em>. Paul had successfully imparted the quality of squeakability into his lead, thereby transforming it (albeit partly) into tin.</p>\n<p>It might sound silly, but consider this: here was a person who formed a hypothesis about the cause of a natural phenomenon, then tested it. It worked, so he built on it. That sounds a lot like science, doesn't it?</p>\n<h2>What Even <em>is</em> Science?</h2>\n<p>At it's core, modern science is two things: a process of inquiry and a collection of knowledge. Together those two form a model of the natural world that we use to make predictions and offer explanations into the workings of nature. Science does not, and cannot, tell us how nature actually works under the hood, instead it gives us the tools to develop and test our models.</p>\n<p>This point is worth belaboring, because for me, it took a long time to really click.</p>\n<p>I studied aerospace engineering, which is basically Newton's mechanics, material design, and a lot of stuff about how fluids flow (air is a fluid, you see). When you study physics in this way, it can be tempting to believe you've learned something about nature, but what you've learned is how to <em>model</em> nature. There are always error terms sticking out, gaps in the theory, losses you approximate (spherical, frictionless cows for example). The math isn't nature, it's an approximation. Crucially, it's an approximation that <em>seems to work</em>, or at least it does within your measure of tolerance.</p>\n<p>It's hard to remember that we don't really know how nature works. We know how to approximate it. But that fact becomes easier to understand when you approach the study of nature, not from our current perspective, but from the outside.</p>\n<p>What's so fascinating to me about the example of poor old Geber/Jabir/Paul above is that his theories about matter were utterly wrong, and yet they did offer testable predictions that were sometimes correct! Like many scientists before and since, Paul may have very well chalked up his experimental failures to defects in apparatus, hidden variables like mineral origins, or even the incompleteness of his own theories, but nevertheless he worked with and improved his theories so to arrive at testable methods and predictions, and he wasn't the only one!</p>\n<p>It fascinates me so much because I find myself wondering: what do we believe about nature that future generations will look back on with the same bemusement that we feel about Paul of Taranto or any other proto-scientist who's theories fell short? What about nature will become so obvious that it's taught to ten-year-olds in four centuries, but that now our brightest cannot see?</p>\n<div class=\"footnote\">\n<sup>1</sup> The opening scene of this post is a fictional account, so no one take this too seriously.\n</div>\n<div class=\"footnote\">\n<sup>2</sup> Or chemically indivisible at least.\n</div>\n<div class=\"footnote\">\n<sup>3</sup> All of this pertains only to the European West and the Middle East during the Classical and Medieval periods. Basically those cultures touched by the legacy of Aristotle.\n</div>\n<div class=\"footnote\">\n<sup>4</sup> For the Programmers out there, think about this:<br /><code>\nclass Tin extends Lead implements Squeakable, Silvery {}\n</code>\n</div>"}, {"id": "http://brianschrader.com/archive/the-mysterious-potential-of-the-plane/", "url": "http://brianschrader.com/archive/the-mysterious-potential-of-the-plane/", "title": "The Mysterious Potential of the Plane", "date_published": "2024-12-13T02:46:00", "tags": ["mathematics", "math"], "author": {"name": "Brian Schrader"}, "content_html": "<p>In recent years I've embarked on a sort of journey of rediscovery with respect to mathematics. As a kid I was <em>somewhat</em> good at math and I spent my college years doing lots of it&mdash;to the point where I grew to really dislike it. But even in those times, mathematics&mdash;while becoming increasingly difficult&mdash;always seemed like it was trying to tell me something. These days, it fascinates me.</p>\n<p>A common observation among those who study classical engineering fields is that many (if not most) of the problem domains are modelled with very similar techniques. The motion of a cantilevered beam, a road bridge, a plane wing, a mass on a spring, a musical note, and even a planet's orbit can be described by very similar mathematics. Indeed so many physical phenomena can be described by these equations that it can make you wonder if you've stumbled into some <a href=\"https://www.wired.com/2016/07/everything-harmonic-oscillator/\">great secret</a> of the universe.</p>\n<figure>\n<a href=\"https://commons.wikimedia.org/wiki/File:Horizontal-mass-on-spring.svg\">\n<img class=\"image-center\" src=\"/images/blog/Horizontal-mass-on-spring.svg\" />\n</a>\n<figcaption style=\"display: block; text-align: center;\"><small>To the physics/engineering undergrad, <i>everything</i> is a mass on a spring.<br />Credit: MikeRun/WikiMedia Commons</small></figcaption>\n</figure>\n\n<p>But that wonderful truth is only a gateway to something much deeper, more fundamental&mdash;a true capital-S Secret of the Universe. Mathematics tends to deceive with simplicity, and there's few things in this world that hide more secrets than this simplest of concepts.</p>\n<h2>Consider the Plane</h2>\n<p>As children we're taught about the 2-D Plane.<sup>1</sup> At first, students are confused in a manner similar to how they felt when being told <math math;\"><mrow><mi>x</mi><mrow></math> was a number now, and oftentimes that confusion grows into consternation. At worst, plotting and manipulating curves on this plane feels pointless, arbitrary, and unnatural. For those who come to know the plane as a tool, it can be quite an enlightening process. As an undergrad engineering student, you become familiar with the plane and its rules; you learn to shape curves and solve perspective puzzles with it. Modern <a href=\"https://www.youtube.com/watch?v=r6sGWTCMz2k\">video animations</a> make this so much more intuitive because they're able to show a figure on the plane change over time: you can watch it squish and stretch as you adjust the coefficients of a quadratic.</p>\n<p><img class=\"image-center\" src=\"/images/blog/cos-grid.png\" style=\"width:500px\" /></p>\n<p>What's more Geometry holds so much deeper meaning in our world than I think most people imagine. Vast numbers of people can use mathematics to do every day tasks: measure the square-footage of a room, scale up a recipe for a family dinner, or plan their finances, but Geometry does so much more. Simple rules about finding the angles in a triangle can help measure the curvature of the universe, and simple sines and cosines (which form the backbone of many vector operations) enable the ability to encode the meaning of abstract linguistic concepts in modern Large Language Models. Our universe is made of math in truly fascinating ways.</p>\n<p>But this isn't my point. So far, this has all been backstory.</p>\n<h2>Exploring the Plane</h2>\n<p>What's truly wondrous about the 2-D Plane isn't what you can plot, but what you can discover. There are infinitely many lines, curves, and shapes one can draw on the 2-D Plane and while most of them are useless, quite a few are incredible. Those are the ones we plot to find the motion of a ball in the air, or the speed of a planet's orbit over time. But there are some curves that hold incredible secrets. We know of a few and there are likely many, many more. These magical curves transform our understanding of mathematics itself.</p>\n<p>Consider the logarithm:</p>\n<div>\n    <math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n      <mrow>\n        <mi>x</mi>\n        <mo>=</mo>\n        <mn>1,000</mn>\n        <mtext> or </mtext>\n        <msup>\n          <mn>10</mn>\n          <mn>3</mn>\n        </msup>\n      </mrow>\n    </math>\n\n    <center style=\"display: block; padding: 0.25rem;\">therefore</center>\n\n    <math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n      <mrow>\n        <mi>l</mi>\n        <mi>o</mi>\n        <mi>g</mi>\n        <mo form=\"prefix\" stretchy=\"false\">(</mo>\n        <mi>x</mi>\n        <mo form=\"postfix\" stretchy=\"false\">)</mo>\n        <mo>=</mo>\n        <mn>3</mn>\n      </mrow>\n    </math>\n</div>\n\n<p>This is a function that can be used to do all sorts of practical, useful operations, but it can also <strong>convert multiplication into addition</strong>.</p>\n<math display=\"block\" class=\"tml-display\" style=\"display:block math; margin-bottom: 0.5rem;\">\n  <mrow>\n    <msup>\n      <mn>10</mn>\n      <mn>3</mn>\n    </msup>\n    <mo>*</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>5</mn>\n    </msup>\n    <mo>=</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>8</mn>\n    </msup>\n  </mrow>\n</math>\n\n<math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n  <mrow>\n    <mi>l</mi>\n    <mi>o</mi>\n    <mi>g</mi>\n    <mo form=\"prefix\" stretchy=\"false\">(</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>3</mn>\n    </msup>\n    <mo form=\"postfix\" stretchy=\"false\">)</mo>\n    <mo>+</mo>\n    <mi>l</mi>\n    <mi>o</mi>\n    <mi>g</mi>\n    <mo form=\"prefix\" stretchy=\"false\">(</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>5</mn>\n    </msup>\n    <mo form=\"postfix\" stretchy=\"false\">)</mo>\n    <mo>=</mo>\n    <mn>8</mn>\n  </mrow>\n</math>\n\n<p>Plotted, the <a href=\"https://www.youtube.com/watch?v=OjIwCOevUew\">logarithm function</a> makes a curve on the 2-D Plane. This means that there exists a curve on the plane which converts multiplication to addition! What other <a href=\"https://www.youtube.com/watch?v=f8CXG7dS-D0\">magical curves</a> exist with incredible properties? Perhaps there's a curve that plots itself? Oh wait! <a href=\"https://www.youtube.com/watch?v=_s5RFgd59ao\">There is</a>!</p>\n<p>At it's core, a function is a thing that takes a number(s) and returns another. This sequence of values can be plotted to form a curve on the plane. There's a curve mapping subtraction to multiplication, one for the GDP of the U.S. over time, and (given some encoding trickery) a curve describing the lifespan in seconds of each and every being that will ever exist! They're all in there somewhere; we just have to find them.</p>\n<p>This is one of the true wonders of mathematics<sup>2</sup>, and more specifically of geometry. Who would think that simple shapes and curves could tell such great truths? Yet so much hides within the expanse. In this way, the work of finding such curves is one of exploration in a treacherous wilderness. With simple tools, one carves a path of discovery amid the endless vastness, returning to share the knowledge they have found.</p>\n<h2>The Secrets Within</h2>\n<p>Held within the depths of this infinite expanse there are perhaps infinitely many fundamental secrets. We only find them through careful study, or occasionally by accident, and we have no idea how many we might be missing&mdash;even amidst the sectors of that expanse we've so thoroughly explored.</p>\n<p>It's so wondrous to me that such a simple concept could hold such great truths and that shapes and curves upon the plane could so accurately model the natural world. Perhaps it should be the Plane or the Triangle that stands beside Fire as our most powerful invention.</p>\n<div class=\"footnote\">\n<sup>1</sup> For most of my life, I'd been confused when people mentioned \"the complex plane\" or \"the number line\" rather than \"a plane\" or \"a number line\", but the beauty in properly capitalizing the name \"The 2-D Plane\" is that, in a Platonic-Forms kind of way, it reveals the truth that we're all talking about the <i>same</i> plane. There's only one. We may depict some fragment of it on a board, but the true 2-D Plane exists in singular and only in Form.\n</div>\n<div class=\"footnote\">\n<sup>2</sup> No doubt some people out there will read a few of my points here and correctly point out that these are more points about infinity rather than specifically the 2-D plane. You are correct, but my point remains valid.\n</div>"}, {"id": "http://brianschrader.com/archive/nothing-throughout-the-ages/", "url": "http://brianschrader.com/archive/nothing-throughout-the-ages/", "title": "Nothing Throughout the Ages", "date_published": "2024-11-13T04:23:00", "tags": ["history", "knowledge"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I'm fascinated by the systems by which we, as humans, make and communicate knowledge. From the very beginning of our species we've done our best to devise ways to understand the natural world and our place in it, and we've used a huge number of different systems of thought to organize, piece together, and build a more complete picture of the world for ourselves.</p>\n<p>I think a lot of people may misunderstand my point here, so let me be very clear, when I say a <em>system of knowledge-making</em> I mean <em>any</em> system, no matter how misunderstood, how imprecise, or how flawed it might seem to modern sensibilities. Religion is a knowledge system, science is a knowledge system, oral tales and legends are a knowledge system, so is writing, music, folklore, culture, and any other way humans pass down forms of knowledge from one generation to the next.</p>\n<p>Every system like this has its flaws and its benefits. Oral tales and folklore for example are excellent ways to pass down traditions and values, but they're terrible ways to ensure later generations understand the precise temperature at which water boils.</p>\n<p>But in particular, I'm very interested in the places where systems of knowledge converge on similar or identical truths, even if they do so for different reasons.</p>\n<div class=\"image-container-center\">\n    <img src=\"/images/blog/corpuscle.jpg\" style=\"width: 400px;\" class=\"image-center\">\n    <small><center>An early-modern diagram of atoms. Drawing: me.</center></small>\n</div>\n\n<p>For example, an alchemist by the name of George Starkey, living in England in the 1650s, discovered a process by which he could chemically cause water to freeze via the endothermic reaction of sal ammoniac (ammonium chloride) with water, though he explained the phenomenon very differently than we would today&mdash;believing instead that he had isolated the quality of coldness and dryness by manipulating the fundamental particles of the compound. Nevertheless, his method worked (and worked well enough for his friends to try persuading him to sell \"artificial ice\" to Italian nobles in the summer).<sup>1</sup></p>\n<h3>Nothing, Null &amp; the Void</h3>\n<p>Likewise the concept of Nothing has puzzled generations of knowledge-makers. Famously the number Zero was absent from Western mathematics until it was introduced around 1200 C.E.. Adding Nothing to a number was considered nonsense. Why even do the math problem then?</p>\n<p>In regard to physics, Aristotle <a href=\"http://classics.mit.edu/Aristotle/physics.5.v.html\">argued</a>, rather forcefully, that Nothing (what he called the <a href=\"https://en.wikipedia.org/wiki/Horror_vacui_(physics)\">void</a>) simply cannot exist because such an existence would be paradoxical. Aristotle viewed matter as continuous, and did not accept the idea of the \"atom\" (that is, a smallest particle of matter) precisely because it would beg a very obvious question: what's between the atoms? It couldn't be nothing, because Nothing couldn't exist.</p>\n<div class=\"image-container-center\">\n    <img src=\"/images/blog/n-corpuscle.jpg\" style=\"width: 400px;\" class=\"image-center\">\n    <small><center>Another depiction of corpuscles. Drawing: me.</center></small>\n</div>\n\n<p>This school of thought lasted for over a thousand years. Eventually though particle theory, or what was called at the time \"the corpuscular theory of matter\" became increasingly popular right around the time of the Scientific Revolution. All the while, the question that Aristotle posed went unanswered.</p>\n<p>Today we know that the vacuum does indeed exist*. <small>(Uh oh)</small></p>\n<p>Indeed the classical vacuum: without air or other gross matter, exists in plenty. Most of space is empty, even most of what we call matter is empty. This is the truth of space and of matter: they are made of mostly nothing. However there are several <a href=\"https://www.youtube.com/watch?v=PhfqdBk8qxk\">kinds of nothing</a>, and empty space is only one of those kinds. At the barest level, our current understanding suggests that space, even when devoid of matter or force particles, is still filled with something: namely <a href=\"https://www.youtube.com/watch?v=ATcrrzJFtBY\">quantum fields</a>, and even more abstractly with potential.</p>\n<p>And this is where the asterisk from before comes in: as far as we know, there is no patch of space that is truly devoid of these fundamental building blocks, so in a way: Aristotle was right.<sup>2</sup></p>\n<h3>Math ado about Nothing</h3>\n<p>As I mentioned before, Western mathematics had to wait until the thirteenth century to be introduced to the concept of Zero in a formal way. Though once incorporated, Nothing, represented by the number zero, proved to be incredibly useful.</p>\n<p>Today the concept of Nothing underpins our entire understanding of numbers. Indeed it seems one can <a href=\"https://www.youtube.com/watch?v=S4zfmcTC5bM\">construct all the natural numbers</a> out of it. In this way Mathematics scoffs at poor Aristotle, for unlike matter which is <em>mostly nothing</em>, the counting numbers and therefore all numbers are really nothing at all!<sup>3</sup></p>\n<p>Nothing, it turns out, is Everything.</p>\n<div style=\"border:1px solid #ccc; border-radius: 3px; padding: 0.5rem;\">\n<pre><code>Consider constructing ℕ using the Empty Set\n(i.e. a set containing nothing):\n  0 = {}\n  1 = {{}}\n  2 = {{{}}}\n  ...\n</code></pre></div>\n\n<h3>Religious Nothing</h3>\n<p>The Abrahamic Religions (along with many other faiths) also feverishly debate the concept of Nothing. In particular, there is the idea that the Christian God created the universe \"ex nihilo\", from nothing, as written in the Book of Genesis. Likewise faiths from all over the world deal with the question of Nothing, though usually in the context of the question: Why is there Anything?</p>\n<p>Creation stories, like that in Genesis, exist all over the world and come in many truly incredible forms.</p>\n<p>All across the world, throughout time and space, humans have needed an answer to the same fundamental questions and we've found a bunch of conflicting and corroborating ways to answer them. Each of these answers have some truth to them and some methods of knowledge-making attempt to answer questions that others simply cannot. Each system is therefore one of partial truths. Science, for example, can answer the question of how matter moves, but it cannot answer what it means to exist.</p>\n<p>I think that's what I love about studying knowledge-systems. I find myself trying to inhabit the minds of those who lived under very different presuppositions about the world, to see the universe through their eyes, and in doing so to find some new and partial truths about the world.</p>\n<h3>Nothing Is</h3>\n<p>In particular, the concept of Nothing has confounded our reasoning for millenia, and while we seem to have a good grip on it now, it's important to remember that we really only guess at its properties (if Nothing can even have properties&mdash;Aristotle, help!).</p>\n<p>Indeed, the concept of Nothing has evolved over the past several thousand years, and even still we debate what it really means. That's something I love about questions like this: the debate will likely never end. Questions posed before the Fall of Rome still rattle around in the minds of people today and while sometimes Physics, or Mathematics, or one's Faith can make attempts to answer these questions, we may truly never know. Such truths may be beyond us.</p>\n<div class=\"footnote\">\n<sup>1</sup> See <a href=\"https://bookshop.org/p/books/gehennical-fire-the-lives-of-george-starkey-an-american-alchemist-in-the-scientific-revolution-william-r-newman/6709407?ean=9780226577142\">Gehennical Fire</a> by William Newman.<br />\n<sup>2</sup> Just not in the way he intended.<br />\n<sup>3</sup> Since all types of numbers are ultimately based on the so called Natural Numbers.\n</div>"}, {"id": "http://brianschrader.com/archive/running--securing-servers-a-concise-guide/", "url": "http://brianschrader.com/archive/running--securing-servers-a-concise-guide/", "title": "Running & Securing Servers: A Concise Guide", "date_published": "2024-10-21T17:47:00", "tags": ["software", "programming"], "author": {"name": "Brian Schrader"}, "content_html": "<p>It might be pretty out-of-vogue to host your own servers in 2024, but I still do it and I quite like it. There's a lot of great benefits to building software on basic infrastructure and I always find myself appreciating the flexibility that simple VPS hosting brings. That said, you do need to be careful. Life as a developer on the Internet requires a pretty decent familiarity with security best-practices.</p>\n<p>Being self-hosted, there's also a lot of simple design decisions that you need to make when running a system on simple VPSs, and there's really not a lot of good info out there to help with this.</p>\n<p>So, here's a simple guide to some of the things I do when setting up my servers.</p>\n<p><span style=\"padding: 0.5rem; border: 1px solid gray; border-radius: 3px;\" class=\"image-center \">\nThis post isn't sponsored by Linode. It's just what I know best.\n</span></p>\n<p><strong>1. Follow <a href=\"https://techdocs.akamai.com/cloud-computing/docs/set-up-and-secure-a-compute-instance\">Linode/Akamai's Great Guide</a> for Securing Your Server.</strong></p>\n<p>Always set up ssh key forwarding and use it. That said, I usually end up leaving Password Authentication Enabled, since I've had problems remoting in from a known machine (i.e. my laptop isn't available). In these cases I use a very strong password (Apple's Keychain app will make up to 31 character random passwords) and synced with iCloud so it's on my phone.</p>\n<p><strong>2. Set Up a Cloud Firewall</strong></p>\n<p>These days, I prefer using the cloud firewalls provided by the platform (here's a <a href=\"https://techdocs.akamai.com/cloud-computing/docs/getting-started-with-cloud-firewalls\">guide for setting this up on Linode</a>). I still do set up simple on-device firewalls on the server itself, but I depend more on the cloud firewall since it's easier to configure.</p>\n<p><strong>3. Configure Basic Maintenance Cronjobs</strong></p>\n<p>These days, I usually set up a few basic cron jobs to monitor things and keep things running. Here's a list of my typical cron jobs. This list will vary a bit depending on what kind of server you're setting up.</p>\n<ul>\n<li>Postgres nightly/weekly vacuum.</li>\n<li>Disk Usage &amp; Avg CPU Usage monitoring using <a href=\"https://nine9s.cloud/kb/measure-quickstart\">Nine9s Measures</a></li>\n<li>Nightly DB Backup &amp; Archive (if needed, see 4)</li>\n<li>Nightly <a href=\"https://unix.stackexchange.com/questions/139513/how-to-clear-journalctl#194058\">Log Trimming</a> (keep 30 days)</li>\n<li>Automatic Deploys (see 5)</li>\n</ul>\n<p>As an aside here, I use <a href=\"https://pushover.net\">Pushover</a> in a lot of my shell scripts. I send a quick API call to the service which forwards Push Notifications to my phone. That way I get notified of things like build failures which normally fail silently.</p>\n<p><strong>4. Set Up Automated Backups</strong></p>\n<p>If your platform supports it, just use the automated backups for your servers. It's so easy and well worth a few extra bucks per month. If you're not in the position to use those (e.g. Linode when wont't back up encrypted partitions), then make sure you have a cron job that backs up your database. I use simple <code>pgdump | gzip</code> commands in those cases.</p>\n<p>If you do the backups yourself, be sure to test <em>restoring from your backups as well!</em></p>\n<p><strong>5. Apps go in Containers</strong></p>\n<p>I use Docker, but any container system works. I've been told this setup isn't \"how Docker is intended to be used\", but that's fine with me. It works. I deploy my apps to my servers using a build script that usually runs automatically. It uses the production git repo for my docker compose files and runs a simple <code>docker compose up</code> with the configuration for production. I even have it set up to boot a backup copy of the current app while it deploys the new one so I get zero-downtime deployments.</p>\n<p>It's probably overkill to do this, but it works well and avoids the possibility of corrupting code files on the host machine. The automatic deploy (which I frequently do nightly) is awesome because it means I never have to think about which changes have made it to production. If it's in <code>main</code> it's in prod.</p>\n<p>I also run my databases (which is almost always Postgres) in a container as well, only because it makes minor upgrades easier.</p>\n<p><strong>6. Run Webservers on the Host</strong></p>\n<p>Above, I told you that I use Docker. However these days I always run the webserver (nginx in my case, though Caddy is also very nice) directly on the host. Nginx then proxy-passes to my my containers using the <a href=\"https://stackoverflow.com/a/20778887\">loopback address</a>. That way nothing is exposed (Docker likes to punch holes in firewalls). Running nginx on the host let's <code>certbot</code> work as expected.</p>\n<p><strong>7. Set Up Break-Glass Measures</strong></p>\n<p>The single most popular post on this blog is about my (in)famous <a href=\"https://brianschrader.com/archive/why-all-my-servers-have-an-8gb-empty-file/\">8GB Empty File</a> break-glass measure. I don't always do this anymore, but it has saved me a bunch of times. To me, SSH password auth is a kind of break-glass fallback too.</p>\n<h3>What Else?</h3>\n<p>That's all I can think of at the moment. It's a lot, but it's also not too bad. You don't need to be scared of hosting things yourself, but you do need to be careful. It's a wild world out there on the internet.</p>\n<p>As a final note, if you're looking to get a handle on web architecture stuff, I recommend this <a href=\"https://marco.org/2014/03/27/web-hosting-for-app-developers\">blog post</a> for a quick rundown on that. Practical Web Architecture is difficult to learn in my experience, and it takes a lot of pondering, trial, and error to do it right. Most resources are intended for enterprise-scale deployments and not smaller projects. In general, don't over-complicate things if you don't need to. One of the best parts about hosting your own apps this way is that you have the flexibility to change things around as you grow (at the cost of some work and likely some downtime).</p>\n<p>I've been doing this for a while now, but I'm sure there's something I've missed. This guide is certainly not extensive, but it should at least help you avoid some major headaches. I can say that from experience.</p>"}, {"id": "http://brianschrader.com/archive/the-joys-of-playing-live-music/", "url": "http://brianschrader.com/archive/the-joys-of-playing-live-music/", "title": "The Joys of Playing Live Music", "date_published": "2024-08-30T18:46:00", "tags": ["music"], "author": {"name": "Brian Schrader"}, "content_html": "<p>My band, <a href=\"https://thefourthsection.com\">The Fourth Section</a> has been playing more frequent shows lately and along side all of that we've been recording select songs and publishing them on YouTube.</p>\n<p>We're well on the way to another album (though the timing is very uncertain). That said though, it feels good to be able to share these live versions of some of our new music. We've even put together a <a href=\"https://www.youtube.com/playlist?list=PLno125jj5NexCAVxnXk8cKI6ZAvfH01p6\">playlist</a> of these edited versions which will continue to grow as we write and perform new material.</p>\n<div class=\"image-center\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/TpeQgpwBSlI?si=lP8ztEP9NJBW1Zo_\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div>\n\n<p>I've been playing in a band for nearly a decade now and while my love of writing and playing music has been a crucial release valve and creative outlet for me, one of the best parts of playing in a band is playing live. It's hard work, but it's so fulfilling.</p>\n<blockquote>\n<p>[For nearly all of human history] in order to hear a piece of music you had to be within earshot of someone playing it.<br />\n- John Green (vlogbrothers)</p>\n</blockquote>\n<p>Live music is something special. Unlike recorded music&mdash;which really hasn't been around all that long in human history&mdash;live music has been with us since the beginning. Regardless of form, there's something primal about being in a room where music is being played. It's a communal experience where a group of people sit and appreciate a thing together. Live music is where art meets mind.</p>\n<p>And it's not just bands. I'm always struck by just how captivating a solo artist with a guitar can be in a live performance. I love a good acoustic song, but there's something indescribable about being in the room that just can't be replicated by the best recording. A good acoustic song recording can make me feel things, but a good live performance can enthrall me; it can make time stop.</p>\n<p>Live music is one of many reminders that we are still very human. Even in this modern and increasingly disconnected world, we still need the same things that drove early humans in times long gone to pound a drum and sing together.</p>\n<p>There's tremendous beauty in that, I think.</p>"}, {"id": "http://brianschrader.com/archive/the-times-and-i-are-changing/", "url": "http://brianschrader.com/archive/the-times-and-i-are-changing/", "title": "The Times and I Are Changing", "date_published": "2024-06-09T04:51:00", "tags": ["personal"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Yesterday I went hiking at Lake Cuyamaca and took some pictures. Let's look at them as we discuss something I've been wanting to write for a long time.</p>\n<p><img\n    class=\"image-center\"\n    style=\"width: 750px;\"\n    alt=\"Geese on the Lake\"\n    src=\"/images/blog/Geese.png\"\n    height=\"500\"\n    width=\"750\"\n/></p>\n<h2>The Past</h2>\n<p>When this blog began in 2012 I was in the very early days of learning to code. In fact I built this site back then exactly for the purpose of teaching myself how websites (and the internet) actually worked. Back then I was in school to become an Aerospace Engineer (a subject I never really liked) and I found myself both excelling at and being interested in web development.</p>\n<p>For the next almost-decade I hopped between jobs, built several apps and services, joined a startup, founded more than one company, and worked as a contractor. Then, as go most stories in our present era: 2020 happened.</p>\n<p>It was a very strange time. I was unemployed for a while with nothing but my side projects to occupy my time. I built a bunch of new things&mdash;and even wrote a book about how to build things. I was perhaps the most productive developer I've ever been. To this day there are times when I wax nostalgic for those days (just without the 2020-current-events part).</p>\n<p>But when things finally settled down I found myself working full-time, finally, for my own company: SkyRocket Software, doing software contracting. I'm decent enough at the work that I suspect I'll be fine professionally for some time, but during all the 2020/21 craziness something changed. Not just with the world, but with me.</p>\n<p><img\n    class=\"image-right\"\n    style=\"width: 350px; margin-right: 0; padding-right: 0;\"\n    alt=\"Mustard Grass with a Mountain Behind\"\n    src=\"/images/blog/Mustard.png\"\n    height=\"525\"\n    width=\"350\"\n/></p>\n<h2>The Present</h2>\n<p>My thirties came and with that my interests began to shift dramatically. I still love coding and I still do it for a living, but it's not something I obsess over anymore. It's not something I want to do much outside of work (though this isn't universally true). I still run my own servers and all that, but I've stopped dreaming up new projects and instead I've begun to consider shutting most of my existing ones down. As time has gone on I've even found that I care less and less about tech in general. I still exist within this world, but I don't feel anymore that I live <em>in</em> it. As well I feel the industry has drifted away from the things I'm personally interested in&mdash;or I'm just getting cranky and old. <code>¯\\_(ツ)_/¯</code></p>\n<p>Either way something has changed.</p>\n<p>These days I'm far more interested in reading, writing, and music than coding. I <a href=\"/archive/reading-report/\">read more books</a> now than I have at any point in my life and I write a lot as well (yes <a href=\"/archive/more-on-handwriting-amp-cursive/\">by hand</a>). In part this change hasn't been reflected much in this blog because I haven't wanted to write this very post explaining the shift. This is that attempt.</p>\n<p>I've spent a fair bit of time over these past four or five years now thinking about this experience I've had, and I've kept coming back to one particular method of describing what I mean when I say something has changed.</p>\n<p>In short, when I think about myself and what I call myself that definition has changed. I used to say I was a software developer who did a bunch of other stuff too. These days, I don't much <em>feel</em> like a developer. I still am of course, but I don't see myself through that lens anymore. My self-conception has changed.</p>\n<h2>The Future</h2>\n<p>This blog has always been a general-purpose place where I could write about anything that interests me, but it's always had a technical bent. That is very likely to change in the months and years to come. I have a lot of things on my mind (and a few new projects I'm working on) and while some of those are tech-related, most are not&mdash;as such the subject matter on this blog is going to reflect that shift.<sup>1</sup></p>\n<p>I hope everyone reading this will stick around and see what's coming. I'm very excited about the future and I'm excited to have a space here where I'll be more willing to write about the things I'm doing these days. It should be fun.</p>\n<p>🚀</p>\n<div class=\"footnote\">\n    <sup>1</sup>If you follow my Mastodon account, you've seen a preview of what's coming.\n</div>"}, {"id": "http://brianschrader.com/archive/podcasts-the-universe-and-everything/", "url": "http://brianschrader.com/archive/podcasts-the-universe-and-everything/", "title": "Podcasts, the Universe, and Everything", "date_published": "2024-04-27T19:01:00", "tags": ["podcasts", ""], "author": {"name": "Brian Schrader"}, "content_html": "<p>Recently, John Green announced a now-released podcast, <a href=\"https://crash-course-pods-the-universe.simplecast.com\">The Universe</a> hosted by himself and Dr. Katie Mack, which attempts to detail the entire history, present, and future of our universe as we currently understand it. While I haven't listened to the podcast beyond the trailer, I am confident it will be quite good. But that isn't really what I wanted to talk about here.</p>\n<p>Instead I wanted to talk about how the trailer for that podcast reminded me of my own journey with the topic of Astronomy and Astrophysics.</p>\n<p>As a teenager, I spent a fair bit of time in my school library doing one of three things:</p>\n<ol>\n<li>Playing games on the library computers on whatever sites were as-of-yet undiscovered (read unblocked) by the IT admin.<sup>1</sup></li>\n<li>Reading fantasy (see <a href=\"/archive/novels-and-insurmountable-tasks/\">Ursula Le Guin's Earthsea Series</a>).</li>\n<li>Trying to read whatever I could to answer what I thought was a pretty simple question.</li>\n</ol>\n<h2>What is Time?</h2>\n<p>Why I was trying to answer this question is lot to my memory, but if I recall correctly the Doctor Who episode Blink came out around that time with its famous \"<a href=\"https://www.youtube.com/watch?v=q2nNzNo_Xps\">wibbly wobbly</a>\" description of time. And Doctor Who was my jam at the time.</p>\n<p>Einstein famously quipped: \"time is what clocks measure\". Which is delightfully unhelpful to the philosophically inclined.</p>\n<p>To answer this question I read whatever I could find on the subject including Steven Hawking's <em>A Brief History of Time</em>, <em>The Universe in a Nutshell</em>, and others. Most of what I read went over my head as you'd expect for a teenager reading books on Theoretical Physics, but books like ABHoT lead me eventually to Astronomy. Perhaps if I was going to undertand Time, I needed to understand how it began.</p>\n<h2>Introduction to Stars, Galaxies, &amp; the Universe</h2>\n<p>I don't remember exactly how, but eventually I stumbled on the medium of Podcasts and specifically a podcast by Professor Richard Pogge at Ohio State University called <a href=\"https://www.astronomy.ohio-state.edu/pogge.1/Ast162/Audio/\">Astronomy 162</a>. The podcast is effectively just the lectures for that class which Pogge describes as astronomy for non-science majors. In other words, it's an overview without all the math. A perfect find!</p>\n<p>I listened to that podcast (and it's predecessor Astronomy 161) over and over again in order to extract the maximum amount of information from them. I can recall sitting in the backyard of my parent's house for hours devouring these episodes. In particular, the episode that fascinated me the most (and which is the subject of the first episode of <a href=\"https://crash-course-pods-the-universe.simplecast.com\">The Universe</a>) is titled, <em>The First Three Minutes</em>.</p>\n<p>I'd recommend that episode today for anyone who is curious about astronomy. The whole series of lectures is very approachable and understandable to anyone, and but <em>The First Three Minutes</em> is what truly gripped me. As many of my friends know, I <em>love</em> things like that.</p>\n<h2>An Aside</h2>\n<p>I remember discovering other podcasts by similarly forward-thinking professors and those podcasts both indulged my curiosity and augmented my own college education later on.</p>\n<p>The Internet serving to make more college-level content available to the general public has been one of the coolest things to see happen in recent decades. And it was through podcasting that I also discovered the excellent show <a href=\"https://writingexcuses.com\"><em>Writing Excuses</em></a> which taught me so much about the craft of writing and continues to be a show I go back to when I need help.</p>\n<h2>Bringing it Back</h2>\n<p>The release of <a href=\"https://crash-course-pods-the-universe.simplecast.com\">The Universe</a> by John Green and Dr. Katie Mack has put me in a bit of a reminiscent mood. I'm thrilled to see a new show attempt to capture the next generation of curious minds and I hope those who listen to it find what I did in Professor Pogge's podcast nearly two decades ago. That podcast was ultimately the reason I wanted to study Astrophysics in college&mdash;something I later abandoned to study Aerospace Engineering which turned out to be decidedly less interesting to me&mdash;and to this day I am still very interested in Astronomy and Physics.</p>\n<p>In a way, perhaps I can credit Doctor Who, Professor Pogge, Steven Hawking, and being a 6th period Library Assistant for the path I eventually took and for kindling the ongoing desire for learning that I keep to this today.</p>\n<p>I'm not sure, but it's been fun to think about. What I can be sure of is that podcasts are incredible.</p>\n<div class=\"footnote\">\n    <sup>1</sup> Including a really cool 3D, Halo-esq, capture the flag game that only seems more impressive the more I think about such a thing running in a web browser on a candy-shell iMac in 2007.\n</div>"}]}