{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "http://brianschrader.com/archive/stargazing-pictures/", "url": "http://brianschrader.com/archive/stargazing-pictures/", "title": "Stargazing Pictures", "date_published": "2022-09-04T17:21:00", "tags": ["photography", "space"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Last night I went stargazing with a few friends, and while the weather did conspire against us we did get a few good chances to see the stars through a friend's telescope. The photos through the telescope are no where near as good as the actual sights, but that's largely because we didn't bring any camera equipment. With time, practice, and proper gear, we'd likely have done a lot better. That said, w e also took some pictures just with our phones and the results were a lot more impressive than any of us expected.</p>\n<p><img\n    alt=\"A shot of stars through the lens of a telescope\"\n    class=\"image-center\"\n    style=\"max-width: 350px;\"\n    src=\"/images/blog/telescope-stars.jpeg\"\n/>\n<center><small>\n    This is the best shot I could get through the telescope eyepiece with my phone. The actual view was great, but the pictures: not so much.\n</small></center></p>\n<div style=\"display:flex; justify-content:center; flex-wrap:wrap;\">\n\n    <div style=\"flex:1;\">\n        <img\n            alt=\"A shot of a starfield and clouds through my iphone camera\"\n            style=\"min-width: 200px;\"\n            class=\"image-center\"\n            src=\"/images/blog/star-field.jpeg\"\n        />\n        <center><small>\n            A shot of the night sky with just my iPhone on a 10-second exposure.\n        </small></center>\n    </div>\n    <div style=\"flex:1;\">\n        <img\n            alt=\"Another shot of a starfield and clouds through my iphone camera\"\n            class=\"image-center\"\n            style=\"min-width: 200px;\"\n            src=\"/images/blog/star-field-2.jpeg\"\n        />\n        <center><small>\n            Turns out that the cameras on our phones are very, very good.\n        </small></center>\n    </div>\n</div>"}, {"id": "http://brianschrader.com/archive/step-counts-and-goal-setting/", "url": "http://brianschrader.com/archive/step-counts-and-goal-setting/", "title": "Step Counts and Goal-Setting", "date_published": "2022-08-29T23:13:00", "tags": ["programming", "ios", "productivity", ""], "author": {"name": "Brian Schrader"}, "content_html": "<p>In yet more at-home-data-science, I recently decided to take a look at my step count history and see what insights I could gain from visualizing the data. I've been using <a href=\"https://pedometer.app\">Pedometer++</a> to track my daily step count since 2014 and the app conveniently provides a CSV export of all of your daily step totals as well as other related data like distance and floors climbed. I think the results of my investigation are pretty interesting and yield some important insights.</p>\n<p>First off, I simply plotted the entire data set to see what it showed. There were three things I noticed immediately.</p>\n<p><a href=\"https://gist.github.com/Sonictherocketman/54ac8666460ec5c121f9d5da1ab139c2\"><img alt=\"A chart generated by an R Script that plots my step count since 2014\" src=\"/images/blog/step-counts-all-time.png\" /></a></p>\n<ol>\n<li>\n<p>Lossy Data:<br />You may notice that there are several holes in the data. This is because originally, I used Pedometer++ very infrequently. I didn't set a daily goal and I didn't open the app very often. This meant that &mdash; after a while &mdash; iOS stopped launching the app in the background to collect step data and at one point offloaded the app from my phone to free space.</p>\n</li>\n<li>\n<p>Two Very Tall Spikes:<br />I love seeing immediately identifiable trends in data, and those two spikes intrigued me. The first is my <a href=\"/archive/hiking-the-pacific-crest-trail/\">hike along a section of the PCT</a> and the other is my trip to Barcelona and Paris in 2019.</p>\n</li>\n<li>\n<p>A Sudden Section of Stability:<br />This third section is probably the most interesting for our purposes here. During 2021 I decided to start taking my daily walks more seriously. I'd been going on at least one walk per day, but I finally decided to <b>start setting a goal</b> and trying to meet it every single day.</p>\n</li>\n</ol>\n<p>You may also notice the red lines at the bottom of the chart: these are any string of days during which I exceeded my goal (more on that soon). The brown line is the daily goal value itself.</p>\n<h3>Setting Attainable Goals</h3>\n<p>I've talked <a href=\"/archive/arbitrary-achievement-unlocked/\">before about how I set arbitrary deadlines and goals for myself</a>. Usually this is done for client projects or my own apps, but importantly it's a thing I do for personal goals too. In the post I wrote this:</p>\n<blockquote>\n<p>I create artificial deadlines and goals, <strong>sometimes completely arbitrarily</strong>. Often times, I'll just pick a date on the calendar based on nothing but gut intuition, and then I change it later if necessary.</p>\n</blockquote>\n<p>Back in 2021 I wanted to get more rigorous with my daily walks. I wanted to set a goal for myself and make sure I was meeting it as often as possible. This is important. Originally I had considered trying to meet the default in-app goal of 10,000 steps per day. This is a very common step goal for apps and services to suggest because it's a nice, big, round number. But I didn't do that. I went with a much more modest 6,000 steps as my goal.</p>\n<p>The reason for this is simple. Like I said I wanted to meet this goal as often as possible &mdash; preferably every day. 10,000 steps is a lot to cram into a single day. I routinely surpass 10,000 but I am nowhere close to hitting it every day.</p>\n<p>This goal-setting <a href=\"/archive/unbounded-possibility-is-bad-for-productivity/\">is important</a>. Meeting a goal can be inspiring, but <i>not meeting it</i> is the opposite, and can be disincentivizing. With a goal too high it can be preferable to give up early rather than to try and fail. This runs counter to my goal: walk more. Giving up is bad, and so I wanted to minimize the amount of times I do it. 6,000 steps has been a good number for me because I routinely find myself around 1,000 steps short in the evening, which <i>incentivizes me</i> to go for a walk, which is what I want. And in a positive development, I ended up raising the goal in 2022 to 6,500 steps!</p>\n<h3>Additional Insights</h3>\n<p>What's perhaps most interesting to me is what happens when we zoom in on the 2021-2022 section of the data (after I set a daily step goal). Not only does the data become much more consistent because I checked the app daily, but it becomes incredibly regular. The 30-day rolling average (plotted in green) is very close to the daily goal, which implies that if we ignore the extreme days I'm pretty good at meeting my goals. The red streak line at the bottom also helps illustrate this.</p>\n<p><a href=\"https://gist.github.com/Sonictherocketman/54ac8666460ec5c121f9d5da1ab139c2\"><img alt=\"A chart generated by an R Script that plots my step count since mid-2021\" src=\"/images/blog/step-counts-2022.png\" /></a></p>\n<p>I also notice that my rolling average is down this year which is something I wasn't expecting! If it continues like this I will be missing my goal regularly, which is bad. Insights like this have helped motivate me to improve and stay on top of my walking schedule.</p>\n<p>If there's one thing I can share from this little experiment, it's this: set arbitrary goals, then celebrate once you've hit them.</p>"}, {"id": "http://brianschrader.com/archive/fun-with-math-calculating-multiplicative-persistence/", "url": "http://brianschrader.com/archive/fun-with-math-calculating-multiplicative-persistence/", "title": "Fun with Math: Calculating Multiplicative Persistence", "date_published": "2022-08-28T23:27:00", "tags": ["programming", "tools", "python", "software"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I mentioned recently that one of my Raspberry Pis is mounted under my desk <a href=\"/archive/whether-to-monitor-the-weather-and-more/\">and tracking the weather</a>, and I've written other times about the <a href=\"/archive/building-a-personalized-newsletter-with-bash-and-a-raspberry-pi/\">other tasks</a> this helpful little assistant handles for me. Today I'd like to discuss yet <em>another</em> thing that little RPi does all day &mdash; something I've been pretty excited about for some time.</p>\n<p>But first we need to talk about a thing called Multiplicative Persistence.</p>\n<h3>What is that?</h3>\n<p>Put very simply, Multiplicative Persistence is a little number trick you can play with integers. Here's how it works:</p>\n<ol>\n<li>Take any number</li>\n<li>Multiple the digits of the number together</li>\n<li>If this number is greater than 9, do it again. Counting the number of times you do the process.<pre><code>467 -&gt; 4 x 6 x 7 = 168 (1)\n168 -&gt; 1 x 6 x 8 = 48  (2)\n48  -&gt; 4 x 8     = 32  (3)\n32  -&gt; 3 x 2     = 6   (4)\n</code></pre>\n</li>\n</ol>\n<p><b>Result:</b> 467 has a multiplicative persistence of 4</p>\n<p>The goal is to find the smallest number with the greatest persistence value. The current largest persistence ever found is 11 and the smallest number is 277777788888899.</p>\n<p><a href=\"https://www.youtube.com/watch?v=Wim9WJeDTHQ\"><img alt=\"What's special about 277777788888899? - Numberphile\" src=\"/images/blog/222777-mp.jpg\" /></a>\n<center><small>You can learn more about Multiplicative Persistence by watching this great video from Numberphile.</small></center></p>\n<h3>What does this have to do with my Raspberry Pi?</h3>\n<p>I thought it would be fun to write a little script to calculate the known values with the smallest persistences. There are lots of little tricks you can do to speed up your script (so that you don't have to check every single value), and it was a fun little evening project. Then in June I swapped out the script for a new version that used more of the RPi's cores to speed things up a bit.</p>\n<p>The script has been running (nearly) continuously <strong>since February</strong>, and by my estimates it will reach the current largest persistence value by the end of the year.</p>\n<p>The script sends me a push notification (via <a href=\"/archive/using-pushover-for-super-simple-sysadmin-alerts/\">Pushover</a>) whenever it reaches a new persistence value &mdash; which is very exciting. I can't wait to get the next notification because that will mean the script has fulfilled its purpose: finding the largest known value.</p>\n<h3>Next Steps</h3>\n<p>For no reason whatsoever, after the script reaches the current largest known value I'm going to turn it loose on some truly enormous numbers to see if it can find the next largest value.</p>\n<p>Currently it is theorized that 11 is the largest persistence possible (among all base 10 integers), and according to Matt Parker (in the video) mathematicians have already checked every value with less than <strong>233 digits</strong><sup>1</sup>, but still there are a lot more numbers to check.</p>\n<p>Why? Because it's fun.<sup>2</sup></p>\n<p><a href=\"https://gist.github.com/Sonictherocketman/49361941c730b31fe5b822d8bbb1d945\">Check out the code here &#8594;</a></p>\n<div class=\"footnote\" style=\"word-wrap: anywhere;\">\n<p><sup>1</sup> That's a number that looks like this: <br />\n17,944,722,797,467,451,413,885,553,670,907,289,754,932,820,893,589,746,032,750,117,948,680,440,041,708,054,016,996,924,802,613,696,647,178,385,842,833,715,379,727,704,254,519,961,954,721,643,715,078,484,056,283,131,636,661,502,157,729,434,338,946,533,866,675,014,605,168,434,933,154,729,236,329,910,303,053,227</p>\n<p><sup>2</sup> Because of some local changes to where San Diego's power comes from, all this computation is powered by 100% clean and renewable energy, so I don't feel bad wasting this (admittedly minute) power for nonsense like this.</p>\n</div>"}, {"id": "http://brianschrader.com/archive/whether-to-monitor-the-weather-and-more/", "url": "http://brianschrader.com/archive/whether-to-monitor-the-weather-and-more/", "title": "Whether to Monitor the Weather and More", "date_published": "2022-08-16T22:59:00", "tags": ["programming", "python"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Things have been awfully quiet here for the past few months. Lots of other <a href=\"/archive/the-simple-joy-of-learning-to-play-piano/\">side</a> <a href=\"/archive/bibliography\">projects</a> have been taking up my time lately and I haven't felt the need to blog much. I have been doing a lot of reading and writing though and I will hopefully write something about all that stuff soon. For now though, I thought I'd talk about a little side project I've had running for the last half-year.</p>\n<p>I have a Raspberry Pi bolted to the bottom of my desk. It's name is Demin<sup>1</sup> and it does all kinds of useful things for me. One of those things is collecting the current ambient temperature and atmospheric pressure in the room. Originally I intended to chart this data and see if it correlates with me having random headaches. I'd always heard that pressure changes can cause headaches, but I'd never tested the theory myself. Luckily (and unluckily) my headache sample-set this year is far too small to use to reasonably answer this question, but that doesn't mean that Demin's work is all for naught!</p>\n<figure class=\"text-center\">\n<img class=\"image-center\" alt=\"My Personal Assistant\" src=\"/images/blog/demin.jpg\" />\n<figcaption><small>Demin at work. That's the sensor hanging off the top</small></figcaption>\n</figure>\n\n<p>Using a mixture of R, Python, bash, and a SQLite database I've been recording, tracking, and publishing this data for the past several months on an personal website on my local network. But since the data is very cool looking, I figured I'd post the full chart here. I've also uploaded a <a href=\"https://gist.github.com/Sonictherocketman/ddf3315eaf9c979bf7341400359722ec#file-take-reading-py\">gist of the code I use to collect the sensor measurements</a>. The script has a small bash wrapper script that is run via cron job which collects new measurements every five minutes. I've also set up a CGI script (yeah really) that allows me to see the most recent measurements from any device on my local network.</p>\n<figure class=\"text-center\">\n<img class=\"image-center\" alt=\"My Weather History\" src=\"/images/blog/readings.jpg\" />\n<figcaption><small>The last several months of data. Notice the unseasonably cool July temperatures. Very interesting.</small></figcaption>\n</figure>\n\n<p>As I've said <a href=\"/archive/take-a-break-script-something/\">before</a>, I love doing the odd bit of scripting to automate menial work. I <em>could have</em> just bought a small indoor weather station, but that wouldn't provide me with programatic access to either real-time or historical data. Plus putting this whole thing together was half the fun anyway.</p>\n<div class=\"footnote\">\n    <sup>1.</sup> Demin is named after the ship's first mate in one of my D&amp;D games. He was a very good first mate and he's a very helpful little computer too.\n</div>"}, {"id": "http://brianschrader.com/archive/the-simple-joy-of-learning-to-play-piano/", "url": "http://brianschrader.com/archive/the-simple-joy-of-learning-to-play-piano/", "title": "The Simple Joy of Learning to Play Piano", "date_published": "2022-05-05T01:41:00", "tags": ["music"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Back in January, I started to teach myself how to play piano. I'd played before when I was a kid &mdash; like many people do &mdash; but I was never very good and it didn't stick once I'd stopped taking lessons. I'd had a keyboard for years, stowed away at my parent's place, but I'd rarely ever used it. I had occasionally tried to pick up piano over the years, but just like when I was a kid: it didn't stick.</p>\n<p><img\n    alt=\"My paino setup\"\n    src=\"/images/blog/piano.jpg\"\n    style=\"height:auto;width:320px;\"\n    class=\"image-right\"\n/></p>\n<p>This time with the keyboard visible, and in the center of the room, I hoped things would be different. It's been almost four months now, and I am happy to report that I am still practicing and importantly: I'm getting better!</p>\n<p>Luckily, I have some music theory under my belt, and I've played guitar, both <a href=\"https://sonicrocketman.bandcamp.com\">solo</a> and <a href=\"https://thefourthsection.com\">in bands</a> for years, so I know my way around musically. That said, neither of those skills prepare you to actually play the piano. It helps to know where middle C is and how to make a chord, but neither of those skills help you contort your hands to actually play the notes and chords you want.</p>\n<p>That said, I do have two tips that I'd like to share.</p>\n<h3>Set Simple Goals, Then Iterate</h3>\n<p>Back in January, I tried to start by simply practicing scales. You know? The thing everyone hates? Well, it turns out they're super useful.</p>\n<p>I started with a simple 5-note scale. I played it over and over again: up the scale and back down as smoothly as possible, one hand at a time. Then I would move it up a key and repeat the process. Not all keys are beginner friendly, so I would often skip complicated keys and stick to the easy ones. Once I had that down I started adding in a few little flairs. Instead of just playing the scales I would keep the time and tempo, but work in a few extra notes or I would start at the root and work up, but on the way back down I'd end on the 5th instead of the root. Little changes.</p>\n<p>When something is difficult it can be pretty demoralizing if you can't see yourself making progress. That's where small goals come in. Each time I'd sit down to practice (and after a short warm up) I would set a small goal for myself. Sometimes the goal would be so minor that it would hardly seem worthwhile, but I always tried to explicitly set a tangible goal.</p>\n<p>It's a slow process, but I am getting measurably better and I can see the results each and every time I sit down to play.</p>\n<h3>Don't Put it Away</h3>\n<p>I learned how to play guitar in high school and while my teacher gave me lots of advice, one thing he said always stuck with me. It was advice about how to make sure you keep practicing.</p>\n<blockquote>\n<p>Never put your guitar away, and keep it within reach. That way you can play it whenever you have even a little bit of downtime. Play it while your computer is loading, while you're waiting for a text message, or even while you're watching a video. You don't need to play a song. Even just strumming a chord, or picking a melody can help.</p>\n<p>Those little moments of practice add up.</p>\n</blockquote>\n<p>To this day my guitar is within arms reach of my desk, and I play it when I need a break, when I need to think, or even just when I'm bored.</p>\n<p>I feel the same idea has helped me learn piano. The keyboard is in the middle of my living room. I have to walk past it to get water, and whenever I do I think about playing. Often times I will play before or after eating, even just for a few minutes.</p>\n<p>The little moments really do add up.</p>"}, {"id": "http://brianschrader.com/archive/using-pushover-for-super-simple-sysadmin-alerts/", "url": "http://brianschrader.com/archive/using-pushover-for-super-simple-sysadmin-alerts/", "title": "Using Pushover for Super Simple SysAdmin Alerts", "date_published": "2022-04-27T23:36:00", "tags": ["programming", "software development"], "author": {"name": "Brian Schrader"}, "content_html": "<p>For those who don't know, <a href=\"https://pushover.net\">Pushover</a> is a really great tool that allows users to easily set up and send push notifications to a smartphone. The setup is super simple, and all you need is their app and a little scripting know-how.</p>\n<p>I've used Pushover for years to help me monitor my apps and services, and over the years my uses for Pushover have evolved and grown more and more integral to my ability to keep track of the various apps I run. To me, Pushover has gone from a nice-to-have integration to an absolute necessity.</p>\n<p>I use Pushover to alert me of all kinds of things. Just to give you an idea, here are a few examples of some of the things I currently use Pushover for:</p>\n<ul>\n<li>Potential queue backups in <a href=\"https://pine.blog\">Pine.blog</a></li>\n<li>Reporting daily user signups for <a href=\"https://nine9s.cloud\">Nine9s</a></li>\n<li>Alerts when critical background jobs fail</li>\n<li>Alerts when nightly builds fail to deploy</li>\n<li>Alerts when a manually-run, long-running job completes</li>\n</ul>\n<p>Because Pushover is so easy to integrate with basically any codebase (and even one-off shell scripts) I use it all the time for everything from simple alerts to complex and critical reports.</p>\n<p>One particular use I'd like to call out from that list above is the nightly build alerts. <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> has a test environment that we use to sanity check our code before a full deploy. We used to have the test environment redeploy after every single merged pull request, but that system proved incredibly fickle and error prone, so we switched to a simple nightly build. The issue with any automatic build system is that unless you have a detailed live dashboard of deployment statuses (which we do not) it's hard to know if/when a given build has finished deploying or if it encountered an error. That's where Pushover comes in.</p>\n<details><summary>Nightly Build and Deploy Script</summary>\n<hr />\n<p>This script runs as a cron job every night. It attempts to deploy the latest version of the application and if that fails it sends a notification to Pushover.</p>\n<code><pre>PUSHOVER_USER=\"xxxx\"\nPUSHOVER_KEY=\"xxx\"\nPUSHOVER_URL=\"https://api.pushover.net/1/messages.json\"\n\nTITLE=\"AC Nightly: Build Failed to Deploy\"\nMESSAGE=\"The latest build on Nightly has failed.\"\n\nlog() {\n  echo \"[$(date)] $@\";\n}\n\nalert_admins() {\n  curl -X POST $PUSHOVER_URL \\\n    -H \"Content-Type: application/json\" \\\n    -d \"{\\\"title\\\": \\\"$TITLE\\\", \\\"message\\\": \\\"$MESSAGE\\\", \\\n        \\\"user\\\": \\\"$PUSHOVER_USER\\\", \\\"token\\\": \\\"$PUSHOVER_KEY\\\"}\"\n}\n\n./docker-bootstrap.sh upgrade --env nightly\nSTATUS=$?\n\nif [ $STATUS -eq 0 ]; then\n  log \"🚀 Build completed successfully!\"\nelse\n  log \"Uh oh. There was an issue. Alert the admins!\"\n  alert_admins\nfi</pre></code>\n</details>\n\n<p>My nightly build script for Adventurer's Codex includes a section after the deployment has completed that checkes the status code of the deploy command and if it is not 0 (i.e. it failed) then it sends me a notification. Bam! Now, every morning that I don't get a notification, I know things are working as intended. If I ever wake up to a notification, then I know I have work to do.</p>\n<h3>What Happens in the Background is Ignored in the Background</h3>\n<p>Crucially, I use Pushover to alert me about problems with background tasks. Modern web apps include lots of always-running or periodic asynchronous behavior, and because &mdash; when they fail &mdash; they don't directly result in user feedback or a big, loud error page mistakes, bottlenecks, and bugs often go unnoticed or unaccounted for.</p>\n<p>Pushover solves those issues. It's trivial to write code that checks for bad behavior or that catches difficult-to-reach-but-critical bugs and just send off a notification.</p>\n<p>I used to use email for this sort of thing, and while email is still a good solution, the setup is actually more involved. Most VPSs aren't allowed to send emails directly anymore (due to concerns over spam) and configuring an email provider is just as much work if not slightly more work than using Pushover. In some cases email is more flexible and might be better for larger teams, but I almost always reach for Pushover these days instead of email.</p>\n<p>It's just that good.</p>"}, {"id": "http://brianschrader.com/archive/crossing-the-wording-threshold/", "url": "http://brianschrader.com/archive/crossing-the-wording-threshold/", "title": "Crossing the Wording Threshold", "date_published": "2022-04-27T03:07:00", "tags": ["meta", "blogging", "stats"], "author": {"name": "Brian Schrader"}, "content_html": "<p>A few years ago, I wrote <a href=\"/archive/so-many-words-written-so-many-more-to-come/\">a post</a> about the number of words this blog contained. Well, that was then; this is now, and those counts have changed pretty drastically in the intervening time.</p>\n<p>Using the same method as before, I can now report that this blog contains just over 100,000 words spread across 270 posts! A pretty significant achievement.</p>\n<pre><code>$ find archive/ -name \"*.md\"|xargs -I {} cat {} | wc -w\n  101042\n</code></pre>\n<p>I also remade the previous graph for comparison.</p>\n<p><img alt=\"A histogram of the binned words per post\" src=\"/images/blog/words-per-post-2.png\" /></p>\n<p>It seems like I've written more 300-400 word posts than before which explains the smoothing out in the middle section of the chart.</p>\n<p>For those keeping score at home, the new longest post is <a href=\"/archive/mygenerank-behind-the-scenes-of-the-newest-researchkit-app/\">this one</a> from 2017.</p>\n<h3>A Terrifying Realization</h3>\n<p>It occurred to me that my last post about this topic was back in 2017&mdash;5 years ago!&mdash;and that means I'm very quickly approaching my 10 year blogging anniversary.<sup>1</sup> It's hard to believe it's been so long, but I guess it has.</p>\n<p>The first post on this site was back in December of 2012, which is just months away. I'll save the reminiscing for the retrospective post, but for now I'll just admit that it's a lovely coincidence that I reached 100,000 words on my 10 year anniversary.</p>\n<div class=\"footnote\">\n<sup>1</sup> If you count my first two blogs (which are now gone from the web) it has already been ten years, but let's not do that.\n</div>"}, {"id": "http://brianschrader.com/archive/that-time-i-lost-control-of-a-server/", "url": "http://brianschrader.com/archive/that-time-i-lost-control-of-a-server/", "title": "That Time I Lost Control of a Server", "date_published": "2022-04-19T00:10:00", "tags": ["software development"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Good security hygiene is essential for software developers. The thing is: we tell ourselves that, but rarely ever do we actually experience the effects of bad security hygiene. While deterrence is the point of good hygiene, it's helpful to walk through the real world consequences of bad hygiene and not just talk about the theoretical side of things.</p>\n<p>So let's talk about the time one of my servers was hijacked.</p>\n<details open><summary>Disclaimer</summary>\n<hr />\nRight off the bat I need to note that the server in this story was not connected to any product or service that my company, <a href=\"https://skyrocket.software\" title=\"SkyRocket Software\">SkyRocket Software</a>, runs. This was a personal toy server that had no connection with anything I make or sell.\n</details>\n\n<h3>The Story</h3>\n<p>I've run servers for lots of projects over the years. I manage servers for <a href=\"https://pine.blog\">Pine.blog</a>, <a href=\"https://nine9s.cloud\">Nine9.cloud</a>, <a href=\"https://d20.photos\">d20.photos</a>, and <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a>. I also run several servers for client projects, this blog, and for toy projects. One of those toy projects is a server for an annual holiday Minecraft extravaganza with some friends of mine.</p>\n<p>Once long ago, I was going through the process of setting up a new Minecraft server (this was before Linode provided easy-to-deploy Minecraft servers). I wanted to set up the server before going out that evening, and so I was in a bit of a rush. Being in a rush, I didn't bother to set up the server according to Linode's excellent guide on <a href=\"https://www.linode.com/docs/guides/set-up-and-secure/\">Securing Your Server</a>. Instead, I just set a <del>short</del> trivially guessable root password, logged in as root, and got to installing Minecraft.</p>\n<p>About halfway through the process I needed to leave, so I disconnected from the server and went to dinner.</p>\n<p>When I returned home that night, I found an email in my inbox from Linode telling me that my server had been forcibly shut down because they'd determined that it was being used to send spam emails and help DDOS another site.</p>\n<p>I had been gone only about three hours, but it had taken <strong>less than one hour</strong> from when my server had been instantiated to when it was compromised. It had happened shortly after I'd logged out.</p>\n<p>Immediately I felt terrible for falling victim to such a simple, brute-force attack, and the experience has been one of those that makes me appreciate the often painful security hoops we sometimes need to jump through as developers.</p>\n<h3>Lessons Learned</h3>\n<p>Having fallen prey to what was likely a simple brute-force attack on my root account, I promised myself that I would never again fall prey to such an attack. Now, whenever I set up a server I always set aside plenty of time to do so, use long and complex passwords, disable root logins over SSH, and follow <a href=\"https://www.linode.com/docs/guides/set-up-and-secure/\">that Linode guide</a> I mentioned earlier. Other experiences, like those with spambots, have made me more cautious and careful about the functionality my sites expose and how they expose it (Pine.blog doesn't offer free blogging &amp; image uploads for a reason).</p>\n<p><img src=\"/images/blog/keychain-access.png\" alt=\"Keychain can generate long passwords easily\" style=\"padding:0;margin:auto;\" />\n<caption><center><small>Keychain can generate long passwords easily, though I wish it could make even longer ones.</small></center></caption></p>\n<p>All in all, I count myself unlucky that I had to learn my lesson this way, but I count myself very lucky that I learned it by losing control of an unimportant and trivially replaceable server.</p>\n<p>The internet is a very hostile place to those who aren't prepared for it. This is true on a societal level, and on a technical one. If you ever need a reminder of just how dangerous it is, try having <a href=\"https://www.linode.com/docs/guides/using-fail2ban-to-secure-your-server-a-tutorial/\">Fail2Ban</a> email you whenever it blocks a hostile IP address or watch your access logs for bots trying to break into your site (usually using maliciously crafted Wordpress/Drupal URLS). Things like that happen all day, every day; we just don't usually see them.</p>\n<p>Anyway, that's the story. Hopefully everyone reading this takes it to heart so that this story remains but a cautionary tale and nothing more.</p>"}, {"id": "http://brianschrader.com/archive/hacks-can-be-good-code-too/", "url": "http://brianschrader.com/archive/hacks-can-be-good-code-too/", "title": "Hacks can be Good Code Too", "date_published": "2022-03-21T21:45:00", "tags": ["programming", "software development"], "author": {"name": "Brian Schrader"}, "content_html": "<style>\ntable {\n    width: 100%;\n}\ntable td {\n    padding: 2px;\n    padding-right: 1.5rem;\n}\ntable tr td:last-child {\n    padding: 0;\n}\n</style>\n\n<p>Writing code is, like everything in life, all about making tradeoffs. Code can be quick to write, but at the same time unreadable; it can be fast, but hard to maintain; and it can be flexible, but overly complex. Each of these factors are worth considering when writing Good Code. Complicating this is the fact that: what constitutes Good Code in one situation may not be ideal in another.</p>\n<p>Good Code is not universally so.</p>\n<p>It is incredibly difficult to explain why one set of tradeoffs are worth pursuing in one case but not in another, and often times reasonable people will disagree on the value of certain tradeoffs over others. Perhaps a snippet of hacky string parsing is good in one place, but not in another. Often times, the most significant cost of solving a problem \"The Right Way\" is time.</p>\n<p>When deciding whether to do something The Right Way or to cheat and simply hack something together, I often try to consider the exposure the given code will have. Consider these questions:</p>\n<ul>\n<li>Do other systems touch this code?</li>\n<li>How many developers will need to interact with it over time?</li>\n<li>How much work would be involved in building out the correct approach?</li>\n<li>How much work would be involved in building out the bad approach?</li>\n<li>How valuable is the intended feature?</li>\n<li>How much additional maintenance does the bad solution require?</li>\n</ul>\n<p>Each of these answers helps me decide what kind of code I should write. These questions neglect multiple other factors (e.g. performance, readability), but they are a good starting point.</p>\n<p>In a recent example I needed to modify the blog engine that powers this site as well as a few others. I wanted a simple feature that would count the number of articles on the side as well as the total number of words in every blog post, and display those values on the home page. <a href=\"/archive/the-new-new-cms/\">As I've said before</a> the blog engine for this site is very old, and has been <a href=\"/archive/smaller/\">rewritten</a> <a href=\"/archive/rewritten/\">several</a> <a href=\"/archive/thinking-about-redoing-my-blog-engine/\">times</a>. It's well beyond needing a massive rewrite, but that's not something I really want to do right now.</p>\n<p>The blog engine is written in Python, provides a command-line interface, and uses Git Hooks both client and server-side to build and deploy itself.</p>\n<p>I originally considered writing this feature in Python: counting the number of words in each article, adding a new context variable to the template rendering process, and then rendering the pages as normal. But that would require touching substantial pieces of the codebase (some of which <a href=\"/archive/i-solved-the-same-bug-twice-and-didnt-know-it/\">I no longer understand</a>). It would probably take me all evening to dive into the code, understand it, make the change, and test it. To be honest, this feature was not worth wasting an evening on. So I decided to just hack something.</p>\n<p>As I said, I use Git to deploy the site. So I just added a new line to the HTML template:</p>\n<pre><code class=\"html\">\n&lt;p&gt;\n    This site contains <code>{+ARTICLE_COUNT+}</code>\n    different writings and <code>{+WORD_COUNT+}</code>\n    total words. That's about <code>{+PAGE_COUNT+}</code>\n    pages!\n&lt;/p&gt;\n</code></pre>\n\n<p>And then I added a new step to the pre-commit hook that runs after the template rendering process, but before the changes are committed and the site is deployed.</p>\n<pre><code class=\"bash\">\nWPP=320\nWORDS_N=\"$(find archive/ -name \"*.md\"|xargs -I {} cat {} | wc -w)\"\nWORDS=`printf \"%'d\" $WORDS_N`\nARTICLES=`printf \"%'d\" $(find archive/ -name \"*.md\" | wc -l)`\nPAGES=\"$(( WORDS_N / WPP ))\"\n\nTMP_HOME=`mktemp`\ncp ./index.html $TMP_HOME\ncat $TMP_HOME |\n    sed \"s/{+ARTICLE_COUNT+}/$ARTICLES/\" |\n    sed \"s/{+PAGE_COUNT+}/$PAGES/\" |\n    sed \"s/{+WORD_COUNT+}/$WORDS/\" > ./index.html\n</code></pre>\n\n<p>Let's check in and see how this hack fit my criteria above:</p>\n<table border=\"1\" frame=\"hsides\" rules=\"rows\" style=\"margin-right:auto;margin-left:auto;\">\n    <tr>\n        <td>Do other systems touch this code?</td>\n        <td>No</td>\n    </tr>\n    <tr>\n        <td># of Developers?</td>\n        <td>1</td>\n    </tr>\n    <tr>\n        <td>Time for Correct Approach?</td>\n        <td>2-3 hours</td>\n    </tr>\n    <tr>\n        <td>Time for Bad Approach?</td>\n        <td>10 minutes</td>\n    </tr>\n    <tr>\n        <td>How Valuable is the Feature?</td>\n        <td>Very</td>\n    </tr>\n    <tr>\n        <td>Additional Maintenance Burden?</td>\n        <td>Not much</td>\n    </tr>\n</table>\n\n<p>Is this elegant: absolutely not. Did it take basically zero time? Yes. Have I thought about it since? Not until writing this post. Would I have done this on a team project or a commercial product? Absolutely not. It's a feature for my personal blog engine and a feature that is specific to one particular low-value site that I run.</p>\n<p>In this case, a hack is an example of Good Code. That's because Good Code is a relative construct.</p>\n<p><link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/styles/default.min.css\"><script src=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/highlight.min.js\"></script></p>\n<script>hljs.initHighlightingOnLoad();</script>"}, {"id": "http://brianschrader.com/archive/at-vs-on-a-story-of-semantic-data-modeling/", "url": "http://brianschrader.com/archive/at-vs-on-a-story-of-semantic-data-modeling/", "title": "At vs. On: a Story of Semantic Data Modeling", "date_published": "2022-02-21T22:50:00", "tags": ["programming", "software development"], "author": {"name": "Brian Schrader"}, "content_html": "<p>As most good software developers eventually learn: time is hard. Time-based bugs are incredibly common and are sometimes difficult to solve. There are a <a href=\"https://infiniteundo.com/post/25326999628/falsehoods-programmers-believe-about-time\">ton of misconceptions about how time and dates work</a> in the real world and the simple solution is rarely correct for any significant length of time. Performing calculations based on times and dates can get messy, but so can simply storing them. There's a lot to be wary of when building out a data model with timestamps involved, and as always, a lack of consistent naming can cause a ton of problems.</p>\n<p>Over the years I've come to use a specific terminology for dates and time in my data models. In general, I prefer not to use data types in variable names, and I prefer my code to read as passable English where possible. This means, I tend to avoid names like: <code>date_created</code> or <code>published_ts</code> which contain the data type in the name, and I avoid names like: <code>created</code> which give me absolutely no indication of the type or what it is used for.</p>\n<p>Instead, I prefer to take cues from the English language. For timestamps or any data type that represents a precise moment in time, I use the suffix <code>at</code>. For dates or times that represent more abstract things like wall time or calendar dates, I use the suffix <code>on</code>.</p>\n<p>As an example let's say I have the following data model:</p>\n<pre><code>class BlogPost:\n\n    # ... other fields ...\n\n    created_at = TimestampField()\n    updated_at = TimestampField()\n\n    posted_on = DateField()\n</code></pre>\n<p>This convention tells me that I should expect the <code>posted_on</code> field to contain a date or time but not both, and that it represents an abstract notion of time, whereas both the <code>created_at</code> and <code>updated_at</code> fields represent a specific moment.</p>\n<p>I arrived at this convention through asking myself questions about the data in plain English. Consider the following questions:</p>\n<ol>\n<li>Q: When was this post published?<br />\nA: It was published <strong>on</strong> the 25th of January.</li>\n<li>Q: When was the post record created?<br />\nA: It was created <strong>at</strong> 12:00 PM on January 24th.</li>\n</ol>\n<details><summary>Disclaimer</summary>\nThis convention doesn't always work because usually people would use <b>at</b> to describe any time (e.g. \"I arrived <b>at</b> noon\"). But once I settled on the convention, it wasn't confusing. It just doesn't always read nicely.\n</details>\n\n<p>Knowing when to use a timestamp vs. a calendar date or wall-clock time is another issue (and a complicated one), but at least with this convention, I know which one I'm dealing with.</p>\n<div class=\"footnote\">\nNow that I think about it, it might make sense to name timestamps with an <b>aton</b> suffix since question #2 technically uses both <b>at</b> and <b>on</b>.\n</div>"}]}