{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "https://brianschrader.com/archive/the-practicals-of-writing-paper-and-pens/", "url": "https://brianschrader.com/archive/the-practicals-of-writing-paper-and-pens/", "title": "The Practicals of Writing: Paper and Pens", "date_published": "2025-07-31T19:07:00", "tags": ["writing", "personal"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Without wishing to turn this into a writing &amp; pen blog, I did want to talk a little more about the kit I use these days, if only because I figure some readers out there might find it interesting or useful.</p>\n<p>For a long time, I bought several different kinds of notebooks&mdash;and pens&mdash;looking for the right fit for my needs. Eventually, I landed on a setup that I'm very happy with.</p>\n<h2>A Good Notebook</h2>\n<p>When it comes to notebooks, I have a set of firm criteria and a wishlist of nice-to-haves.</p>\n<p>As some readers might know, I'm left handed and that heavily influences my criteria. I want a notebook with a spine that is thin enough to impact my writing, but at the same time is thick enough to have a meaningful spine presence on a shelf such that I could label the spine and read it. I have a lot of books and notebooks and being able to find things on the shelf quickly matters.</p>\n<p>I tried <a href=\"https://www.amazon.com/dp/B0BLC876QN\">hardbound book blanks</a> (which look <em>amazing</em> on the shelf), but they're a pain to write in because of the thick spine. After that I tried super <a href=\"https://www.amazon.com/dp/B07QDRVDPK\">thin notebooks</a>, but they don't have enough shelf-presence for a spine label and, importantly, they are so thin that they don't contain enough meaningful space for the notes I want to take. Topics spread across volumes and that makes organizing hard.</p>\n<p>I tried so called <a href=\"https://www.amazon.com/dp/B07YLTJHH4\">Executive or Professional Notebooks</a>, these are lovely to look at and hold, and they're great on the shelf, but they're just too big to be easily portable. I like to have a notebook with me at all times and these are simply too big for that.</p>\n<div class=\"image-right\" style=\"width: 300px;\">\n<img src=\"/images/blog/notebooks-options.jpeg\" style=\"max-width: 100%;\">\n<center><small><caption>Just a few of my notebooks.</caption></small></center>\n</div>\n\n<p>That's when I found my solution, a solution that'd been staring me in the face for a long time.</p>\n<p>It's silly to think that my perfect notebook is the simple composition book, but I think it might be. They're super cheap (often only 50¢) and the colored covers (which formed the foundation of my early schooling organizational system) are very useful. They're thick enough to have a good spine, but lay flat on the table. There's enough pages for a meaningful amount of writing, but not so much that filling it feels like a monumental task. I can carry two or three at once in my bag and they're very light and the covers are slightly waterproof&mdash;a welcome feature for the occasional coffee spill. The only real downside is that the low price point means that the paper quality is very bad. Personally, I've found that you can offset some of this by choosing the right brand, but it's a fundamental flaw. Still, I'm using them and love them.</p>\n<h2>What's in a Pen?</h2>\n<p>I'm not going to discuss pencils here, even though I use a <em>lot</em> of them, simply because <a href=\"https://weareticonderoga.com\">Ticonderoga pencils are great</a> and you can just use those.</p>\n<p>When it comes to pens though, I have more nuanced thoughts.</p>\n<p>Years ago, I preferred gel pens, but they <em>suck</em> for left-handers. The ink dries so slowly that it coats the hand in black smudges. From there I moved on to a hodgepodge of ballpoints and never really found one I liked.</p>\n<p>For a while I used a branded metal ballpoint pen from that my Dad took home from work (one of those corporate perks). These felt <em>great</em> in the hand, but they were not great writing implements&mdash;and they exclusively came with blue ink, which was a huge detriment. Blue ink sucks.</p>\n<div class=\"image-center\" style=\"width: 100%;\">\n<img src=\"/images/blog/sarasa-pen-setup.jpeg\" style=\"max-width: 100%;\">\n<center><small><caption>Photo: mine</caption></small></center>\n</div>\n\n<p>Years back, I went to Japan on a vacation with some friends. There I bought a cheap notebook and pen from a convenience store on a whim and then proceeded to fall in love with <a href=\"https://www.amazon.com/dp/B075YNTT8S\">the pen I randomly picked up there</a>. I've used them ever since and while they are cheap, they write extremely well and, crucially, the fine point and particular ink dries very quickly. No smudges on the page, or on my hand! It's a great pen for left-handers. Now, I prefer a very fine point, so that might be a turn off for some people, but I do recommend these pens.</p>\n<p>In other places I use my fountain pens, though I've basically stopped using my dip pens just because they're a hassle. I still love my fountain pens but those Zebra Sarasa pens have stolen my heart.</p>\n<div style=\"padding: 1rem; border: 1px dashed #ccc; border-radius: 3px;\">\n<b>For the record:</b> None of this is an ad for any item mentioned here. I just like them.\n</div>\n\n<p>If you're reading this and you have other suggestions to solve these same problems, I'd love to hear them.</p>\n<p>Also, like I mentioned in my <a href=\"/archive/starting-a-newsletter/\">previous post</a>, I've started a newsletter. If you like this post and want to get future posts delivered straight to your inbox, <a href=\"https://sendfox.com/brianschrader/\">then subscribe</a>!</p>"}, {"id": "https://brianschrader.com/archive/starting-a-newsletter/", "url": "https://brianschrader.com/archive/starting-a-newsletter/", "title": "Starting a Newsletter", "date_published": "2025-07-24T22:15:00", "tags": ["personal", "meta"], "author": {"name": "Brian Schrader"}, "content_html": "<div class=\"image-right\" style=\"width: 300px;\">\n<img src=\"/images/blog/collage.jpeg\" alt=\"You should subscribe to my newsletter!\" style=\"max-width: 100%;\">\n</div>\n\n<p>I'm a few years late to the trend here, but I've gone ahead and set up a <a href=\"https://sendfox.com/brianschrader/\">newsletter</a> for those of you that are interested in getting these posts delivered direct to your inbox.</p>\n<p>I personally use an RSS reader, though I realize that I'm a dying breed these days, but I don't want to exclude anyone who wants to see my posts but just isn't into RSS.</p>\n<p>This has been a long time coming, so I'm happy to finally have it done. You can subscribe to this post and all my upcoming ones at the link above.</p>\n<p>Don't worry, nothing is going to change here. I'm just adding a new way to follow this blog. There's a lot more to come and I promise you, it'll be exciting stuff.</p>\n<p>You should subscribe :)</p>"}, {"id": "https://brianschrader.com/archive/developing-style-writing-cursive-two-years-in/", "url": "https://brianschrader.com/archive/developing-style-writing-cursive-two-years-in/", "title": "Developing Style: Writing Cursive Two Years In", "date_published": "2025-07-23T22:21:00", "tags": ["writing", "personal"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Over a year ago, I <a href=\"/archive/on-handwriting-and-switching-to-cursive/\">switched</a> to writing entirely in cursive and wrote <a href=\"/archive/more-on-handwriting-amp-cursive/\">at length</a> on the techniques and methods I used to re-learn it. This post is an update to those earlier two in which I will dive into the beautiful process I've undertaken trying to develop a personal style for my handwriting.</p>\n<p>I still write a lot and I'd estimate that well over 95% of that writing is in cursive. Doing something so much and with deliberate intent will doubtless improve one's skill but, countering that progress, is the speed at which I write. So my writing ends up looking a bit like a doctor's scrawl&mdash;if a bit more legible.</p>\n<div class=\"image-right\" style=\"width: 350px;\">\n<img src=\"/images/blog/update-cursive.jpg\" alt=\"A picture of my current handwriting.\" style=\"max-width: 100%;\">\n<caption><small><center>Photo: mine</center></small></caption>\n</div>\n\n<h2>Adding Personal Flair</h2>\n<p>However, the lovely thing about writing by hand is that the skill is incredibly personal. Letterforms are standardized and designed for speed and ease of use, but nothing says you actually have to use all of them as designed. I have always loved how older (1800&ndash;1950s) style writing looks and so I wanted to try to emulate those forms where possible. As well, several capital letters are tricky to write consistently and I do not mind occasionally lifting my pen at the start of a sentence. Important too, I changed some letters because <strong>I don't like how they look</strong> in their standard form.</p>\n<p>This led me to abandon several letter forms like the <code>H</code>, <code>F</code>, <code>T</code>, <code>A</code>, and both versions of the letter <code>Z</code> in favor of simpler or more stylistic alternatives.</p>\n<div class=\"image-center\">\n<img src=\"/images/blog/update-letterforms.jpg\" alt=\"Several letterforms I have changes\">\n<caption><small><center>Photo: mine</center></small></caption>\n</div>\n\n<p>These changes make my writing <em>feel</em> like it's actually mine. It's a strange feeling, coming from the world of digital type, but the letters you write can be truly <em>yours</em> if you invest the time to make them so.</p>\n<h2>Technical Changes</h2>\n<p>What may be more difficult to notice is the changes I've made to how I hold and push the pen. These changes help me better emulate the style I prefer but they also make it much easier to write for longer durations. Older styles of writing focused on larger letterforms and swirls because the hand wasn't the primary mode of pen-transport; instead the whole arm was involved! This was largely because your arm gets tired more slowly and so a style like that is more suited to jobs where you'd be writing all day.</p>\n<p>As well, the authors of handwriting styles are almost always right-handed, something I can never truly escape. Writing left-handed involves deciphering and deconstructing the motions and techniques for writing and reconstructing them in a way that works for you. I end up pushing my pen left-to-right at an angle far more parallel to the page than before&mdash;where as a right-handed person would drag their pen the same way. Along with this, I try to use my arm and shoulder to move my pen more often than not and these techniques combined lead to gaps in some letter forms as the pen is not intended to be used this way, and it slants the letters more steeply.</p>\n<div class=\"image-center\" style=\"width: 100%;\">\n<a href=\"/images/blog/cursive-full-width-sample.jpeg\"><img src=\"/images/blog/cursive-full-width-sample.jpeg\" alt=\"A larger sample picture of my current handwriting.\" style=\"max-width: 100%; margin:0;padding:0;\"></a>\n<caption><small><center>A larger sample of my writing related to a recent blog post on <a href=\"/archive/narrative-structure-and-the-principle-of-least-action/\">narrative action</a>.<div>Click to view a larger version. Photo: mine</div></center></small></caption>\n</div>\n\n<h2>Legibility Concerns</h2>\n<p>No doubt there are readers who are currently thinking: your writing is completely illegible! What good is it if I can't read it‽ Well I have two answers to that question:</p>\n<p>First, my writing is primarily for my own consumption and so it matters little to me if others can read it, I certainly can. But secondly, one thing I've found fascinating is that by learning to read and write cursive as I have, even with a modern or personal style, <strong>I have a lot less trouble reading other people's handwriting</strong> than I did before!</p>\n<p>I personally love this YouTube channel: <a href=\"https://www.youtube.com/watch?v=j_lp3hRrOQQ\">Objectivity</a>, where they trawl through the Archives of the Royal Society and read old writing, and a common joke in the videos is that only Keith, the Head Librarian can read any of the letters they pull out. However that's not because he's some expert in handwriting, it's because he's used to doing so! I find myself no longer struggling as much to read the same kinds of letters now that I perform the daily practice of deciphering my own handwriting!</p>\n<p>So in short, things go well with this little quest of mine. It's been a long road to get here, and tons of ink has been spilt to make it so, but I still recommend it, for no other reason than it feels good to have done.</p>"}, {"id": "https://brianschrader.com/archive/narrative-structure-and-the-principle-of-least-action/", "url": "https://brianschrader.com/archive/narrative-structure-and-the-principle-of-least-action/", "title": "Narrative Structure and the Principle of Least Action", "date_published": "2025-06-11T04:15:00", "tags": ["writing", "physics"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I love reading and watching non-fiction because it never answers a question without raising many more. The process of learning and discovery is a never ending quest to slay the hydra. Every severed head&mdash;every answered question&mdash;only brings with it more heads to slay. This all brings me to an insight that occurred to me the other day after rewatching a <a href=\"https://www.youtube.com/watch?v=Q10_srZ-pbs&amp;embeds_referring_euri=https%3A%2F%2Fwww.veritasium.com%2F\">Veritasium video</a> on the discovery of the Principle of Least Action&mdash;for like the fifteenth time.</p>\n<p>Perhaps narrative structures, stories, also obey this same principle.</p>\n<h2>Action, Briefly Explained</h2>\n<p>For those who don't know about the Principle of Least Action, you should watch the video&mdash;it's great. But in short, Action is a concept in physics. Specifically, it's the combination of mass, distance, and velocity, the minimization of which seems to underpin the motion of all objects in the universe. Action alone seems to determine the trajectory of objects in space, that is the path they take as they move.<sup>1</sup> In our modern theories of physics Action is fundamental, and Nature seems to do her best to minimize the expense of it.</p>\n<div class=\"image-right\" style=\"width: 330px; padding-right: 0px; padding-top: 0px; margin-top: 0px;\">\n<img style=\"max-width: 100%; border-radius: 3px; padding-right: 0px; padding-top: 0px; margin-top: 0px; margin-right: 0px;\" src=\"/images/blog/action/all-paths.jpg\" alt=\"A picture of a set of possible curves between two points on a 2-d plane.\" />\n<caption><small><center>A visualization of all possible paths a particle might take as it moves. <cite>Photo credit: Veritasium</cite></center></small></caption>\n</div>\n\n<p>Of all the possible paths that an object <em>could</em> take as it moves, it seems that objects in free-fall motion <em>always</em> move along the specific trajectory which minimizes the Action.</p>\n<h2>Narration viewed as Action</h2>\n<p>In writing there is a principle called <a href=\"https://en.wikipedia.org/wiki/Chekhov's_gun\">Chekhov's gun</a>, which states simply that:</p>\n<blockquote>\n<p>If in the first act you have hung a pistol on the wall, then in the following one it should be fired. Otherwise don't put it there.</p>\n</blockquote>\n<p>The point is to rid your story of extraneous elements. Detail must serve a narrative purpose; it <em>must</em> be justified. In a way, this is similar to the <a href=\"https://en.wikipedia.org/wiki/Occam%27s_razor\">Principle of Parsimony (a.k.a. Occam's Razor)</a> which is commonly paraphrased as, \"of two competing theories, the simpler explanation of an entity is to be preferred.\" As a writer, your job is to craft a world and a narrative that fits disparate information together into a seamless whole. The better story is the one which requires fewer assumptions by the reader and omits extraneous information. This might be otherwise phrased as crafting a \"tight\" story. A tight story with a good ending is one that minimizes the information required for a reader to find the narrative and its completion engaging, one that ties up loose ends, and one that gives the reader the feeling of satisfaction and closure.</p>\n<div class=\"image-right\" style=\"width: 330px; padding-right: 0px; padding-top: 0px; margin-top: 0px;\">\n<img style=\"max-width: 100%; border-radius: 3px; padding-right: 0px; padding-top: 0px; margin-top: 0px; margin-right: 0px;\" src=\"/images/blog/action/unification.jpg\" alt=\"A picture of a set of books on physics together with several good stories and a hint that they are related.\" />\n<caption><small><center>Grand Unification?</center></small></caption>\n</div>\n\n<p>Stories exist in an abstract space with many more dimensions than our familiar 3-D space would allow me to depict. However the story is still singular, it follows a well-defined path traced by its words through this space and my argument is that the \"ideal path\", the one which the author ought to prefer when writing, is the one which minimizes the Action in that space.</p>\n<p>To be clear, I do not have a rigorous formulation for this idea, it's an idle musing after all, but upon reflection it seems to comport with my intuition about good writing. Perhaps a thought experiment will help.</p>\n<h2>A (Totally Rigorous) Proof</h2>\n<p>Consider two points on <a href=\"/archive/the-mysterious-potential-of-the-plane/\">the Plane</a> with the X &amp; Y dimensions quantifying some range of values for narrative structure: say the amount of world-building in a scene vs the progression of the story over all. Moving \"up\" on this chart means adding more backstory, while moving \"right\" is progressing the story.</p>\n<div class=\"image-right\" style=\"width: 330px;\">\n<img style=\"max-width: 100%; border-radius: 3px; padding-right: 0px; margin-right: 0px;\" src=\"/images/blog/action/true-path.jpg\" alt=\"A picture of two points on the 2-D plane connected by a single trajectory and a slightly different trajectory which quote uses endquote more action\" />\n<caption><small><center>A point in the story begins at point A (at page α) and moves to point B (at page β). <cite>Photo credit: Veritasium</cite></center></small></caption>\n</div>\n\n<p>Now, the story will likely have many, <em>many</em> more dimensions than this, but stay with me.</p>\n<p>The story itself then is a curve which connects the two points at a given page count. This curve, or the path of the story as it moves through pages, can take many forms. However the one it <em>should</em> take under the principle above is the one which minimizes the Narrative Action (which we have not, and will not, formally define).<sup>2</sup></p>\n<p>Now consider altering this curve by adding additional detail about the world. This detail is <em>by definition</em> unnecessary to the story because the minimal path exists from point A to point B as defined above. Therefore that detail would only increase the total Narrative Action and should be removed.<sup>3</sup></p>\n<p>In this way, the writer should emulate Nature in her effort to minimize all information in their story which is not required to attain the desired effect. Obviously the hard part is actually <em>intuiting</em> the true path that does this, but I'm not here to tell you how to be a good writer, that's too hard. Still, these ideas do seem connected, or perhaps that's just me.</p>\n<div class=\"footnote\">\n<p><sup>1.</sup> Yes, curvature is also a thing. Also Quantum. Ignore it.</p>\n<p><sup>2.</sup> Out of scope for this conversation.</p>\n<p><sup>3.</sup> Associated with this is the idea that a story should create stresses, that is ask questions, which are relaxed or resolved by later sections. That tension is critical, but the path followed from the author's insertion of that tension (akin to the throwing of a ball which disturbs it from free-fall motion) and the resolution of it (the ball's final destination) should still follow this principle.</p>\n</div>"}, {"id": "https://brianschrader.com/archive/experts-in-the-internet-age-the-power-of-email/", "url": "https://brianschrader.com/archive/experts-in-the-internet-age-the-power-of-email/", "title": "Experts in the Internet Age: the Power of Email", "date_published": "2025-06-06T20:48:00", "tags": ["music", "history"], "author": {"name": "Brian Schrader"}, "content_html": "<p>These days I spend a fair bit of my time emailing libraries in order to get access to research materials for a project I'm working on, and I'd like to share what has become a very typical experience for me and one that I think more people should know about.</p>\n<div style=\"border: 1px solid #ccc; border-radius: 5px; padding: 0.5rem; text-align: center; background-color: rgba(255, 255, 255, 0.5);\">\n<b>tl;dr</b> librarians are amazing and incredibly helpful.\n</div>\n\n<p>It all started in the way most things do these days: with a search and a random recommended result.</p>\n<p>At the time, I was looking into several different genres of music played during the seventeenth and eighteenth centuries (1600-1700) across Europe and the Middle East. Specifically I was looking into English/American Colonial and Romanian Folk. I came across several incredible melodies&mdash;including one that immediately <a href=\"https://www.moshloviolin.com/doina-violin\">stole my heart</a> even though it wasn't at all what I was looking for&mdash;and I eventually stumbled on this tune captured by a visitor to Colonial Williamsburg:</p>\n<iframe width=\"560\" height=\"315\"  style=\"margin-left: auto; margin-right: auto; display: block;\" src=\"https://www.youtube.com/embed/9l7LKBssu4o?si=RJMucuQf1xGnC-hv\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n\n<p>This was precisely what I was looking for, but the song came in with no introduction and the video itself contained no further clues as to what this song even was. I wanted to know more about it (and potentially find the source of the melody and others like it) but I was starting from a pretty bare slate.</p>\n<p>I started my research by trying to find any information on the Colonial Williamsburg site as to the kinds of music their performers play, but that went nowhere. So, I headed over <a href=\"/archive/the-simple-joy-of-learning-to-play-piano/\">to my piano</a> and deciphered the tune by ear so that I could potentially look up the sheet music. However no music search engine I could find could tell me what the song was. I was running low on options now, so I did what I've now done several times: I emailed the Colonial Williamsburg Research department and simply asked if they could help.</p>\n<p>A few days later I had a response:</p>\n<blockquote>\n<p>[Our] Performing Arts dept [says] that the clip you have is a medley of songs. They're from the <strong>John Playford English Dancing Master</strong> collection of tunes, and are called, ‘Cockleshells,’ and ‘Oranges and Lemons.’\n(emphasis mine)</p>\n</blockquote>\n<p>Perfect. I had a source. Even better: that source is <a href=\"https://archive.org/details/dancingmasterord00play/page/304/mode/2up\">on the Internet Archive</a>.</p>\n<div class=\"\">\n<img src=\"/images/blog/cockleshells.jpg\" alt=\"A screenshot of the songbook mentioned earlier contining the music for Cockleshells.\" class=\"image-center\" style=\"max-width: 100%;\" />\n<center><small>Photo credit: Internet Archive</small></center>\n</div>\n\n<p>Now, some readers might be asking why I am telling this story at all. Didn't I simply send an email and get a reply? Yes. I did. But that's precisely <em>why</em> I feel so compelled to tell it.</p>\n<p>These days the internet is a beast with two heads: seemingly everything is available on it, yet we have trouble finding anything. Mathematicians sometimes refer to this phenomenon as <q>the problem of finding the hay in a haystack</q>. We're surrounded by information and yet overwhelmed by any ability to actually navigate it to find what we want.</p>\n<p>Amidst this chaos, I have continued to find guidance and help in the form of the under-appreciated experts who staff our libraries and research institutes. There is only so much that independent research can accomplish and it's hard to remember that you can ask for help.</p>\n<p>In the past few years I've sent dozens of emails like this one and always received helpful responses. Increasingly, in our ever-connected world, data may exist on the internet, but we might find that we will end up relying on the knowledge of the experts in the physical realm to find it.</p>\n<p>The internet has made so much content and information available at our fingertips, but perhaps the most powerful fragment of that content is a simple email address.</p>\n<div class=\"footnote\">\nI've <a href=\"/archive/on-the-web-the-best-outcome-is-email/\">said it before</a>, and I'll say it again: even with all its many flaws, I love email. When in doubt, you can simply ask.\n</div>"}, {"id": "https://brianschrader.com/archive/what-if-bookclub-but-with-ai/", "url": "https://brianschrader.com/archive/what-if-bookclub-but-with-ai/", "title": "What if: Bookclub, but AI?", "date_published": "2025-06-04T06:00:00", "tags": ["programming", "ai"], "author": {"name": "Brian Schrader"}, "content_html": "<p>A while back I had a free evening and a silly idea, and what resulted was an interesting exploration of the large-context behavior and analytical capabilities of modern LLMs (ChatGPT in my case). The idea was very simple:</p>\n<blockquote>\n<p>What would happen if ChatGPT hosted a bookclub with itself?</p>\n</blockquote>\n<p>Now, this is&mdash;of course&mdash;a very serious question with very serious implications for the trajectory of modern technology, so I set out on a quest to answer mankind's greatest curiosity.</p>\n<p>A few hours later, <a href=\"https://github.com/Sonictherocketman/bookclub/\">I had my answer</a>, so let's go over it, shall we?</p>\n<h2>The Why</h2>\n<p>There has long been a common notion in the Discourse that&mdash;since LLMs are trained on public internet data and since that data is increasingly polluted with AI spam content&mdash;the general quality of AI-generated results would degrade over time.</p>\n<p>As well it's widely known that even the most top-quality LLMs today generally return banal, shallow, and overly friendly responses, even when prompted not to (in some cases because of explicit training to do so), and I was curious to see what would happen if GPT was given the opportunity to converse, long-form, over time with a disparate group of minds. I was interested to see if GPT would overcome its preference for lackluster observations when summarizing text and genuinely discover something novel. To do this, I knew I couldn't simply ask it questions about a given text in its training set, I would need to instruct it to conduct an elaborate play of personalities, each of whom would read and summarize the text in their own way.</p>\n<h2>Getting it Together</h2>\n<p>The code itself isn't very exciting. I cobbled together a little Python script that would take in a set of personality files for each of my several bookclub participants and then randomly choose between them for who was going to speak next. To keep things consistent, the script would keep a log of the dialogue as it went and submit that with each request.</p>\n<p>As I played with the script, I made two changes, each of which significantly improved the conversation. First, I made it so that each participant would be primed by feeding ChatGPT the given personality and the chapter text, and then I asked GPT to summarize the chapter in the perspective of the given person. That summary would then be added to the given person's <code>mind-state</code>. Second, I added a bias in the random choice of speaker that preferred any names mentioned in the prior response&mdash;GPT often referred to other characters by name and it would be natural for that person to respond directly.</p>\n<p>Both of these changes inspired several additional ideas for future improvements, but we'll get to that in a minute. For now, let's see what happened when the script did its thing.</p>\n<h2>Ready, Set, Bookclub!</h2>\n<div class=\"image-right\" style=\"max-width: 300px;\">\n<img alt=\"The Cover of the Book assigned for that week's session: The Purple Cloud\" src=\"/images/blog/purple-cloud.jpg\" style=\"max-width: 100%\">\n</div>\n\n<p>The book I had originally lined up for this was <q>Pride and Prejudice</q> as it's <a href=\"https://www.gutenberg.org/files/1342/1342-h/1342-h.htm\">easily available</a> in the public domain. However that choice proved useless as ChatGPT knew too much about the book from its training set. I needed something it had rarely encountered before so that I could test its observational prowess.</p>\n<p>Hence I chose a book I read a few years back: <q>The Purple Cloud</q>, by M.P. Shiel.</p>\n<p>All that was left was to craft a series of personalities to enact my little play, and so I set to crafting some backstories and, like a director: I set the scene.</p>\n<details>\n  <summary>ChatGPT's Scene Instructions &amp; Motivation</summary>\n<img alt=\"GPT receiving character motivations before the show\" src=\"/images/blog/gpt-scene-directions.png\">\n<p>\n    I workshopped these quite a bit, but I know there's more to do. Obviously I could have tried custom assistants, but that is discussed more below.\n</p>\n</details>\n\n<p>At first, I was pleasantly surprised. Each of GPT's personas invented motivations and expanded on their backstories, and GPT never seemed confused about who was talking and easily tracked the flow of the conversation. Characters routinely invented novel conversation topics and helped to slowly invent the character of the world around them.</p>\n<p>However it didn't take long before things went awry.</p>\n<p>On several attempts, one of my characters would pour wine for the group (a kind enough gesture), and the group would all toast and thank each other for coming out for the evening. However, it seems no where in GPT's training data does it contain any reference to narrative pacing or what to do in order to <em>finish</em> a toast, and so the conversation would inanely continue on and on as each character added more to the toast, and never once did any of them decide to actually drink. 🥂</p>\n<div class=\"image-container-center\">\n<img class=\"image-center\" alt=\"A screenshot of the output of the script.\" src=\"/images/blog/bookclub-log.png\" />\n</div>\n\n<p>In future attempts, I intend to add another personality to act as a sort of <em>stage direction</em> bot, whose only job is to add occasional scene changes that the characters would be assumed to observe. This, hopefully, would alleviate this issue and help to avoid the next one:</p>\n<p>Once GPT established a scene, it never changed or evolved. This was surprising as over time all sorts of conversational details were being added to the chat: discussions of the book chapter, character moments, and backstory were ripe for use, but the conversations only ever got duller as they went on. Soon characters were agreeing to visit a consistently invented, newly-opened, vegan cafe with apparently fantastic croissants, but as the small talk progressed characters would endlessly revisit topics, gush pointlessly, and never add anything novel of value.</p>\n<p>And that leads me to my most interesting observation: the conversation always died without any insight into or worthwhile analysis of the book chapter provided. Sure, characters would discuss the most superficial of elements and it was all incredibly mundane. Discussion was largely focused on the sense of foreboding mood found in the chapter or on the director's stage direction for some of the characters to be put off by the often unwieldy prose. For all it's might, GPT couldn't even be bothered to bring up specifics of the main character's arctic expedition, comment on any specific character's motivations or plot drama, or even try to predict the ending.</p>\n<div class=\"image-container-center\">\n<img class=\"image-center\" alt=\"A screenshot of the output of the script.\" src=\"/images/blog/gpt-conversation-quality.png\" style=\"border-radius: 5px; max-width: 100%; padding: 0;\" />\n<small><center>Overall (perceived) conversational quality.</center></small>\n</div>\n\n<p>And invariably, one of my characters would ask when the eponymous Purple Cloud would appear, to which another would reply that it \"sounded ominous\". GPT it seems is about as good at analyzing novel text as a high-schooler who only read the back-of-the-book blurb (read: myself in high-school).</p>\n<h2>What Does It All Mean?</h2>\n<p>In general, I was less-than-impressed with GPT's abilities in this task. As I mentioned before, it quickly became apparent that GPT could spout off vapid insights regarding the text of <q>Pride and Prejudice</q> even without the chapter text (I had a bug originally that prevented the text from being included in the chat log, but nevertheless GPT knew about the plot and characters), however with a less-familiar text it proved much less insightful than I expected.</p>\n<p>In general, I'm not sure what to make of this little experiment. I'm more certain that I'd like to try it all again with several specific, technical improvements that will hopefully address some of the limitations I encountered.</p>\n<h2>Bookclub 2.0</h2>\n<p>While I haven't gotten around to implementing any of these yet, here's the list of features I came up with to improve the process:</p>\n<p><em>Use Stage Direction:</em> As I said, one of the chief limitations of this process was the fact that the scene itself never evolved. That meant that after each character had explored their backstory and current setting, there was no where to go and so they babbled on incessantly about nothing. Adding another agent whose primary job is to insert novel change would hopefully disturb the equilibrium and allow for new insights.</p>\n<blockquote>\n<p>A dump truck drives by and outside a dog barks.</p>\n</blockquote>\n<p><em>Improve each Character's Mental Model:</em> Here I'd hope to track not only the character dialogue but improve on the priming process I mentioned before by asking (at every step) what each character <em>thinks</em> about the current situation and allow their own mental state to evolve beyond what is present in the spoken dialogue. Currently it's not possible for characters to have separate internal and external states which also likely flattens their complexity. As well I'd hope to include much more detail in each character's backstory and education including other materials they found interesting or recently encountered.</p>\n<p><em>Consider Different LLMs:</em> One critical limitation of this approach is that it only uses one LLM and therefore is biased toward one set of training data and methods. Perhaps if a given character were assigned a different LLM that could help matters. There's bound to be implicit baises in each model that could affect the conversational tone (and who knows! perhaps then it would be possible to have a jerk participate in the conversation).</p>\n<p>In addition to these two improvements, I'd hope to investigate some technical changes as well. The sheer volume of tokens being submitted (including the entire chapter text and dialogue history) means that the project quickly racked up a tab. However in order to have richer character personas I'd likely need to investigate training custom assistants rather than feeding it all through the chat log API.</p>\n<p>Anyways that's it. I don't really have a through-line for this post. I just tried a thing and thought it was worth sharing. If you have suggestions or feedback, please file an issue or shoot me an email. The project is up <a href=\"https://github.com/Sonictherocketman/bookclub/\">on GitHub</a> if you want to play with it yourself.</p>"}, {"id": "https://brianschrader.com/archive/a-counting-meta-post/", "url": "https://brianschrader.com/archive/a-counting-meta-post/", "title": "A Counting Meta-Post", "date_published": "2025-01-14T01:50:00", "tags": ["blogging", "meta"], "author": {"name": "Brian Schrader"}, "content_html": "<p>It's been a while since we've run this little snippet, so let's see what we get!</p>\n<p><code>$ find archive/ -name \"*.md\"|xargs -I {} cat {} | wc -w</code><br />\n<code>124582</code></p>\n<p>That means that there's roughly 124,582 total words written on this blog, not bad! That means I've managed to increase the total word count on this blog by nearly 24% in two years.</p>\n<p>I'm not going for word count here, but it's still an interesting metric mostly because I post so much less frequently than I used to. That realization lead me to a much more interesting question about the overall length of individual blog posts over time. I posted the preliminary results over <a href=\"https://mastodon.social/@sonicrocketman/113680787236911331\">on Mastodon</a> where I also discussed my reasoning behind the obvious trend of post length increasing over time.</p>\n<p><img alt=\"A chart of the length of blog posts over time with a trend line that clearly goes up and to the right.\" src=\"/images/blog/post-length-vs-time.jpg\" class=\"image-center\"/></p>\n<p>In general, my posts get longer as time goes on, and you can see that even more clearly in this chart which groups posts by the year they were\n<img alt=\"A boxplot of the posts on this blog grouped by year\" src=\"/images/blog/words-by-year-boxplot.jpg\" class=\"image-center\"/></p>\n<p>The general trend for a given post's word count had been slightly upward for a long time, but the trend seems to take off in 2021 (with a huge dip in 2023 due to a lot of quick project posts). 2024 however is the clear outlier.</p>\n<blockquote class=\"mastodon-embed\" data-embed-url=\"https://mastodon.social/@sonicrocketman/113680790417578033/embed\" style=\"background: #FCF8FF; border-radius: 8px; border: 1px solid #C9C4DA; max-width: 540px; min-width: 270px; overflow: hidden; padding: 0; margin-left: auto; margin-right: auto;\"> <a href=\"https://mastodon.social/@sonicrocketman/113680790417578033\" target=\"_blank\" style=\"align-items: center; color: #1C1A25; display: flex; flex-direction: column; font-family: system-ui, -apple-system, BlinkMacSystemFont, 'Segoe UI', Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', Roboto, sans-serif; font-size: 14px; justify-content: center; letter-spacing: 0.25px; line-height: 20px; padding: 24px; text-decoration: none;\"> <svg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" width=\"32\" height=\"32\" viewBox=\"0 0 79 75\"><path d=\"M74.7135 16.6043C73.6199 8.54587 66.5351 2.19527 58.1366 0.964691C56.7196 0.756754 51.351 0 38.9148 0H38.822C26.3824 0 23.7135 0.756754 22.2966 0.964691C14.1319 2.16118 6.67571 7.86752 4.86669 16.0214C3.99657 20.0369 3.90371 24.4888 4.06535 28.5726C4.29578 34.4289 4.34049 40.275 4.877 46.1075C5.24791 49.9817 5.89495 53.8251 6.81328 57.6088C8.53288 64.5968 15.4938 70.4122 22.3138 72.7848C29.6155 75.259 37.468 75.6697 44.9919 73.971C45.8196 73.7801 46.6381 73.5586 47.4475 73.3063C49.2737 72.7302 51.4164 72.086 52.9915 70.9542C53.0131 70.9384 53.0308 70.9178 53.0433 70.8942C53.0558 70.8706 53.0628 70.8445 53.0637 70.8179V65.1661C53.0634 65.1412 53.0574 65.1167 53.0462 65.0944C53.035 65.0721 53.0189 65.0525 52.9992 65.0371C52.9794 65.0218 52.9564 65.011 52.9318 65.0056C52.9073 65.0002 52.8819 65.0003 52.8574 65.0059C48.0369 66.1472 43.0971 66.7193 38.141 66.7103C29.6118 66.7103 27.3178 62.6981 26.6609 61.0278C26.1329 59.5842 25.7976 58.0784 25.6636 56.5486C25.6622 56.5229 25.667 56.4973 25.6775 56.4738C25.688 56.4502 25.7039 56.4295 25.724 56.4132C25.7441 56.397 25.7678 56.3856 25.7931 56.3801C25.8185 56.3746 25.8448 56.3751 25.8699 56.3816C30.6101 57.5151 35.4693 58.0873 40.3455 58.086C41.5183 58.086 42.6876 58.086 43.8604 58.0553C48.7647 57.919 53.9339 57.6701 58.7591 56.7361C58.8794 56.7123 58.9998 56.6918 59.103 56.6611C66.7139 55.2124 73.9569 50.665 74.6929 39.1501C74.7204 38.6967 74.7892 34.4016 74.7892 33.9312C74.7926 32.3325 75.3085 22.5901 74.7135 16.6043ZM62.9996 45.3371H54.9966V25.9069C54.9966 21.8163 53.277 19.7302 49.7793 19.7302C45.9343 19.7302 44.0083 22.1981 44.0083 27.0727V37.7082H36.0534V27.0727C36.0534 22.1981 34.124 19.7302 30.279 19.7302C26.8019 19.7302 25.0651 21.8163 25.0617 25.9069V45.3371H17.0656V25.3172C17.0656 21.2266 18.1191 17.9769 20.2262 15.568C22.3998 13.1648 25.2509 11.9308 28.7898 11.9308C32.8859 11.9308 35.9812 13.492 38.0447 16.6111L40.036 19.9245L42.0308 16.6111C44.0943 13.492 47.1896 11.9308 51.2788 11.9308C54.8143 11.9308 57.6654 13.1648 59.8459 15.568C61.9529 17.9746 63.0065 21.2243 63.0065 25.3172L62.9996 45.3371Z\" fill=\"currentColor\"/></svg> <div style=\"color: #787588; margin-top: 16px;\">Post by @sonicrocketman@mastodon.social</div> <div style=\"font-weight: 500;\">View on Mastodon</div> </a> </blockquote>\n<script data-allowed-prefixes=\"https://mastodon.social/\" async src=\"https://mastodon.social/embed.js\"></script>\n\n<p>Of course the early days of this blog were a huge outlier as well, but that's another topic. Excluding the early days, things are trending up.*</p>\n<div class=\"footnote\">\n* In terms of word count. Offer not valid in all states.\n</div>"}, {"id": "https://brianschrader.com/archive/foundational-texts/", "url": "https://brianschrader.com/archive/foundational-texts/", "title": "Foundational Texts", "date_published": "2024-12-19T19:11:00", "tags": ["book", "book recommendations", "books"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Recently, I saw <a href=\"https://kottke.org/24/12/what-are-your-personal-foundational-texts\">this post</a> from Kottke about so called Foundational Texts, and it got me thinking.</p>\n<blockquote>\n<p>Writer Karen Attiah recently wrote about the pleasure of perusing other people’s personal libraries and then asked her followers what their “personal foundational texts” were…those books that people read over and over again during the course of their lives…</p>\n<p>How about you? What are your personal foundational texts?</p>\n</blockquote>\n<p>The question is a super interesting one. What books one reads shape their worldview. All media does this but, at least to me, books seem to hold an outsized influence. A few movies or TV shows stand out to me as being my favorites, fewer still exert a shaping force on me. Books seem to possess a more potent staying power.</p>\n<p><img src=\"/images/blog/foundational-books.png\" style=\"max-width: 100%;\" /></p>\n<p>The thing is, I don't really <em>re-read</em> books (especially non-fiction). Sure, there's a couple I've revisited over the years, but it's a very small list. That said there are select set of books that, once I'd read them, I've never gotten them out of my head.</p>\n<p>So let's get into it (in no particular order):</p>\n<ul>\n<li>The Wizard of Earthsea by Ursula K. LeGuin</li>\n<li>The People vs. Democracy by Yascha Mounk</li>\n<li>The Scientific Revolution by Steven Shapin</li>\n<li>Pale Blue Dot by Carl Sagan</li>\n<li>The Silmarillion by J.R.R. Tolkien</li>\n<li>Zen and the Art of Motorcycle Maintenance by Robert M. Pirsig</li>\n<li>Gödel's Proof by Ernest Nagel</li>\n</ul>\n<p>Most of these I read in high school and college (or right after college), which is probably why they are so foundational. What's interesting is that, looking at them now, I clearly see a set of themes that stand out to me as foundational to my thinking about the world: optimism vs. caution, systems vs. the individual, agency vs. limits. Perhaps I'll expound more on these in a future post.</p>\n<p>Usually, when I to get interested in a topic, I dive in whole hog, and so my reading list tends to be very single-minded for a while until eventually it takes a sharp detour one day toward something usually unrelated. From 2017-2022 that topic was U.S. Politics and Government. When I'm not in that sort of research-mode, I tend to revert to either some classic American novel or Fantasy.</p>\n<p>But this means that what \"foundational\" means to me is that it is heavily influential and formative as to how I think about a topic. When I think of each of the books in the list above, I can immediately recall the change it had on my thinking.</p>\n<p>As I've <a href=\"/archive/podcasts-the-universe-and-everything/\">mentioned before</a> podcasts have had a huge impact on me, especially in my late high-school and early college years. Both the Writing Excuses podcast and the lectures from Astronomy 162 at Ohio State stand out in my memory as shaping my interests.</p>\n<p>Now, to continue Jason's call to action, what about you? What are your foundational texts?</p>"}, {"id": "https://brianschrader.com/archive/science-models-and-squeaking-lead/", "url": "https://brianschrader.com/archive/science-models-and-squeaking-lead/", "title": "Science, Models, and Squeaking Lead", "date_published": "2024-12-18T07:54:00", "tags": ["history", "alchemy", "philosophy"], "author": {"name": "Brian Schrader"}, "content_html": "<p>At the dawn of the 14th century the Franciscan alchemist <a href=\"https://en.wikipedia.org/wiki/Paul_of_Taranto\">Paul of Taranto</a> crouched over the strange lump of metal he'd created. He gaped, in awe of what he had done. It should have been impossible. The scholars told him he was a fool to even try, yet he'd <em>done</em> it. It wasn't gold that he'd created. He was still far from achieving that goal, but he'd made an important step. According to the book he would later publish under the title <em>Summa perfectionis magisterii</em>, Paul&mdash;writing under a deliberately confusing pseudonym&mdash;had just transmuted Lead into Tin!<sup>1</sup></p>\n<p>For those of us in the 21st century, it's second nature to dismiss this sort of claim as obviously ridiculous. There is no known, chemical way to do what Paul intends. But that begs a very obvious question: what <em>had</em> he done? If we take the man at his word, he certainly seems to have done <em>something</em> to his bar of lead, but what? And why did he believe his experiment had succeeded?</p>\n<p>These questions will lead us down a very fascinating path, and one that reveals the striking truth about our knowledge of the natural world.</p>\n<h2>Theory &amp; Practice</h2>\n<p>We take so much for granted these days about the knowledge of the natural world. We consider obvious and teach to children what took generations of the brightest minds to figure out, and it can be very easy to forget that.</p>\n<p>Today we break apart systems to understand them; this is Reductionism. And we use material analysis to understand and manipulate the properties of physical objects: that is we melt, dissolve, chemically alter, and then recombine materials in order to create what we want. But in order to do all that&mdash;and better to make predictions about what <em>exactly</em> our methods will accomplish in doing so&mdash;we must accept the following assumption: that an object is nothing more than a physical assortment of indivisible components.<sup>2</sup> This assumption may seem obvious to most people today, but it wasn't always that way! Indeed most serious philosophers in the past considered the idea ludicrous.<sup>3</sup></p>\n<p><img src=\"/images/blog/alchemy/book-wide.jpg\" style=\"width: 100%; max-width: unset; padding: 0;\" class=\"image-center\" /></p>\n<p>I won't go into the history of Classical &amp; Medieval Matter Theory, but suffice it to say that before a pre-modern version of what we today would call Atomic Theory would emerge, the dominant view of \"What is Stuff?\" was far more <strong>qualitative</strong> than <strong>quantitative</strong>. For the programmers out there, think of their Matter Theory as a sort of Duck Typing.<sup>4</sup></p>\n<blockquote>\n<p>If it walks like a duck and it quacks like a duck, then it's a duck.</p>\n</blockquote>\n<p>Matter <em>was</em> it's qualities. Gold is yellow, ductile, resists being tarnished. Lead tarnishes easily, it's heavy. Tin is silvery and <a href=\"https://www.youtube.com/watch?v=kzIsvbKHgfU\">when you bend it</a>, <strong>it squeaks</strong>. Therefore the process of turning one metal into another is a matter of giving it the desired qualities!</p>\n<div style=\"float: right; min-width: 270px;\" class=\"image-container\">\n<img src=\"/images/blog/alchemy/geber.jpg\" style=\"height: 425px; max-width: unset;\" />\n<caption><small>Photos: mine</small></caption>\n</div>\n\n<p>As at every point in history, there were differing view points about what exactly matter is made of and scholarly opinions differed greatly. However, one theory&mdash;preferred by alchemists like our old friend Paul&mdash;held that the four prime elements were bound together into a duopoly of two higher-level substances to make the metals. What were those substances? Why <a href=\"https://en.wikipedia.org/?title=Sulfur-mercury_theory_of_metals&amp;redirect=no\">sulfur and mercury</a>!</p>\n<p>Yup, literal sulfur (or brimstone) and mercury (or quicksilver).</p>\n<p>Now before we make fun of Paul too much (or rather <a href=\"https://en.wikipedia.org/wiki/Pseudo-Geber\">Geber</a> as he called himself in his writing), let's try to understand <em>why</em> he thought sulfur and mercury were the foundational elements underpinning all metals. Under this theory, the difference between say lead and gold was simply in the relative proportions of these primary ingredients!</p>\n<p>Paul, like so many alchemists, was seemingly quite the avid experimentalist, and so based his theories on what he could determine by the fire. Among many other experiments, he noticed the sulfurous smell given off by impure metals during refining and assumed that such a smell was due to a volatile sulfur within the metal itself. Additionally, according to Dr. William Newman:</p>\n<blockquote>\n<p>The fact that calcined [i.e. burned] metals often appear in the form of yellow, red, or white powder (what we coul call oxides) suggests to Geber that they also contain...sulfur that remains after the volatile sulfur has been forced out by calcination.<br />\n- <a href=\"https://www.amazon.com/Atoms-Alchemy-Experimental-Scientific-Revolution/dp/0226576973\">Atoms &amp; Alchemy</a> by William R. Newman, p. 33</p>\n</blockquote>\n<p>As for the mercury, that brings us back to our earlier tale. Again Newman writes:</p>\n<blockquote>\n<p>Geber proves [his] point by washing lead with quicksilver and then melting it. whereupon the lead gains the creak that the tin had lost&mdash;as he puts it, the lead is converted to tin.<br />\n- <a href=\"https://www.amazon.com/Atoms-Alchemy-Experimental-Scientific-Revolution/dp/0226576973\">Atoms &amp; Alchemy</a> by William R. Newman, p. 33</p>\n</blockquote>\n<p>According to his theory this worked because tin had more intrinsic mercury than lead. Therefore, to transform it, one simply needed to add mercury into the lead. Sure enough, once lead is washed in this way, <em>it squeaks when it bends</em>. Paul had successfully imparted the quality of squeakability into his lead, thereby transforming it (albeit partly) into tin.</p>\n<p>It might sound silly, but consider this: here was a person who formed a hypothesis about the cause of a natural phenomenon, then tested it. It worked, so he built on it. That sounds a lot like science, doesn't it?</p>\n<h2>What Even <em>is</em> Science?</h2>\n<p>At it's core, modern science is two things: a process of inquiry and a collection of knowledge. Together those two form a model of the natural world that we use to make predictions and offer explanations into the workings of nature. Science does not, and cannot, tell us how nature actually works under the hood, instead it gives us the tools to develop and test our models.</p>\n<p>This point is worth belaboring, because for me, it took a long time to really click.</p>\n<p>I studied aerospace engineering, which is basically Newton's mechanics, material design, and a lot of stuff about how fluids flow (air is a fluid, you see). When you study physics in this way, it can be tempting to believe you've learned something about nature, but what you've learned is how to <em>model</em> nature. There are always error terms sticking out, gaps in the theory, losses you approximate (spherical, frictionless cows for example). The math isn't nature, it's an approximation. Crucially, it's an approximation that <em>seems to work</em>, or at least it does within your measure of tolerance.</p>\n<p>It's hard to remember that we don't really know how nature works. We know how to approximate it. But that fact becomes easier to understand when you approach the study of nature, not from our current perspective, but from the outside.</p>\n<p>What's so fascinating to me about the example of poor old Geber/Jabir/Paul above is that his theories about matter were utterly wrong, and yet they did offer testable predictions that were sometimes correct! Like many scientists before and since, Paul may have very well chalked up his experimental failures to defects in apparatus, hidden variables like mineral origins, or even the incompleteness of his own theories, but nevertheless he worked with and improved his theories so to arrive at testable methods and predictions, and he wasn't the only one!</p>\n<p>It fascinates me so much because I find myself wondering: what do we believe about nature that future generations will look back on with the same bemusement that we feel about Paul of Taranto or any other proto-scientist who's theories fell short? What about nature will become so obvious that it's taught to ten-year-olds in four centuries, but that now our brightest cannot see?</p>\n<div class=\"footnote\">\n<sup>1</sup> The opening scene of this post is a fictional account, so no one take this too seriously.\n</div>\n<div class=\"footnote\">\n<sup>2</sup> Or chemically indivisible at least.\n</div>\n<div class=\"footnote\">\n<sup>3</sup> All of this pertains only to the European West and the Middle East during the Classical and Medieval periods. Basically those cultures touched by the legacy of Aristotle.\n</div>\n<div class=\"footnote\">\n<sup>4</sup> For the Programmers out there, think about this:<br /><code>\nclass Tin extends Lead implements Squeakable, Silvery {}\n</code>\n</div>"}, {"id": "https://brianschrader.com/archive/the-mysterious-potential-of-the-plane/", "url": "https://brianschrader.com/archive/the-mysterious-potential-of-the-plane/", "title": "The Mysterious Potential of the Plane", "date_published": "2024-12-13T02:46:00", "tags": ["mathematics", "math"], "author": {"name": "Brian Schrader"}, "content_html": "<p>In recent years I've embarked on a sort of journey of rediscovery with respect to mathematics. As a kid I was <em>somewhat</em> good at math and I spent my college years doing lots of it&mdash;to the point where I grew to really dislike it. But even in those times, mathematics&mdash;while becoming increasingly difficult&mdash;always seemed like it was trying to tell me something. These days, it fascinates me.</p>\n<p>A common observation among those who study classical engineering fields is that many (if not most) of the problem domains are modelled with very similar techniques. The motion of a cantilevered beam, a road bridge, a plane wing, a mass on a spring, a musical note, and even a planet's orbit can be described by very similar mathematics. Indeed so many physical phenomena can be described by these equations that it can make you wonder if you've stumbled into some <a href=\"https://www.wired.com/2016/07/everything-harmonic-oscillator/\">great secret</a> of the universe.</p>\n<figure>\n<a href=\"https://commons.wikimedia.org/wiki/File:Horizontal-mass-on-spring.svg\">\n<img class=\"image-center\" src=\"/images/blog/Horizontal-mass-on-spring.svg\" />\n</a>\n<figcaption style=\"display: block; text-align: center;\"><small>To the physics/engineering undergrad, <i>everything</i> is a mass on a spring.<br />Credit: MikeRun/WikiMedia Commons</small></figcaption>\n</figure>\n\n<p>But that wonderful truth is only a gateway to something much deeper, more fundamental&mdash;a true capital-S Secret of the Universe. Mathematics tends to deceive with simplicity, and there's few things in this world that hide more secrets than this simplest of concepts.</p>\n<h2>Consider the Plane</h2>\n<p>As children we're taught about the 2-D Plane.<sup>1</sup> At first, students are confused in a manner similar to how they felt when being told <math math;\"><mrow><mi>x</mi><mrow></math> was a number now, and oftentimes that confusion grows into consternation. At worst, plotting and manipulating curves on this plane feels pointless, arbitrary, and unnatural. For those who come to know the plane as a tool, it can be quite an enlightening process. As an undergrad engineering student, you become familiar with the plane and its rules; you learn to shape curves and solve perspective puzzles with it. Modern <a href=\"https://www.youtube.com/watch?v=r6sGWTCMz2k\">video animations</a> make this so much more intuitive because they're able to show a figure on the plane change over time: you can watch it squish and stretch as you adjust the coefficients of a quadratic.</p>\n<p><img class=\"image-center\" src=\"/images/blog/cos-grid.png\" style=\"width:500px\" /></p>\n<p>What's more Geometry holds so much deeper meaning in our world than I think most people imagine. Vast numbers of people can use mathematics to do every day tasks: measure the square-footage of a room, scale up a recipe for a family dinner, or plan their finances, but Geometry does so much more. Simple rules about finding the angles in a triangle can help measure the curvature of the universe, and simple sines and cosines (which form the backbone of many vector operations) enable the ability to encode the meaning of abstract linguistic concepts in modern Large Language Models. Our universe is made of math in truly fascinating ways.</p>\n<p>But this isn't my point. So far, this has all been backstory.</p>\n<h2>Exploring the Plane</h2>\n<p>What's truly wondrous about the 2-D Plane isn't what you can plot, but what you can discover. There are infinitely many lines, curves, and shapes one can draw on the 2-D Plane and while most of them are useless, quite a few are incredible. Those are the ones we plot to find the motion of a ball in the air, or the speed of a planet's orbit over time. But there are some curves that hold incredible secrets. We know of a few and there are likely many, many more. These magical curves transform our understanding of mathematics itself.</p>\n<p>Consider the logarithm:</p>\n<div>\n    <math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n      <mrow>\n        <mi>x</mi>\n        <mo>=</mo>\n        <mn>1,000</mn>\n        <mtext> or </mtext>\n        <msup>\n          <mn>10</mn>\n          <mn>3</mn>\n        </msup>\n      </mrow>\n    </math>\n\n    <center style=\"display: block; padding: 0.25rem;\">therefore</center>\n\n    <math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n      <mrow>\n        <mi>l</mi>\n        <mi>o</mi>\n        <mi>g</mi>\n        <mo form=\"prefix\" stretchy=\"false\">(</mo>\n        <mi>x</mi>\n        <mo form=\"postfix\" stretchy=\"false\">)</mo>\n        <mo>=</mo>\n        <mn>3</mn>\n      </mrow>\n    </math>\n</div>\n\n<p>This is a function that can be used to do all sorts of practical, useful operations, but it can also <strong>convert multiplication into addition</strong>.</p>\n<math display=\"block\" class=\"tml-display\" style=\"display:block math; margin-bottom: 0.5rem;\">\n  <mrow>\n    <msup>\n      <mn>10</mn>\n      <mn>3</mn>\n    </msup>\n    <mo>*</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>5</mn>\n    </msup>\n    <mo>=</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>8</mn>\n    </msup>\n  </mrow>\n</math>\n\n<math display=\"block\" class=\"tml-display\" style=\"display:block math;\">\n  <mrow>\n    <mi>l</mi>\n    <mi>o</mi>\n    <mi>g</mi>\n    <mo form=\"prefix\" stretchy=\"false\">(</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>3</mn>\n    </msup>\n    <mo form=\"postfix\" stretchy=\"false\">)</mo>\n    <mo>+</mo>\n    <mi>l</mi>\n    <mi>o</mi>\n    <mi>g</mi>\n    <mo form=\"prefix\" stretchy=\"false\">(</mo>\n    <msup>\n      <mn>10</mn>\n      <mn>5</mn>\n    </msup>\n    <mo form=\"postfix\" stretchy=\"false\">)</mo>\n    <mo>=</mo>\n    <mn>8</mn>\n  </mrow>\n</math>\n\n<p>Plotted, the <a href=\"https://www.youtube.com/watch?v=OjIwCOevUew\">logarithm function</a> makes a curve on the 2-D Plane. This means that there exists a curve on the plane which converts multiplication to addition! What other <a href=\"https://www.youtube.com/watch?v=f8CXG7dS-D0\">magical curves</a> exist with incredible properties? Perhaps there's a curve that plots itself? Oh wait! <a href=\"https://www.youtube.com/watch?v=_s5RFgd59ao\">There is</a>!</p>\n<p>At it's core, a function is a thing that takes a number(s) and returns another. This sequence of values can be plotted to form a curve on the plane. There's a curve mapping subtraction to multiplication, one for the GDP of the U.S. over time, and (given some encoding trickery) a curve describing the lifespan in seconds of each and every being that will ever exist! They're all in there somewhere; we just have to find them.</p>\n<p>This is one of the true wonders of mathematics<sup>2</sup>, and more specifically of geometry. Who would think that simple shapes and curves could tell such great truths? Yet so much hides within the expanse. In this way, the work of finding such curves is one of exploration in a treacherous wilderness. With simple tools, one carves a path of discovery amid the endless vastness, returning to share the knowledge they have found.</p>\n<h2>The Secrets Within</h2>\n<p>Held within the depths of this infinite expanse there are perhaps infinitely many fundamental secrets. We only find them through careful study, or occasionally by accident, and we have no idea how many we might be missing&mdash;even amidst the sectors of that expanse we've so thoroughly explored.</p>\n<p>It's so wondrous to me that such a simple concept could hold such great truths and that shapes and curves upon the plane could so accurately model the natural world. Perhaps it should be the Plane or the Triangle that stands beside Fire as our most powerful invention.</p>\n<div class=\"footnote\">\n<sup>1</sup> For most of my life, I'd been confused when people mentioned \"the complex plane\" or \"the number line\" rather than \"a plane\" or \"a number line\", but the beauty in properly capitalizing the name \"The 2-D Plane\" is that, in a Platonic-Forms kind of way, it reveals the truth that we're all talking about the <i>same</i> plane. There's only one. We may depict some fragment of it on a board, but the true 2-D Plane exists in singular and only in Form.\n</div>\n<div class=\"footnote\">\n<sup>2</sup> No doubt some people out there will read a few of my points here and correctly point out that these are more points about infinity rather than specifically the 2-D plane. You are correct, but my point remains valid.\n</div>"}]}