{"home_page_url": "https://brianschrader.com", "version": "https://jsonfeed.org/version/1", "description": "Thoughts, and ramblings about technology, programming, history, and whatever else I'm interested in.", "feed_url": "https://brianschrader.com/feed.json", "title": "BiteofanApple by Brian Schrader", "items": [{"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/pine-for-ios-released/", "tags": ["pine", "ios", "app", "release"], "content_html": "<div class=\"image-container\">\n<img\n    src=\"/images/blog/pine/pine-app-logo-light.png\"\n    alt=\"Pine.blog iOS App Logo\"\n    style=\"max-width:150px; width:80%; box-shadow:3px 3px 5px darkgrey; border-radius:30px; padding:0; margin-right:10px;\"\n/>\n</div>\n\n<p>It's official: the <a href=\"\">Pine.blog app for iOS</a> is available on the App Store! The app is free for all and requires a premium subscription to <a href=\"https://pine.blog\">Pine.blog</a>.</p>\n<p>With this version you can quickly and easily check up on your timeline and your favorites, and the app refreshes in the background so that you're always up to date with the latest news and posts from any site you follow.</p>\n<p>Version 1.0 is pretty slimmed down, which is why I was able to get something out so quickly after the initial Pine launch, but don't worry; there's lots of great features planned for the app. Overall, I'm trying to keep releases fairly small so that they can be released more often.</p>\n<p>So far, I'm planning for v1.1 to include the ability to:</p>\n<ul>\n<li>Post to your own site, just like you can on the website.</li>\n<li>See who you follow and to follow and unfollow sites from the app.</li>\n<li>Preview images from posts directly from the timeline (like how a lot of Twitter apps show images).</li>\n</ul>\n<p>Thanks to all the Pine users for making this possible, and if you enjoy Pine, please tell your friends!</p>", "date_published": "2018-07-05T23:32:00", "title": "Pine for iOS Released!", "id": "http://brianschrader.com/archive/pine-for-ios-released/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-sneak-peek-pine-for-ios/", "tags": ["pine", "ios", "app"], "content_html": "<style>\n    div.image-container {\n        width: unset;\n        text-align:center;\n        padding: 0px;\n        float:none;\n    }\n    div img.pine-screenshot {\n        max-height: unset;\n        max-width: unset;\n    }\n    img.pine-screenshot {\n        box-shadow: 4px 4px 5px #ccc;\n        padding: 0;\n        margin-right: 15px;\n        display: inline;\n        height:350pt;\n    }\n</style>\n\n<p>It's been a few busy weeks since I first <a href=\"//pine.blog\">launched Pine</a>, a new kind of Feed Reader. And while it's not quite ready for prime-time yet, here's a sneak peek at the official Pine app for iOS.</p>\n<p><strong>The app will be free and require a Pine subscription</strong> to use. My favorite features though are the <strong>Dark Mode</strong> and <strong>Dark App Icon</strong> support.</p>\n<p>The first version of the app is pretty bare bones with only only a few screens: your timeline, likes listing, and full article view. And while you'll of course be able to share and like posts, Version 1.0 will not have any sort of search or follow/unfollow support (though that's coming soon afterwards).</p>\n<div class=\"image-container\">\n<img\n    class=\"pine-screenshot\"\n    src=\"/images/blog/pine/820-likes-dark.PNG\"\n/>\n<img\n    class=\"pine-screenshot\"\n    src=\"/images/blog/pine/820-post-light.PNG\"\n/>\n<img\n    class=\"pine-screenshot\"\n    src=\"/images/blog/pine/820-post-dark.PNG\"\n/>\n</div>\n\n<p>Deciding what to cut and what to keep is always hard, but I've once you've set up Pine in the browser, this version of the app should have enough features for a nice day-to-day experience.</p>\n<p>I've been using the app for a couple of days now and it's really shaping up into something special. Hopefully it will be ready for launch soon.</p>", "date_published": "2018-06-15T12:42:00", "title": "A Sneak Peek: Pine for iOS", "id": "http://brianschrader.com/archive/a-sneak-peek-pine-for-ios/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/announcing-pine-microblogging-for-a-new-generation-/", "tags": ["pine", "software", "announcement"], "content_html": "<p><img\n    alt=\"Pine Logo\"\n    class=\"image-right\"\n    style=\"max-width:200px;\"\n    src=\"https://pine.blog/static/images/pine-logo-color-500.png\"\n/></p>\n<p>Today I'm announcing <a href=\"https://pine.blog\">Pine, a new kind of RSS Reader and Microblogging client</a>. I've been developing Pine, in addition to a bunch of other projects for a while now, and it's finally time to show it off to the world.</p>\n<p>In a classical sense, Pine is a Feed Reader, but it's really more of a successor to my old <a href=\"/archive/microblogger-status-updates-and-more/\">Microblogger project</a> from way back. Not only can users follow the people and sites they want, but you can also use Pine to post to your own Wordpress site and find new sites and people using the built in search. In a lot of ways Pine and <a href=\"https://micro.blog\">Micro.blog</a> are similar with a few key differences and, from what I can tell, both Manton and I started working on them at around the same time. Pine is my contribution to a new ecosystem of open social networking tools and services. Anyone on Micro.blog can follow people on Pine and vice-versa.</p>\n<p>Pine is also my first venture into building paid software. It's $5 per month and at that price I don't have to sell ads or do anything shady to earn money.</p>\n<p>I've been reluctant to post anything about Pine until it officially launched, but now that it has, I've got a few interesting design decisions I'd like to talk about. Building a feed reader has always been on my to-do list, and it turns out that there's a lot more to it than just parsing feeds.</p>\n<p>I've got a lot of great new features planned, including an iOS app which should be coming soon. If you're interested, give Pine a shot, and let me know what you think!</p>\n<p><a href=\"https://pine.blog\">Pine &#8594;</a></p>", "date_published": "2018-05-23T11:30:00", "title": "Announcing Pine: Microblogging for a New Generation 🎉", "id": "http://brianschrader.com/archive/announcing-pine-microblogging-for-a-new-generation-/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-people-vs-democracy/", "tags": ["democracy", "politics", "technology"], "content_html": "<p>I just finished <a href=\"https://www.amazon.com/People-vs-Democracy-Freedom-Danger/dp/0674976827/ref=sr_1_1?ie=UTF8&amp;qid=1526762388&amp;sr=8-1&amp;keywords=the+people+vs+democracy\">Yascha Mounk's excellent book <em>The People vs. Democracy</em></a>. In it Yascha talks about how the two main parts of a Liberal Democracy are now at odds with each other, not working together.</p>\n<blockquote>\n<ul>\n<li>A <em>democracy</em> is a set of binding electoral institutions that effectively translate popular views into public policy.</li>\n<li><em>Liberal</em> institutions effectively protect the rule of law and guarantee individual rights such as freedom of speech, worship, press, and association to all citizens (including ethnic and religious minorities).</li>\n<li>A <em>liberal democracy</em> is simply a political system that is both liberal and democratic &mdash; one that both protects individual rights and translates popular views into public policy.</li>\n</ul>\n<p>...Democracies can be illiberal...[especially] where most people favor subordinating independent institutions...or curtailing the rights of minorities they dislike. Conversely, liberal régimes can be undemocratic, despite having regular competitive elections.</p>\n</blockquote>\n<p>I've been thinking a lot about that distinction lately. Democracy is kind of a holy word in our society, a thing that cannot be bad, but as Yascha points out, the original democracy in Athens was known for executing writers and philosophers, and not extending suffrage past its male elites. It's the combination of Enlightenment era liberalism and democracy that gives us the systems we see around us today. Yascha's main point is that this combination seems to be falling apart all over the world as systems either become less democratic, or less liberal, or both at the same time.</p>\n<p>Yascha also dives into the possible causes of this split, and how to fix it; from social media to housing prices. It's a fascinating read, and it really changed the way I think about today's political climate for the better. I haven't torn through a book that quickly in a long time.</p>", "date_published": "2018-05-19T13:46:00", "title": "The People vs. Democracy", "id": "http://brianschrader.com/archive/the-people-vs-democracy/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/safaris-websocket-stream-view/", "tags": ["development", "software", "programming", "adventurer's codex", "xmpp"], "content_html": "<p>I've mentioned before that <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> uses XMPP over WebSockets for it's live-chat and party features, and we're planning to add lots more of these kinds of features in the future. That being said, as a developer, I've had a pretty difficult time building features that rely on WebSockets because it's kind of annoying to see exactly what is being sent and received over the connection. I know that Chrome has some features to help with developing WebSocket applications, but I've never had a good experience with them, and I use Safari as my default browser for both casual use and for web development.</p>\n<p>That said, I stumbled across a new WebSocket Stream View in Safari's Dev Tools and, just like when <a href=\"/archive/gits-hidden-feature-notes/\">I discovered that Git supports notes</a>, I got really excited. Clicking on an active WebSocket connection now brings up a live timeline of every message sent and received by the browser over that connection. It even shows the <code>ping/pong</code> frames that the browser occasionally sends to verify that the connection is still open.</p>\n<div class=\"image-container\">\n    <img src=\"/images/blog/safari-websocket-stream-viewer.png\"\n         alt=\"safari websocket viewer\">\n    <p><small>Safari's New WebSocket Stream View</small></p>\n</div>\n\n<p>I'm hoping that this new view will make it a lot easier to debug problems because I can now see exactly what's being sent over the connection. I'm not sure when this was added to the Safari Dev Tools, but it's definitely very welcome.</p>", "date_published": "2018-03-04T22:16:00", "title": "Safari's WebSocket Stream View", "id": "http://brianschrader.com/archive/safaris-websocket-stream-view/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/gits-hidden-feature-notes/", "tags": ["git", "development", "software", "programming"], "content_html": "<p>When I'm programming I tend to create a lot of experimental branches to test my ideas before actually implementing them, and a lot of times I'll leave these branches in some half-state or with uncommitted changes. Then when I come back I've forgotten what I was doing and why. After running into exactly this problem earlier today, I started wondring if there was something built into Git that would give me a place to write notes to myself without committing.</p>\n<p>Well, apparently there is: Git has built in notes!</p>\n<p>According <a href=\"https://git-scm.com/docs/git-notes\">to the docs</a> you can use the command <code>git notes</code> which:</p>\n<blockquote>\n<p>Adds, removes, or reads notes attached to objects, without touching the objects themselves.</p>\n</blockquote>\n<p>It's always exciting for me to discover a cool new tool, and even more so when I learn more about one I already use.</p>\n<p><a href=\"https://git-scm.com/docs/git-notes\">Git Notes Documentation &#8594;</a></p>", "date_published": "2018-03-04T20:37:00", "title": "Git's Hidden Feature: Notes", "id": "http://brianschrader.com/archive/gits-hidden-feature-notes/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/real-life-science-fiction/", "tags": ["space", "spacex", "rockets", "future"], "content_html": "<p>Earlier today SpaceX launched their first Falcon-Heavy Rocket with Elon's personal Tesla onboard. All in all the launch went really well, and congrats to everyone at SpaceX for making it possible 🎉. There was a lot of amazing technological development and hard-core engineering that had to happen to make all of it possible, and it was amazing to watch, but one part in particular felt surreal.</p>\n<p>Falcon Heavy is an absolutely huge rocket. According to <a href=\"http://www.spacex.com/falcon-heavy\">SpaceX</a>:</p>\n<blockquote>\n<p>Only the Saturn V moon rocket, last flown in 1973, delivered more payload to orbit.</p>\n</blockquote>\n<p>For me though, the real crowning moment, the minute everything stopped being real and starting being Science Fiction was when the first stage boosters came back down, and landed in perfect sync; it felt like complete magic.</p>\n<video class=\"image-center\" controls>\n  <source src=\"/images/blog/SpaceX-Booster-Landing-Short.mp4\" type=\"video/mp4\">\n    Your browser does not support this video.\n</video>\n\n<p>Most days we're trapped in the real world, but things like today's landing are so awesome that, for a second, it can feel like we're living in a Fantasy or Sci-Fi universe. While I don't really approve of SpaceX's corporate practices, they do truly amazing and fantastic work, and the people there are top notch. I can't wait for the next launch.</p>\n<ul>\n<li><a href=\"/images/blog/SpaceX-Booster-Landing-Docks.jpg\">Another view of the landing &#8594;</a></li>\n<li><a href=\"/images/blog/SpaceX-Booster-Landing.mp4\">The full landing video with audio &#8594;</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=BHIo6qwJarI\">Some music to go with the video &#8594;</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=wbSwFU6tY1c&amp;t=2279s\">The full stream on YouTube &#8594;</a></li>\n</ul>", "date_published": "2018-02-06T17:59:00", "title": "Real Life Science Fiction", "id": "http://brianschrader.com/archive/real-life-science-fiction/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-web-as-a-social-network/", "tags": ["open web", "social networking"], "content_html": "<p><a href=\"http://inessential.com/2018/02/01/why_micro_blog_is_not_another_app_net\">Brent Simmons on Micro.blog</a></p>\n<blockquote>\n<p>Twitter and Facebook are convenient, sure, but so are fossil fuels, and the cost was similarly unknown for a long time. But now we have some idea just how bad these things are for the world....</p>\n<p>[With <a href=\"https://micro.blog\">Micro.Blog</a>] your posts are just a normal, everyday part of the open web. At this writing, mine appear on micro.inessential.com — but it’s on my to-do list to have those appear on my main blog (this blog) instead. (Probably won’t happen until after I ship the app I’m currently working on.)</p>\n<p>And this is how it used to be, and how it never should have stopped being: my blog is me on the web. I own my blog: I own me.</p>\n</blockquote>\n<p>Here's where I'd normally write something like this:</p>\n<blockquote>\n<p>Brent is right. Blogs and microblogs can and are the future of social networks. They allow you to keep control of your content, and protect you from huge, often nefarious corporate whims...</p>\n</blockquote>\n<p>But any reader of this site will already know my feelings on the Open Web and Social Networking. So this time I've decided to make this post a retrospective on what I've said before, and how my opinions, and the web has changed over the last few years.</p>\n<h2>The Open Web Series Collection</h2>\n<p>My first post about the Open Web was from July 2014, when this blog was still in it's infancy. Since then I've basically written about this subject whenever it's come up in the circles I travel in. At first I was just concerned with preserving my site and my thoughts for the future, but over time I morphed into the Open Web loving nerd you see before you today.</p>\n<ul>\n<li><a href=\"/archive/re-permanence/\">Re: Permanence (2014)</a></li>\n</ul>\n<blockquote>\n<p>How much history is lost by those who live it not writing it down. With the internet, we have the ability (assuming storage is cheap) to preserve everything we ever say, think, write, or post. That's really powerful, and possible accountability and privacy issues aside, its probably the most important use of an invention in the history of man.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/permanence-revisited/\">Permanence Revisited (2014)</a></li>\n</ul>\n<blockquote>\n<p>I've retweeted <a href=\"https://twitter.com/gruber/status/1024766035\">this tweet</a> multiple times, mostly because it's hilarious, but every time I want to do so, even though I have it saved in Instapaper and favorited on Twitter, its easier to google the text of the tweet (as close as I can remember) and let Google do the work.</p>\n</blockquote>\n<p>After a while I got it into my head that RSS could be used for a new (old?) kind of social network, and I've been rolling with that idea ever since.</p>\n<ul>\n<li><a href=\"/archive/waffle-brent-and-marco-on-social-networks/\">Waffle, Brent and Marco on Social Networks (2014)</a></li>\n</ul>\n<blockquote>\n<p>What would it mean to have a social network (like Dispora) that is decentralized, and independent of corporate ties? Could such a thing exist?</p>\n</blockquote>\n<p>Then I was (am still) mad at Twitter for a while, which just stoked the Open Web flames.</p>\n<ul>\n<li><a href=\"/archive/twitter-and-the-open-web/\">Twitter and the Open Web (2014)</a></li>\n</ul>\n<blockquote>\n<p>Could it be that the time for new social networks is past us? I hope not. RSS succeeded as an open standard, and so did email (though email had an early start). The podcasting industry is growing, powered by RSS... RSS use floundered after Google Reader shutdown, but RSS is still with us. That's important.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/how-to-stimulate-the-open-web/\">How to stimulate the open web (2014)</a></li>\n</ul>\n<blockquote>\n<p>Create systems that are ambivalent about the open or closed web. If I create a tool that's good at posting content to Facebook and Twitter, it should also post to RSS feeds...</p>\n</blockquote>\n<p>I tried <a href=\"https://www.xkcd.com/927/\">making a standard once</a>, but putting something on GitHub in a README doesn't make it a standard.</p>\n<ul>\n<li><a href=\"/archive/the-open-microblog-standard/\">The Open Microblog Standard (2014)</a></li>\n</ul>\n<blockquote>\n<p>A few weeks ago I began drafting a new standard for open, platform independent communication service. You can think of it as Twitter meets RSS...</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/making-rss-real-time/\">Making RSS Real-Time (2014)</a></li>\n</ul>\n<blockquote>\n<p>One of the critiques of RSS feeds in a world dominated by Facebook and Twitter is that RSS just isn't fast enough. You can't hope to achieve what Twitter calls \"in-the-moment updates\" and \"watch events unfold\" if your client is polling each web site's RSS feed once an hour for new microblog posts...</p>\n</blockquote>\n<p>After a while I started noticing that a lot of creators and bloggers I followed were moving back to open, platform-less distribution methods (like CGP Grey and his RSS feeds and email lists).</p>\n<ul>\n<li><a href=\"/archive/the-professional-sharer/\">The Professional Sharer (2014)</a></li>\n</ul>\n<blockquote>\n<p>[Social Media Platforms] have to do this to make money. It just sucks that how they make money is by compromising the people that made the service what it is (<em>cough</em> Twitter <em>cough</em>).</p>\n</blockquote>\n<p>I was still mad at Twitter.</p>\n<ul>\n<li><a href=\"/archive/twitter-is-not-a-replacement-for-blogs/\">Twitter is not a replacement for blogs (2014)</a></li>\n</ul>\n<blockquote>\n<p>Twitter is a complementary medium to blogging, but it's not a replacement...</p>\n<p>By knocking down a few walls and moving some furniture around, blogging is preparing for a comeback, and we'll all be better off for it.</p>\n</blockquote>\n<p>More recently though I've gotten more realistic and still more optimistic about the future of social networks and openness. Facebook and Google's Algorithms still loom high and mighty, but I started to see a resistence forming, and then Manton Reece released <a href=\"https://micro.blog\">Micro.blog</a></p>\n<ul>\n<li><a href=\"/archive/a-vision-of-the-open-web/\">A Vision of the Open Web (2016)</a></li>\n</ul>\n<blockquote>\n<p>I've long heard people say that we've lost video, music, and messaging to the walled worlds of YouTube, iTunes, and WhatsApp/Facebook/Twitter respectively, and while I believe that is the current state of the web, I don't believe it's the end-state.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/can-we-save-the-open-web/\">Can we save the open web? (2016)</a></li>\n</ul>\n<blockquote>\n<p>If we're going to allow... algorithms to be such a huge part of our lives, which I don't believe is necessarily a bad thing, then they should at least be subject to some sort oversight.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/mantons-microblog/\">Manton's Micro.blog (2017)</a></li>\n</ul>\n<blockquote>\n<p>I've written lots of stuff about services like Manton's, and the Open Web in general. It's really important that we preserve not just the way the Web used to work, but as Manton says: the way it <strong>should work</strong>.</p>\n</blockquote>\n<p>The future looks bright for the open web and social networking, but the fight is ongoing.</p>", "date_published": "2018-02-02T12:12:00", "title": "The Web as a Social Network", "id": "http://brianschrader.com/archive/the-web-as-a-social-network/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/primitive-tech-is-here-for-the-long-haul/", "tags": ["primitive technology", "news"], "content_html": "<p>John's <a href=\"https://primitivetechnology.wordpress.com/2017/11/24/new-area-starting-from-scratch/\">most recent Primitive Technology blog post</a> has me pretty excited. The new video is great, as his videos tend to be, but the post mentions something a bit more exciting.</p>\n<blockquote>\n<p>I bought a new property to shoot primitive technology videos on. The new area is dense tropical rainforest with a permanent creek. Starting completely from scratch, my first project was to build a simple dome hut and make a fire.</p>\n</blockquote>\n<p>This is just me speculating here, but he wouldn't be buying a whole new plot of land to shoot videos on if he wasn't planning on making more videos long term. While I never had any reason to believe he'd be stopping anytime soon, such a big purchase is great news for him, his channel, and fans like me.</p>\n<p><a href=\"https://primitivetechnology.wordpress.com/2017/11/24/new-area-starting-from-scratch/\">Primitive Technology Blog &#8594;</a></p>", "date_published": "2017-11-24T14:46:00", "title": "Primitive Tech is Here for the Long Haul", "id": "http://brianschrader.com/archive/primitive-tech-is-here-for-the-long-haul/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-fcc-moves-to-dismantle-net-neutrality/", "tags": ["fcc", "net neutrality", "internet"], "content_html": "<p><a href=\"https://techcrunch.com/2017/11/21/fcc-officially-moves-to-unwind-net-neutrality-rules/amp/\">Jonathan Shieber for TechCrunch &#8594;</a></p>\n<blockquote>\n<p>Federal Communications Commission Chairman Ajit Pai today made good on his long-standing pledge to tackle regulations established in the last administration designed to protect the distribution of internet content.</p>\n<p>On Tuesday, Pai distributed to the other commissioners at the FCC a draft of his suggested rule changes under the auspices of the “Restoring Internet Freedom Order.”</p>\n<p>The move sets up a December 14 vote at the FCC that could have broad ramifications for the entire internet. Under the rules established by the Obama administration, internet providers are required to provide open access to their networks for all digital content.</p>\n</blockquote>\n<p>I'm really sad to see the FCC going forward with their plan to dismantle the Net Neutrality protections. What's worse is that Ajit Pai seems to know full well what this will mean for the web, and seemingly no amount of public comment against his proposal can disuade him.</p>\n<p>It seems like the only recourse we really have now is either to chip away at Ajit Pai's resolve with public comments before the December vote, or wait for some act of Congress to reverse the decision: something I can't even imagine them doing.</p>\n<p><a href=\"https://act.eff.org/action/congress-don-t-sell-the-internet-out\">Help Protect the Internet by Contacting Your Representative &#8594;</a></p>", "date_published": "2017-11-23T21:18:00", "title": "The FCC Moves to Dismantle Net Neutrality", "id": "http://brianschrader.com/archive/the-fcc-moves-to-dismantle-net-neutrality/"}], "author": {"url": "https://brianschrader.com", "name": "Brian Schrader", "avatar": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "icon": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}