{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "http://brianschrader.com/archive/experimenting-with-the-game-of-life/", "url": "http://brianschrader.com/archive/experimenting-with-the-game-of-life/", "title": "Experimenting with the Game of Life", "date_published": "2023-09-25T04:18:00", "tags": ["programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>As I am <a href=\"/archive/fun-with-math-calculating-multiplicative-persistence/\">want</a> to do, I spent an evening a while back putting together a Python version of <a href=\"https://en.wikipedia.org/wiki/John_Horton_Conway\">John Conway's</a> Game of Life: a &quot;zero-player game&quot; in which the board state progresses automatically according to a set of rules.</p>\n<p>You can find the code for the <a href=\"https://gist.github.com/Sonictherocketman/4551dcf001932639a03e8849be92ff71\">game here</a>. It requires just the Python standard library to run, so its easy to get started assuming you have Python &gt;=3.10 installed. (It might run on lower than that but I didn't test it.)</p>\n<p><img alt=\"A screenshot of the Game of Life\" src=\"/images/blog/life.png\" />\n<center><small>A screenshot of my version of The Game of Life</small></center></p>\n<details>\n<summary>Gameplay Video</summary>\n<div>\n\n<video autoplay=\"false\" preload=\"false\" controls>\n    <source src=\"/images/blog/Gol.mp4\" type=\"video/mp4\">\n</video>\n<center><small>Thrilling, right?</small></center>\n</div>\n</details>\n\n<p>The initial board state for the game is randomized so each run-through is unique. Some end immediately, so you may have to run the script several times to see something cool happen.</p>\n<p>Because it's written in Python, the game is single threaded and quite lacking in raw performance, but because it's written in Python the game was also incredibly easy to put together&mdash;taking about three hours in total including debugging, though I did spend three more hours optimizing the render performance for no reason.</p>\n<p>As with most of my recent script projects, I don't really have a point or reason for doing it other than to have some fun building toy projects. Like I've said before:</p>\n<blockquote>\n<p>Scripts are programming candy whereas app development is the real meat and potatoes. In a script you can take shortcuts, be a bit messy, and forgo worrying about the complexities of large software.<br />\n- <a href=\"/archive/take-a-break-script-something/\">Take A Break, Script Something</a></p>\n</blockquote>\n<p>In that same time I've also thrown together a few little scripts to <a href=\"https://gist.github.com/Sonictherocketman/5d51d3c8e739624404f3f8535fb1f564\">visualize the chaos of the Collatz Conjecture</a> and <a href=\"https://gist.github.com/Sonictherocketman/be0a4aa1a43d3c74604ea9f3f5352e63\">simulate the dynamics of 2-D gas expansion</a>. Are these important? Nope, not at all. Were they fun? Yes, yes they were.</p>"}, {"id": "http://brianschrader.com/archive/building-bots-for-fun-and8230/", "url": "http://brianschrader.com/archive/building-bots-for-fun-and8230/", "title": "Building Bots for Fun and&#8230;", "date_published": "2023-08-05T21:41:00", "tags": ["mastodon", "programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>For all of the good things about Mastodon and the Fediverse more broadly, the technology has so far struggled to spread far outside of tech circles and into the broader public. Mastodon especially is pretty big these days, but its mostly filled with a lot of computer nerds like myself; there really isn't a very large music scene like there is on other social media sites.</p>\n<div class=\"image-container\" style=\"padding-left: 1rem;\">\n<iframe allowfullscreen sandbox=\"allow-top-navigation allow-scripts allow-popups allow-popups-to-escape-sandbox\" width=\"320\" height=\"400\" src=\"https://www.mastofeed.com/apiv2/feed?userurl=https%3A%2F%2Fmastodon.social%2Fusers%2Fsdmusiceventsbot&theme=auto&size=80&header=true&replies=false&boosts=false\"></iframe>\n</div>\n\n<p>I wanted to help fix that, so I threw together a simple <a href=\"https://mastodon.social/@sdmusiceventsbot\">Mastodon bot</a> (a toot bot?) that regularly shares information about local music shows in San Diego.</p>\n<p>With the <a href=\"https://www.sandiegoreader.com\">San Diego Reader</a> as its data source, the bot posts every hour about shows happening in the next day or two. Hopefully it will help my fellow San Diegans keep tabs on the music scene, and help to inspire more musicians and local music fans onto the platform.</p>\n<p>So if you're at all interested in the San Diego music scene, be sure to follow <a href=\"https://mastodon.social/@sdmusiceventsbot\">sdmusiceventsbot</a> on Mastodon! And if you're a local artist, make sure you <a href=\"https://mastodon.social/@sdmusiceventsbot\">add your event</a> to the Reader to get yourself noticed by the bot! Be warned, San Diego has a lot of shows (more than the bot could ever reasonably post without looking like spam), so not all shows will get posted. The choices are random, so it's all up to the luck of the dice.</p>"}, {"id": "http://brianschrader.com/archive/announcing-paper-peaks/", "url": "http://brianschrader.com/archive/announcing-paper-peaks/", "title": "Announcing Paper Peaks", "date_published": "2023-07-31T22:53:00", "tags": ["music"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Nearly two years ago, my band <a href=\"https://thefourthsection.com\">The Fourth Section</a> released an EP called <a href=\"/archive/the-road-to-glass--stone/\">Glass &amp; Stone</a> and this month we released our first, full-length album: Paper Peaks.</p>\n<p>Recording an album has been a long-time goal of mine and something we as a band have been working toward for over three years.</p>\n<p><a href=\"https://thefourthsection.com\">\n<img\n    src=\"https://thefourthsection.com/img/paperpeaks.webp\"\n    class=\"image-center\"\n    style=\"width: 400px;\"\n/>\n</a></p>\n<p>I don't have much to say about the album, other than you should listen to it, but I can say it's been a true honor to have been able to make something like this with such amazing people. The three of us have worked hard since March to record, produce, publish, and promote the thing and it's taken a lot more out of us than I think we expected. Paper Peaks was a labor of love and something that could not have been done save for the support of my bandmates, our producer Jeff Berkley, and so many others.</p>\n<p>If you like indie-rock and alt-rock, give it a listen and if you like it, please share it with your friends.</p>"}, {"id": "http://brianschrader.com/archive/some-thoughts-on-adventurers-codex/", "url": "http://brianschrader.com/archive/some-thoughts-on-adventurers-codex/", "title": "Some Thoughts on Adventurer's Codex", "date_published": "2023-04-30T00:39:00", "tags": ["programming", "software development", "adventurerscodex"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Last year <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> reached its 8th birthday. It's a milestone that I honestly didn't believe we'd ever hit, both because eight years is a long time and because&mdash;if I'm honest&mdash;I've never been sure how long this little project would actually last.</p>\n<p>These days Adventurer's Codex is primarily built and maintained by three people: two are founders (including myself) and the third is a friend of ours, and as with any long-lived side-project Adventurer's Codex has occasionally suffered a lack of interest or enthusiasm from all of us. At the beginning the three founders met every week (sometimes twice a week) to build new features and plan the roadmap, later we rarely met at all, and sometimes nearly a year could go by before any of us even thought about Adventurer's Codex at all.</p>\n<p>These days though the app is alive and healthy and with the support of our amazing <a href=\"http://patreon.com/adventurerscodex\">patrons on Patreon</a> we continue to make improvements and release features at a steady pace, and this year we're set to release a slate of amazing features that eight-years-ago-me could only dream of.</p>\n<p>It makes me very happy to say this: the future is very bright for Adventurer's Codex.</p>"}, {"id": "http://brianschrader.com/archive/more-scripting-nonsense-rocket-edition/", "url": "http://brianschrader.com/archive/more-scripting-nonsense-rocket-edition/", "title": "More Scripting Nonsense: Rocket Edition", "date_published": "2023-03-17T23:15:00", "tags": ["programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I was browsing <a href=\"https://gist.github.com/Sonictherocketman\">my Github Gists</a> the other day, as you do, and I came across my first one published back in 2015: <a href=\"https://gist.github.com/Sonictherocketman/11339552\">Rocket.py</a>. This script was one part of a rocket trajectory simulator I built for a class in college. Now I don't remember much about that project, but I do remember that the simulation never actually worked&mdash;or rather that it never worked <em>properly</em>.</p>\n<p><img alt=\"A screenshot of the trajectory over time\" class=\"image-right hide-on-mobile\" src=\"/images/blog/rocket-trajectory.png\" /></p>\n<p>So since I had some idle time on my hands, I decided to spend an evening and take another stab at the project. These days I'm a far better programmer but I remember next to nothing about rocketry, and so I added a bit of a challenge for myself: try to look up as little as possible.</p>\n<p>About two hours later <a href=\"https://gist.github.com/Sonictherocketman/2b3836cb2bc2ca7fdb5283deb67d20c6\">I had this</a>, a new rocket simulation that seems to produce accurate values (if you neglect drag&mdash;more on that later). Now my first simulation only output a set of numerical values for each second of flight, and while those numbers were useful for the class, they're not very interesting to look at so I added a little visualization (drawn with Python's turtle graphics).</p>\n<p>Each phase of the flight is color-coded: green for powered flight, blue for cruising, and red for descent, and the flight statistics seem accurate enough to me when I plug in the numbers for the <a href=\"https://en.wikipedia.org/wiki/Falcon_9\">first stage of SpaceX's Falcon 9</a>, so that bodes well. And at the end of each flight you get a summary readout in the terminal.</p>\n<p>The code is pretty full-featured, and since it uses turtle graphics (and my other <a href=\"/archive/generating-deterministic-procedural-artwork-with-pdraw/\">drawing project</a>) it can even save the trajectories as EPS files for easy printing &amp; saving. You can customize the launch angle, the burn time, specific impulse, fuel and payload weights and even the screen refresh rate using the many CLI flags. The script requires nothing but Python3.10 or later (with the tkinter module included of course), and so it's easy to play with if you're interested.</p>\n<p>All in all it was a fun evening project, and I was especially surprised to find that I remembered a lot more of the intricacies than I expected. I still had to look up the equations for specific impulse, but that was it really. The kinematics stuff was beaten into my head in school so I doubt I'll ever forget that. Really the only thing that gave me any trouble was the drag&mdash;which I decided to omit anyway.</p>\n<p><img alt=\"A screenshot of the stats of the flight in the Terminal\" src=\"/images/blog/rocket-stats.png\" /></p>\n<p>I had initially wanted to add the drag based on the mach number, but my memory failed me on how to do that and late-night searching only threw me down a rabbit hole of further questions. Past me knew a lot more about this stuff than current me does. In the end the drag was a nice-to-have feature anyway and by the time I got to that point it was nearly one in the morning, so I just declared victory and went to bed.</p>\n<p>I have no real point to this post other than to show how much (and how little) I remember about rocket mechanics after all these years and to show off a cool bit of scripting. It's toy projects like this that got me interested in programming and they can be a really fun way to spend an idle evening.</p>\n<hr />\n<p>Disclaimer: I <em>think</em> the values in the simulation make sense, but I didn't spend too much time validating them. If there's any real rocket people out there who find issues with my results, then I'm sorry; now you know one of the reasons I didn't go into aerospace.</p>"}, {"id": "http://brianschrader.com/archive/a-cross-post-life/", "url": "http://brianschrader.com/archive/a-cross-post-life/", "title": "A Cross Post Life", "date_published": "2023-03-10T03:47:00", "tags": ["software", "programming"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I use <a href=\"https://pine.blog/\">Pine.blog</a> for microblogging, and following the Post Once Sindicate Elsewhere strategy, I like to have those updates automatically cross-posted to other platforms like <a href=\"https://micro.blog/sonicrocketman\">Micro.Blog</a> and <a href=\"http://twitter.com/sonicrocketman\">Twitter</a> so that they gain a larger audience, and so that anyone who wants to can follow me no matter which platform or software they prefer.</p>\n<p>Obviously I'm not manually posting to five different sites&mdash;that's what computers are for&mdash;and so I need some way to automate that work. Micro.blog makes most of that very easy since it can automatically ingest content from an RSS feed and not only add it to my microblog there, but also cross-post it to Twitter. That only leaves Mastodon out in the cold.</p>\n<p>In recent months there's been a lot of <a href=\"/archive/on-the-web-the-best-outcome-is-email/\">new activity</a> on Mastodon and I've really enjoyed seeing a larger segment of people discover such a great open-web focused tool. It was well past time that I add Mastodon to my cross-posting workflow, but there was a problem: Mastodon's posts are text only (with links at the bottom&mdash;like Twitter), but Pine.blog outputs HTML (or Markdown). I tried several tools, but each one would mangle my posts or just include the raw HTML as the text, neither of which was an acceptable solution. I needed something custom.</p>\n<p>So I <a href=\"https://gist.github.com/Sonictherocketman/7951ec710b7be1f675e2e95cbcc5220e\">wrote a script</a>! It runs every few minutes on the Raspberry Pi under my desk checking for new posts from Pine.blog and posting them to Mastodon. It starts with the raw Markdown, parses the HTML, strips and appends links, and even keeps track of what has and hasn't been posted before. It's a pretty handy script and I encourage you to check it out if you need something like it. I even made use of one of Mastodon's very handy features: <code>Idepotency-Key</code> which helps prevent duplicate entries from being posted in a short period of time.</p>\n<p>As of today my posts are now <a href=\"https://micro.blog/sonicrocketman\">Live On Mastodon</a>, so you can rest assured that if you follow me there you aren't missing a beat. You'll get all... <strong>five posts</strong> I've made this year!</p>"}, {"id": "http://brianschrader.com/archive/automate-the-boring-stuff-with-chatgpt/", "url": "http://brianschrader.com/archive/automate-the-boring-stuff-with-chatgpt/", "title": "Automate the Boring Stuff with ChatGPT", "date_published": "2023-02-16T22:49:00", "tags": ["programming", "software"], "author": {"name": "Brian Schrader"}, "content_html": "<p>There's been a lot of buzz around ChatGPT lately and most recently the discussion followed <a href=\"https://www.youtube.com/watch?v=jPhJbKBuNnA\">Tom Scott's video</a> in which he describes how he was able to use ChatGPT to generate working code to solve a problem&mdash;including asking it to fix several bugs with its own implementation&mdash;and then write an ad spot for him.</p>\n<p>In the video Tom expresses his disquiet with the ongoing advances in machine learning and goes so far as to predict that \"everything is about to change\" in the same way \"everything changed\" once smartphones came along in the mid-aughts.</p>\n<p>I've enjoyed using text-to-image AIs like <a href=\"https://www.midjourney.com/app/\">Midjourney</a> for a while now, but I'd largely stayed clear of things like ChatGPT. Tom's video though got me curious, and so I logged on to see what all the fuss was about.</p>\n<p>tl;dr I was pleasantly surprised.</p>\n<h3>Introducing DeveloperGPT</h3>\n<p>There are so many things that developers do day-to-day that are at the same time important and dreadfully dull, and like many devs I find myself searching for ways to both save time and automate away as much menial work as I can. It's one of the <a href=\"/archive/take-a-break-script-something/\">reasons I love Bash so much</a>. And while at some companies such work is often pawned off to junior developers in need of experience, as a one-man shop I have definite use for a sort of algorithmic junior developer who could take on some of that less-engaging work. And after watching Tom's video I started to hope that perhaps ChatGPT could be exactly that.</p>\n<p>In order to see if ChatGPT could fill this role, I did what anyone looking to hire a junior developer would do: I gave it an interview.</p>\n<h3>Giving ChatGPT a Coding Interview</h3>\n<p>In total I gave ChatGPT five questions to answer. These questions were almost entirely development related and spanned the range of what I'd expect a junior developer to be able to do given time and access to the internet.</p>\n<details><summary>Test 1: Django Unit Tests: ✅</summary>\n\n<h5>Prompt</h5>\n<p>write for me 4 python django unit test cases that each make a request to /api/users to do the following: create a user record, fetch a user record, delete a user record, and update a user record. Make sure to include partial update using the PATCH method. And be sure to use Python 3.10 compatible code.</p>\n\n<h5>Response</h5>\n<p>Sure, here are 4 Python Django unit test cases that cover the create, fetch, delete, and update functionality of the /api/users endpoint. These test cases assume that you have a Django application with a User model and a corresponding API viewset that handles CRUD operations for users.</p>\n\n<code class=\"python\"><pre>\nfrom django.urls import reverse\nfrom rest_framework.test import APITestCase\nfrom rest_framework import status\nfrom .models import User\n\nclass UserTests(APITestCase):\n    def test_create_user(self):\n        \"\"\"\n        Ensure we can create a new user object.\n        \"\"\"\n        url = reverse('user-list')\n        data = {'username': 'testuser', 'email': 'test@example.com'}\n        response = self.client.post(url, data, format='json')\n        self.assertEqual(response.status_code, status.HTTP_201_CREATED)\n        self.assertEqual(User.objects.count(), 1)\n        self.assertEqual(User.objects.get().username, 'testuser')\n\n        # ... (mine: omitted for brevity) ...</pre></code>\n\n<a href=\"https://gist.github.com/Sonictherocketman/dd7c06c3792a55cba420324bab365b19\">Complete Generated Source Code&#8594;</a>\n\n<p>These test cases cover the basic functionality of the /api/users endpoint and ensure that users can be created, fetched, updated, and deleted. They also cover partial updates using the PATCH method. Note that you will need to update the URLs used in the reverse() function to match the actual URLs for your application.</p>\n</details>\n\n<p>The first test I gave ChatGPT was simply to write a suite of unit tests to verify that a Django User REST API allowed for standard CRUD operations. In general it did very well, even including a test for partial updates via the PATCH method, but it did assume I also wanted it to use Django REST Framework and its implementation of the PUT and POST tests don't include all the correct values. The assumption to use DRF is a fair one, but the other mistake is a red flag.</p>\n<p>Still though it would have saved me from writing the bulk of the code&mdash;assuming it works. I didn't actually test the code.</p>\n<details><summary>Test 2: S3 File Clean Up: ✅</summary>\n\n<h5>Prompt</h5>\n<p>write for me a python function that pulls data from a CSV file containing files that need to be deleted from S3 and that then deletes each file. Include error handling if a file cannot be deleted and return a list of all files that were and were not deleted. Also include suite of three test cases that ensure the function works, that errors are caught, and that the return value is two lists.\n</p>\n\n<h5>Response</h5>\n<p>As an AI language model, I don't have the capability to access files from your computer. However, I can provide you with a sample code that demonstrates how to delete files from S3 using the Boto3 library in Python.</p>\n\n<code class=\"python\"><pre>\n    import boto3\n    import csv\n\n    def delete_files_from_s3(file_path):\n        # Initialize S3 client\n        s3 = boto3.client('s3')\n\n        # Read the CSV file containing file names\n        with open(file_path, 'r') as f:\n            reader = csv.reader(f)\n            files = list(reader)\n\n        # Delete each file from S3\n        deleted_files = []\n        failed_files = []\n        for file in files:\n            try:\n                s3.delete_object(Bucket='your-bucket-name', Key=file[0])\n                deleted_files.append(file[0])\n            except Exception as e:\n                failed_files.append(file[0])\n                print(f\"Failed to delete {file[0]}: {e}\")\n\n        # Return the list of deleted and failed files\n        return deleted_files, failed_files\n</pre></code>\n\n<p>The function takes the path of the CSV file containing file names as input. It reads the file using the csv module and deletes each file from S3 using the delete_object method of the Boto3 client. If a file cannot be deleted, it is added to the list of failed files and an error message is printed. The function returns two lists, one containing the names of deleted files and the other containing the names of failed files.</p>\n\n<p>Here are three test cases to ensure that the function works correctly:</p>\n\n<code class=\"python\"><pre>\n    # Test case 1: All files are deleted successfully\n    deleted_files, failed_files = delete_files_from_s3('file_list.csv')\n    assert len(deleted_files) == 5\n    assert len(failed_files) == 0\n\n    # Test case 2: Some files cannot be deleted\n    deleted_files, failed_files = delete_files_from_s3('file_list_with_errors.csv')\n    assert len(deleted_files) == 3\n    assert len(failed_files) == 2\n\n    # Test case 3: CSV file does not exist\n    deleted_files, failed_files = delete_files_from_s3('nonexistent_file.csv')\n    assert len(deleted_files) == 0\n    assert len(failed_files) == 0</pre></code>\n\n<p>In the first test case, all files are deleted successfully and the function should return a list of 5 deleted files and an empty list of failed files. In the second test case, some files cannot be deleted and the function should return a list of 3 deleted files and a list of 2 failed files. In the third test case, the CSV file does not exist and the function should return empty lists for deleted and failed files.</p>\n</details>\n\n<p>The second test involved writing a simple Python function to clean up stray files in S3 using a list provided by a CSV file. ChatGPT scored pretty well here. It included the asked-for error handling and API interface, but its tests are not correct. The third test especially would crash when the file was opened, but the script does not account for that.</p>\n<p>Once again I didn't run the code, but assuming the use of boto3 is anywhere close to the actual API, it was faster to have ChatGPT write the code than for me to do it.</p>\n<details><summary>Test 3: Two-Column Layout in React: ✅</summary>\n\n<h5>Prompt</h5>\n<p>write for me a JSX file using React that displays a two column layout with a list of appointments in the left column and the appointment details on the right columns. Use the react-bootstrap library for styling and no other libraries. Assume the list of appointments are passed into the component as props.</p>\n\n<h5>Response</h5>\n<p>Sure, here's an example of a JSX file using React that displays a two-column layout with a list of appointments on the left column and the appointment details on the right column, using the react-bootstrap library for styling:</p>\n\n<code class=\"js\"><pre>\nimport React from 'react';\nimport { Container, Row, Col, ListGroup, Card } from 'react-bootstrap';\n    function AppointmentList({ appointments }) {\n      return (\n        &lt;Container&gt;\n          &lt;Row&gt;\n            &lt;Col sm={4}&gt;\n              &lt;ListGroup&gt;\n                {appointments.map((appointment) =&gt; (\n                  &lt;ListGroup.Item key={appointment.id}&gt;\n                    {appointment.title}\n                  &lt;/ListGroup.Item&gt;\n                ))}\n              &lt;/ListGroup&gt;\n            &lt;/Col&gt;\n            &lt;Col sm={8}&gt;\n              &lt;Card&gt;\n                &lt;Card.Body&gt;\n                  &lt;Card.Title&gt;Appointment Details&lt;/Card.Title&gt;\n                  &lt;Card.Subtitle className=&quot;mb-2 text-muted&quot;&gt;Title&lt;/Card.Subtitle&gt;\n                  &lt;Card.Text&gt;\n                    Lorem ipsum dolor sit ...\n                  &lt;/Card.Text&gt;\n                  &lt;Card.Subtitle className=&quot;mb-2 text-muted&quot;&gt;Date&lt;/Card.Subtitle&gt;\n                  &lt;Card.Text&gt;\n                    January 1, 2023\n                  &lt;/Card.Text&gt;\n                  &lt;Card.Subtitle className=&quot;mb-2 text-muted&quot;&gt;Location&lt;/Card.Subtitle&gt;\n                  &lt;Card.Text&gt;\n                    123 Main St, Anytown USA\n                  &lt;/Card.Text&gt;\n                &lt;/Card.Body&gt;\n              &lt;/Card&gt;\n            &lt;/Col&gt;\n          &lt;/Row&gt;\n        &lt;/Container&gt;\n      );\n    }\n\n    export default AppointmentList;</pre></code>\n\n<p>Here, the AppointmentList component takes in a prop called appointments, which is an array of appointment objects. The left column displays the list of appointments using the ListGroup component from react-bootstrap, and the right column displays the appointment details using the Card component. You can customize the appearance of the list and the details as desired by modifying the styling properties of the components.</p>\n</details>\n\n<p>This test surprised me. I had ChatGPT create a two column layout in React for an appointment management application. Explaining a complex UI in words is difficult without visual aids, so I expected some misunderstandings, but it powered through and did exactly what I asked. It failed to add any navigation to the app nor did it use the data inside of the appointments array, so it's not really usable as a component, but it's certainly a good starting point and one I'd be happy to use as a starting template should I ever need such a thing.</p>\n<p>That said, without tooling to make ChatGPT more available during development it would be easier to just write the layout myself.</p>\n<details><summary>Test 4: RSS Parsing in Swift: ✅</summary>\n\n<h5>Prompt</h5>\n<p>write for me a Swift RSS feed parser that takes in a string of XML data and produces a Post object with a title, description, pubdate, and enclosure fields. Use only the swift standard library</p>\n\n<h5>Response</h5>\n<p>Sure, here's an example Swift RSS feed parser that uses the Swift standard library to parse a string of XML data and produce a Post object with a title, description, pubdate, and enclosure fields:</p>\n\n<a href=\"https://gist.github.com/Sonictherocketman/dd7c06c3792a55cba420324bab365b19\">Check out the code here. It's very long.</a>\n</details>\n\n<p>This last test was by far the most involved and open-ended. I asked ChatGPT for a Swift-based RSS Feed Parser and it certainly gave me something close. It used the correct Foundation APIs and even understood the need to concatenate the element text, but it failed to generate a valid test fixture (or even valid XML) and there's absolutely no error handling to speak of.</p>\n<p>That said, it did produce valid XML once I called it out and there's something to be said for such humility. I would certainly use this code as a starting point if I needed to build something like this in the near future.</p>\n<h3>Should I Hire ChatGPT?</h3>\n<p>In general I'd say it performed fairly well as a developer, though its ability to imitate bloggers is very lacking. For the fifth test I tried to have it write this post, but the output didn't sound like me at all and it kept trying to sell itself using features it doesn't have. Overall I'd give ChatGPT a tentative recommendation and would probably hire it contingent of course on a 30-day probationary period to see if it can keep its tendency toward exaggeration in check.</p>\n<h3>It's Not an AI Apocalypse, It's Better</h3>\n<p>I don't really buy the idea that ChatGPT and its ilk will do much to disrupt our everyday lives in a dramatic way. I do however see both it and it's text-to-image cousins as being more and more useful as tools to automate away so much of the boring or tedious work of being a developer or a person on the internet in general.</p>\n<p>Like I said, I already use Midjourney to create images for my D&amp;D campaign and those images have had a significant impact in improving the gaming experience. We were never going to contract an artist for four once-a-week landscapes and so economically speaking the AI has had no external effect. Our D&amp;D games just got marginally better. And that's great!</p>\n<p>ChatGPT seems to me like it could be yet another advantage that enterprising developers would use to enhance their own productivity. If something like ChatGPT ever shipped inside of an IDE like Xcode, I could imagine a whole suite of amazing features (automatic complex refactors, automating test writing, and more). GitHub's Copilot does some of this, but it's in its infancy. In general I'd expect to see tools like ChatGPT improve a developer's productivity and let us focus more on the design and nuances of our code rather than on the tedious implementation; and for that I am <em>very</em> excited.</p>\n<!-- Begin Syntax Stylesheet -->\n<p><link rel=\"stylesheet\" href=\"/bin/highlight.default.min.css\"></p>\n<script src=\"/bin/highlight.min.js\"></script>\n<script>hljs.initHighlightingOnLoad();</script>"}, {"id": "http://brianschrader.com/archive/my-favorite-books-from-2022/", "url": "http://brianschrader.com/archive/my-favorite-books-from-2022/", "title": "My Favorite Books from 2022", "date_published": "2023-02-05T01:35:00", "tags": ["book", "books", "book recommendations", "book review"], "author": {"name": "Brian Schrader"}, "content_html": "<p>As I've <a href=\"/archive/reading-milestones-attention-spans-and-cool-charts/\">mentioned before</a>, 2022 was a watershed year for my reading capacity, and while it is probably a little late in the new year for a retrospective post, I did want to take some time and expressly call out, and recommend, a few of the books I read last year.</p>\n<p>In no particular order, my favorite books last year were:</p>\n<h3>Never the Wind, Francesco Dimitri</h3>\n<p><a href=\"https://www.indiebound.org/book/9781789099812\">This book</a> was an absolute joy to read. It's a coming-of-age, ghost story set in nineties Italy, and it is just so well written and charming that I found myself spellbound by every page. Give this one a go if you're in the mood for some excellent fiction.</p>\n<h3>What Diplomats Do, Brian Sir Barder</h3>\n<p><a href=\"https://www.indiebound.org/book/9781442271630\">This one</a> I read for a yet-unannounced project I'm working on, and while I was hoping the book would be useful to me, I was not prepared for just how much fun it would be to work through. The author, a former U.K. Diplomat, spends as much time explaining the intricacies of overseas diplomacy as he does fictionalizing his time abroad and telling simply incredible stories about how and why certain diplomatic agreements were reached.</p>\n<h3>A Farewell to Arms, Earnest Hemingway</h3>\n<p>I read a lot of Hemingway last year, and <a href=\"https://www.indiebound.org/book/9781476764528\">this one</a> was my favorite. A classic for a reason, and an excellent read. I did also like <a href=\"https://www.indiebound.org/book/9780743297332\">The Sun Also Rises</a>.</p>\n<h3>The Matter of the Gods, Clifford Ando</h3>\n<p><a href=\"https://www.indiebound.org/book/9780520259867\">This one</a>, I'll admit, was a bit tough to get through. It's a treatise on Roman Religion, but it is written by and for historians and classical theologians. I picked this up after scouring the citations for one of <a href=\"https://acoup.blog\">my favorite blogs</a>, and while the book assumes you've already read the ancient classics, and the medieval christian rebuttals to those texts, (which I have not) it was still an interesting read. Ancient mysticism is <a href=\"/archive/history-myth-and-talking-cows/\">fascinating to me</a>, and if the topic sounds enticing to you then I'd recommend skimming through this one. A deep read might be a bit too intense.</p>\n<h3>Existential Physics, Sabine Hossenfelder</h3>\n<p><a href=\"https://www.youtube.com/@SabineHossenfelder\">Sabine</a> is one of my favorite YouTubers, and <a href=\"https://www.indiebound.org/book/9781984879455\">her book</a> is basically just more of the same. The book is a fun romp through many different parts of Theoretical Physics and both acts as a guide to what modern science can, and cannot, hope to explain. It's a good reminder, from the perspective of a physicist, that while science has given us the modern world, it cannot ever hope to solve some very important questions.</p>"}, {"id": "http://brianschrader.com/archive/a-very-special-anniversary/", "url": "http://brianschrader.com/archive/a-very-special-anniversary/", "title": "A Very Special Anniversary", "date_published": "2022-12-13T04:35:00", "tags": ["meta"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Today marks the 10 year anniversary of the first post on this blog. It's been a wild ride writing for here, and I never would have predicted that after all this time I'd still be doing this.</p>\n<p>For posterity, <a href=\"https://web.archive.org/web/20140715043702/http://brianschrader.com/\">here</a> are a <a href=\"https://web.archive.org/web/20170915170554/https://brianschrader.com/\">few links</a> that show how the site itself has evolved over the intervening years, though the site itself isn't really the most important thing to celebrate today.</p>\n<p>Really today is special because it gives me the time to reflect on what writing for this blog has taught me. Since writing the first version of this blog I went from being a college student interested in programming to being a professional and independent software developer. In many ways I have achieved what I set out to do all those years ago, though of course not in the way I originally envisioned.</p>\n<p>Blogging has been a truly transformational hobby for me. Like many people, I write to think. The process of making something &mdash;writing in this case&mdash; helps me solidify my own opinion on a topic and putting my thoughts to words helps me consolidate and organize them in a way that no other way does.</p>\n<p>This blog has also served as an unofficial resumé for me on several different occasions. I often tell people who are just starting out to set up a blog themselves. You don't have to build your own; you can just use Wordpress. But having a public presence filled with your own complex thoughts on a number of topics helps prospective employers understand your inner machinations. It shows them that you know how to think just like a resumé would. My blog and public Github projects have gotten me just as far (if not further) than an actual resumé.</p>\n<p>More than that though, blogging here has given me a chance to get my thoughts out into the world. I'm incredibly fortunate that my writing is occasionally interesting to others and that <a href=\"/archive/why-all-my-servers-have-an-8gb-empty-file/\">a handful</a> of <a href=\"/archive/python-35-and-multitasking/\">my posts</a> have <a href=\"/archive/youtube-has-apparently-reinstated-rss-feeds/\">gone</a> micro-viral <a href=\"/archive/on-the-web-the-best-outcome-is-email/\">thanks to</a> sites like Hacker News. To everyone who clicked on one of my posts: thank you. To all of you who actually read the post: thanks even more.</p>\n<p>The internet continues to be a force we barely understand, but here I've gotten the chance to experiment, try things, fail, and get back up again. And I've tried to bring you all along with me as I've found out the answers to all sorts of questions.</p>\n<p>Thank you all for reading, and here's to another ten years.</p>"}, {"id": "http://brianschrader.com/archive/on-the-web-the-best-outcome-is-email/", "url": "http://brianschrader.com/archive/on-the-web-the-best-outcome-is-email/", "title": "On the Web, the Best Outcome is Email", "date_published": "2022-12-02T01:56:00", "tags": ["open web", "mastodon"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Like many out there, I've been thinking a lot lately about the Open Web. As many readers are no doubt aware, the chaos at Twitter lately has driven a lot of people off the platform and onto more fledgling alternatives. Mastodon in particular has seen huge spikes in growth recently and I doubt that growth will slow until either the platform succumbs to the load or the chaos at Twitter ends and users return to the platform.</p>\n<div class=\"image-right\" style=\"max-width:350px;\">\n<a\n    href=\"https://datasci.social/@estebanmoro/109429814361434072\">\n    <img\n        alt=\"A chart of Mastodon's recent user growth with large spikes around significant Twitter changes\"\n        src=\"/images/blog/moro-chart.png\"\n    />\n</a>\n<center><small>Image credit to <a href=\"https://datasci.social/@estebanmoro/109429814361434072\">Esteban Moro</a></small></center>\n</div>\n\n<p>While these recent developments have been great for Mastodon as a platform, only time will tell if the <a href=\"https://en.wikipedia.org/wiki/Fediverse\">Fediverse at-large</a> will rise to the occasion. There's been a lot of talk about Mastodon.social the website, but the real story is the sudden surge in usage of the underlying ActivityPub federation protocol that powers it. Very briefly, ActivityPub is a protocol that allows for disparate social media sites to talk to each other, sharing likes, posts, follows, and other social media interactions. Widespread adoption of such a standard on the Web would make it possible to finally break the tyranny of the <a href=\"https://en.wikipedia.org/wiki/Network_effect\">Network Effect</a> and allow for a wide swath of new Social Networks to emerge. These new networks would be free of the burden to attract a \"critical mass\" of users to remain viable as every user would be able to communicate and interact with users of any other ActivityPub-capable social platform.</p>\n<p>The hurdle that Mastodon &mdash;and the swath of other ActivityPub sites like it&mdash; must overcome is that they all collectively must reach a critical mass in order to become viable in today's siloed social media landscape. In order to free us from critical mass, Mastodon must attain it.</p>\n<p>The fog of current events leave many questions so far unanswered, and only time will tell what path we choose to follow, but for now it is not known whether or not Mastodon will ever reach this critical point and become a sizable player in the social media space. Tumblr's plans to <a href=\"https://techcrunch.com/2022/11/21/tumblr-to-add-support-for-activitypub-the-social-protocol-powering-mastodon-and-other-apps/\">enable ActivityPub support</a> will certainly help the broader Fediverse grow, but I doubt it will be enough on its own to push the project over the edge and into relevancy with the general public, but only time will tell.</p>\n<h2>Sailing Rough Seas</h2>\n<p>I've been a <a href=\"/tags#tag-open%20web\">vocal supporter of the Open Web</a> for over a decade, but as anyone with a strongly-held and niche belief knows, it can be exhausting to see the world march on impartial to your goals. At my worst, I've grown rather jaded about the possibility of a truly Open Social Web. Like I'm sure many dentists, if given the chance, would choose to wave a magic wand and force all of us to floss our teeth more, I would &mdash;if I could&mdash; force social media sites to interoperate using a freely open standard, but that's just not how the world works.</p>\n<p>For years, I've thought the momentum had settled and that we would &mdash;given no other outside forces&mdash; be on a path to ever-increasing centralization on the Web, both on and off social media. There are of course many technical solutions to centralization, but I'll admit that I believe the forces of power, control, and profits too strong a wind for the little boat of federation to sail. The only other boats to make the journey set out long ago: both web browsers and email were products of another era on the Internet and I doubt they could come up in this one.</p>\n<p>I now hold that the most likely path to achieving a truly interoperable Open Web is through government regulation. I've <a href=\"/archive/house-judiciary-committee-recommends-interoperable-social-media/\">written before</a> about how Congress is mulling over the idea of mandating Social Media interoperability and I support that effort, but regulation is a difficult stick to wield. The backbones of the modern Web: the web browser and email provider, didn't need laws to force them into interoperability. They were designed as such from the start, and that still is the best way for a technology to progress. Like the situation with <a href=\"https://en.wikipedia.org/wiki/Communications_Act_of_1934\">phone networks last century</a>, regulation might be the only force powerful enough to push a Social Web forward. I still hope that social media follows a similar path and that we all hold hands and merrily walk into the sunset of a federated world, but I believe that things are likely too far gone; that it never can or will happen like that again.</p>\n<p>I have grown fairly confident in this belief, and like any belief too strongly-held it blinded me to what happened next.</p>\n<h2>An Impetus of Change</h2>\n<p>Elon Musk's chaotic and seemingly-inept takeover of Twitter shocked many people into giving up on the platform. Thousands upon thousands fled to whatever refuge they could find. Mastodon was an obvious choice for techies to flock to, but its Mastodon's growing segment of less technical users that interests me. Perhaps this new flood of growth holds &mdash;and assuming the platform in general and <a href=\"https://mastodon.social\">mastodon.social</a> in particular can withstand it&mdash; there exists a real possibility that the platform gains critical mass and enters public awareness. It may already be arriving there. The San Diego Union Tribune ran a story last sunday (in print) aiming to help elderly users navigate the migration to Mastodon. That was something I certainly hadn't seen coming.</p>\n<p>I'll say this: if the trend holds and Mastodon does continue growing, and if it does gain a foothold as a small but nevertheless notable social platform it would mean that Elon fumbled his way into giving the Open Web the single biggest gift it has received in a decade and certainly the most unintentional one. It would be a poetically ironic moment indeed.</p>\n<p>Again though, I'll admit that I am skeptical such a trend will hold. Social media platforms come and go and small ones rarely stick around very long. Mastodon will of course still exist &mdash;the Fediverse cannot be killed&mdash; but falling out of public consciousness would be a de facto death.</p>\n<h2>A Sobering Reality</h2>\n<p>Whether the crazed antics of one man can disrupt the seemingly natural flow of centralization on the Web is doubtful, and I still believe that is more likely than not that regulation will be required to force social media companies to interoperate. What's more, it isn't clear that such regulation could or would come to be in the United States. It might; it might not. The future, as always, remains unclear.</p>\n<p>That said, Mastodon (and ActivityPub more broadly) have the potential to remake social networking on the Web in a magnitude that I don't think many fully realize. Indeed some do realize it, but they are often gripped by a naïve optimism I simply cannot share: a blue-sky fantasy that could never come to pass. The broader narrative though seems to take the opposite view: that even if Mastodon (and the Fediverse) were to become relevant, that it simply wouldn't matter very much. They argue that federation and decentralization simply cannot compete with monied interests and that over time the Open Web would re-centralize into one or two big players. Indeed I find myself sympathetic to this view, even though I don't like its conclusions.</p>\n<p>I, however, would like to offer a third option for the future of the Social Web: one that is both radically transformative and yet utterly boring at the same time.</p>\n<h2>What If It's All Just Email, Man?</h2>\n<p>I love email. I genuinely do. I love it in a way that often raises eyebrows among nearly everyone I encounter, even my fellow techie-types. Why do I love email? Because it, like the Web itself has remained true to the promise of the Internet even after it made unavoidable contact with the real world. Let me explain:</p>\n<p>Email, like the Web itself, is a federated system. No one controls the whole thing and while there are a few <em>very</em> large players in the Email space, none of them has the ability to direct its evolution outright. Gmail is huge and partially non-standard, but the system still works. Since its inception, anyone with an email address has been able to email anyone else so long as they know or can guess the email address they want to reach. It's not a perfect system, no (see: spam, blocklisting, etc) but it's damn good and email has utterly transformed how the world does business and it has democratized communication more than almost any other Internet technology to date.</p>\n<p>What's more, barring some technical hurdles, anyone with some funding can start an email hosting company. And while it's not practical for single individuals to run their own email server today, it is technically possible and many people indeed do just that. Every year <a href=\"https://www.hey.com\">new Email apps and services emerge</a> while others die. The ecosystem is dynamic, healthy, and growing with every new entrant to the Internet. The standard is open, widely available, and &mdash;unlike social media accounts&mdash; truly universal. Nearly everyone on the Internet has an email address, and that seems set to be true for decades to come.</p>\n<p>We need no better signifier of Email's complete and utter domination today than the simple fact that email clients come installed on almost every operating system known to man. That's only possible because of its decentralized, universal, and long-lived history. I long for the day that an ActivityPub-powered \"Social\" app ships with macOS and Windows like Mail does today.</p>\n<div class=\"image-center\"><center>\n<a\n    href=\"https://datasci.social/@estebanmoro/109429814361434072\">\n    <img\n        alt=\"A truly federated macOS dock\"\n        src=\"/images/blog/federated-dock.png\"\n    />\n</a>\n<small>When a mail-like \"Social.app\" ships on macOS, we will have won.</small></center>\n</div>\n\n<p>Now, most people I talk to about this tell me they hate their email. It's a spam and junk-filled box full of nothing but coupons, ads, and check-ins from their boss. And I agree. It is just that. Indeed one of the problems with decentralized and federated technologies is exactly that: they're filled with spam, junk, and mixed uses. But that mundanity is the true magic.</p>\n<p>Email has so throughly engrained itself in the modern world that we've stopped seeing any of the good it has brought and only the bad; a truer mark of success there isn't (see: liberal democracy, the post office, web browsers, the phone network, etc).</p>\n<p>Should federated social media succeed: whether by natural growth, by chaos at Twitter, or by eventual regulation, its ultimate fate can and should be the fate of email. If somehow social media is largely run by enormous companies  surrounded by a large collection of smaller providers all talking to each other over the same interoperable, open protocol then the Open Web will have won. Of course this won't be a win for those who imagine a truly decentralized Internet devoid of large actors, but it will be a success as judged by the best examples the Internet has so far given us.</p>\n<p>The Social Web of the future isn't complete decentralization or a network of innumerable federated micro-instances. It isn't a Web powered by anonymous cryptocurrencies. It may yet be the Web we have now, should regulatory attempts fail and natural forces be insurmountable. But if things go right and the stars align the Social Web could become like Email, and that would be transformationally mundane.</p>"}]}