{"home_page_url": "https://brianschrader.com", "version": "https://jsonfeed.org/version/1", "description": "Thoughts, and ramblings about technology, programming, history, and whatever else I'm interested in.", "feed_url": "https://brianschrader.com/feed.json", "title": "BiteofanApple by Brian Schrader", "items": [{"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/an-agency-that-protects-data/", "tags": ["law", "data protection", "privacy", "Kirsten Gillibrand"], "content_html": "<p><a href=\"https://www.gillibrand.senate.gov/news/press/release/confronting-a-data-privacy-crisis-gillibrand-announces-landmark-legislation-to-create-a-data-protection-agency\">New York Senator Kirsten Gillibrand</a> has just announced a bill to create a new Data Protection Agency, which would be in charge of regulating... well data protection.</p>\n<p><a href=\"https://www.gillibrand.senate.gov/imo/media/doc/2.11.2020_Data%20Protection%20Act.pdf\">From the bill</a>:</p>\n<blockquote>\n<p>The privacy of an individual is directly affected by the collection, maintenance, use, and dissemination of personal data.</p>\n<p>In order to protect the privacy of individuals, it is necessary and proper for Congress to regulate the collection, maintenance, use, processing, storage, and dissemination of information.</p>\n</blockquote>\n<p>While I haven't finished reading the actual bill yet, I applaud Senator Gillibrand for proposing the idea. Her bill lays out what the new agency would focus on: regulating how data is collected, used and processed. She also explicitly carving out, what she calls, \"High-Risk Data Practices\" that would require extra protections.</p>\n<p>Some High-Risk Practices (formatting mine):</p>\n<blockquote>\n<p>The term \"high-risk data practice\" means an action by a covered entity that involves...</p>\n<ul>\n<li>any processing of biometric data for the purpose of uniquely identifying an individual...</li>\n<li>processing the personal data of an individual that has not been obtained directly from the individual...</li>\n<li>processing which involves tracking an individual’s geolocation...</li>\n</ul>\n</blockquote>\n<p>According to the Senator's own press release on the topic:</p>\n<blockquote>\n<p>2. [The Agency would maintain] the most innovative, successful tech sector in the world by ensuring fair competition within the digital marketplace.</p>\n<ul>\n<li>The agency would promote data protection and privacy innovation across sectors, developing and providing resources such as Privacy Enhancing Technologies (PETs) that minimize or even eliminate the collection of personal data.</li>\n<li>The agency would ensure equal access to privacy protection and protect against “pay-for-privacy” or “take-it-or-leave-it” provisions in service contracts—because privacy, including online privacy, is a right that should be enforced.</li>\n</ul>\n<p>3. [The Agency would prepare] the American government for the digital age.</p>\n<ul>\n<li>The agency would advise Congress on emerging privacy and technology issues, like deepfakes and encryption. It would also represent the United States at international forums regarding data privacy and inform future treaty agreements regarding data.</li>\n</ul>\n</blockquote>\n<p>From my reading, it looks like this agency would also have the teeth to enforce its rules as opposed to the current FTC rules which companies basically ignore. An agency with this new authority would be utterly transformative for the U.S. Tech Sector and for the lives of everyday citizens.</p>\n<p>I fully support this bill.</p>", "date_published": "2020-02-14T02:30:00-08:00", "title": "An Agency that Protects Data", "id": "http://brianschrader.com/archive/an-agency-that-protects-data/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-sobering-thought/", "tags": ["climate change", "tree planting", "2050"], "content_html": "<p>Rarely do silver bullets actually exist; the truth resists simplicity. <a href=\"https://teamtrees.org\">Tree planting often</a> looked at as a cheap, effective, and catch-all solution to combatting carbon emissions, but that just isn't true. It's two of those things, sure, but it's not all we need to do. Don't get me wrong, I'm a huge fan of planting trees to help trap and store carbon emissions, but it can't be the only thing we do.</p>\n<p>Earlier this morning, I watched a <a href=\"https://www.youtube.com/watch?v=EXkbdELr4EQ&amp;app=desktop\">video</a> from <a href=\"https://www.economist.com/films/2019/09/18/climate-change-the-trouble-with-trees?linkId=100000008031533\">The Economist</a> which covered the topic pretty well (there's even more videos and <a href=\"https://www.economist.com/films/2019/09/18/climate-change-the-trouble-with-trees?linkId=100000008031533\">information in the linked article</a>). While the through-line of the video is that tree planting, when done correctly, can have huge benefits and help combat climate change, Professor Simon Lewis drives home a really sobering point <a href=\"https://youtu.be/EXkbdELr4EQ?t=515\">right at the end</a> (emphasis mine):</p>\n<blockquote>\n<p>Ultimately though, the trouble with trees tackling climate change is space. <strong>There’s just not enough land in the world</strong> to plant enough trees to offset all the carbon emissions from fossil fuels. We could say, let’s restore forest on every single piece of land that used to have forest on from before agriculture. And if we did that it would be about 200bn tonnes of carbon. Now that sounds a lot, but to put it in context, <strong>that’s about 20 years worth of emissions</strong> at present rates.</p>\n<p>- Professor Simon Lewis</p>\n</blockquote>\n<p>So go ahead, plant trees.* Just know: we need a lot more than just trees.</p>\n<div class=\"footnote\">\n* <a href=\"https://teamtrees.org\" title=\"TeamTrees\">TeamTrees</a> is a super easy way to donate to tree planting, btw.\n</div>", "date_published": "2019-11-11T04:18:00-08:00", "title": "A Sobering Thought", "id": "http://brianschrader.com/archive/a-sobering-thought/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/high-tech-empires/", "tags": ["social web", "software", "facebook", "social media"], "content_html": "<p><a href=\"https://stratechery.com/2019/tech-and-liberty/\">Ben Thompson &#8594;</a></p>\n<blockquote>\n<p>In the long run, though, it is very problematic that such a powerful player in our democracy has no accountability. Liberty is not simply about laws, or culture, it is also about structure, and it is right to be concerned about the centralized nature of companies like Facebook.</p>\n</blockquote>\n<p><a href=\"https://www.manton.org/2019/11/06/kill-the-algorithm.html\">Manton Reece &#8594;</a></p>\n<blockquote>\n<p>Platforms that have as many problems as Facebook does can always be improved, but by design they can never be good enough because their size alone is one of the problems.</p>\n</blockquote>\n<p>A difference in scale can become a difference in kind. Facebook and other large Tech companies have more users than most nations have citizens. We look down on autocratic governments, and will hopefully continue to do so. We can't forget that these large corporations are a new form of the same thing.</p>\n<p>We have a words to describe organizations of large enough size that exert control over vastly different groups of people and that aren't answerable to their constituents. We call them autocracies; we call them empires.</p>", "date_published": "2019-11-07T01:20:00-08:00", "title": "High-Tech Empires", "id": "http://brianschrader.com/archive/high-tech-empires/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/remembering-things-is-hard/", "tags": ["code", "software", "preflight", "git"], "content_html": "<p>I'm not very good at remembering things, even simple things, and I'm even worse at grinding (doing a simple or repetitive task more than once). That's one reason why I love being a developer: often times, I can script simple, repetitive, and common tasks.</p>\n<p>When it comes to development, although most of my projects leverage some form of automated continuous testing and linting, by the time I've pushed up my code and the tests have run, I've moved on to some other task. This means that when my code has a failing test or a linting error, I have to stop the new thing that I'm doing, stash my changes, and fix the error. I <em>should</em> remember to run the tests before I push my code, but I never do.</p>\n<p>So in lieu of doing the hard work to remember to run the tests and becoming a better person in the process, I've written a <code>pre-commit</code> script that runs before I commit my code. That way I can't commit my code without fixing the error, or explicitly ignoring it (with the <code>-n</code> flag).*</p>\n<div class=\"footnote\">\n* This also helps avoid the unprofessional looking \"Fixes linting\" commits.\n</div>\n\n<hr />\n<p>Here's my <code>.git/hooks/pre-commit</code> file for any Django project. Give it a shot yourself and let me know if it helps you write better code.</p>\n<pre><code class=\"bash\">#! /bin/bash\nset -e;\nlog() { echo \"[$(date)] $1\"; }\n\ncat << EOF\n-----------------------------------\nRunning the tests...\nYou might want to get a coffee. ☕️\n-----------------------------------\nlog \"Linting the code...\"\nflake8\nlog \"Running the tests...\"\n./manage.py test\nlog \"Done.\"\n</code></pre>\n\n<p><link rel=\"stylesheet\" href=\"http://yandex.st/highlightjs/8.0/styles/default.min.css\">\n<script src=\"http://yandex.st/highlightjs/8.0/highlight.min.js\"></script>\n<script>hljs.initHighlightingOnLoad();</script></p>", "date_published": "2019-11-03T18:59:00-08:00", "title": "Remembering Things is Hard", "id": "http://brianschrader.com/archive/remembering-things-is-hard/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/finally/", "tags": ["pine.blog", "open web", "rss"], "content_html": "<p>Today marks the release of <a href=\"https://blog.pine.blog/2019/10/fall-2019-update-hosted-blogs/\">Pine.blog's Fall Update</a>. It's a release I've been working on for months now and it feels great to finally get it out into the world. With this release, Pine.blog is now what I'd wanted it to be when I started <a href=\"/archive/a-vision-of-the-open-web/\">dreaming of what a the open web could do</a>. On Pine.blog, you can follow your interests, keep up with the latest news, and join the conversation by starting a blog. I can finally say that the core features I want are in place.</p>\n<p>Obviously my goals for Pine.blog have expanded since I originally thought of the idea in 2014 (and began writing it in 2016), so there's still <strong>a lot to do</strong>.</p>", "date_published": "2019-10-08T01:34:00-08:00", "title": "Finally", "id": "http://brianschrader.com/archive/finally/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-new-adventure/", "tags": ["photography", "hobbies", "money sink", ""], "content_html": "<p>Last week, I bought a camera. I've wanted one for a while, but I'd never really looked around for something that would fit my needs. A few of my <a href=\"https://www.instagram.com/photorayg/\">friends</a> and <a href=\"http://www.museofadventure.com\">family</a> are actual photographers, and I knew that I didn't want to do what they do. I'd be carelessly jumping into a deep end to swim with reel big fish.</p>\n<p>I haven't owned a dedicated camera in over a decade. Ever since 2010, the only camera I've owned came with an iPhone attached to it. However, while the iPhone X's camera is great, it's just not enough for a whole myriad of situations, and in the last year I've found myself ever more limited by what my phone's camera could and couldn't do.</p>\n<p>There's an old adage: \"the best camera is the one you have with you\", and if I was going to have this camera with me, even a fraction of the time that I have my phone with me, it had to meet some pretty strict qualifications: It had to be really versatile (inter-changeable lenses was a hard requirement), it had to be compact enough to take almost anywhere, and it had to be a camera that could grow with me as I delve into this new-fangled world. So I talked to some people, read a bunch of articles, watched a bunch of reviews, and got this:</p>\n<div style=\"text-align:center;\">\n    <img\n        alt=\"My new camera\"\n        src=\"/images/collections/a6000/camera-web.jpg\"\n        style=\"width:300px;margin-left:auto;margin-right:auto;\"\n    />\n    <caption>\n        <a href=\"https://www.amazon.com/Sony-Mirrorless-Digitial-3-0-Inch-16-50mm/dp/B00I8BICB2/ref=sr_1_7?keywords=sony+a6000&qid=1566087531&s=gateway&sr=8-7\" title=\"The Sony α6000\">\n            The Sony α6000\n        </a>\n    </caption>\n</div>\n\n<p>I've heard from quite a few people that Sony's α6000 and α6400 are really good for people who want a great camera, but aren't willing to dive into DSLRs. I don't know much about that second bit, but that description matched me to a T. As I've only had it a week so far, my opinions are still riddled with <a href=\"https://www.urbandictionary.com/define.php?term=Ney%20Toy%20Syndrome\">Ney Toy Syndrome</a>. That said, I really like this camera. It's small and light enough to fit in the spare pocket of my daily carry bag, and it uses Sony's E-Mount which means that there's tons of compatible lenses, making it really versatile.</p>\n<p>I ended up getting the α6000 mostly because of the price. The α6400 was more than I wanted to spend and anything below the α6000 didn't have a viewfinder, which was a dealbreaker. I'm still rocking the kit lens for now, but I plan on getting a 50/55mm Prime lens pretty soon. Before that though, I need to get a much more intuitive grasp of how to properly use what I have, and it'll probably take me a while to get the basics down.</p>\n<h3>A Checkpoint in Time</h3>\n<p>While I'll probably be posting most of the good shots I take to my <a href=\"https://photos.brianschrader.com/\">photoblog</a>, below are a few of my favorite shots from the last week. I'm posting them here so that they serve as a record of my skills as a photographer right now. Hopefully, as time goes on and my skills improve, I'll look back on these pictures like I look back on old code I've written: with fond memories, and mild disgust.</p>\n<div style=\"text-align:center;\">\n    <a href=\"/images/collections/a6000/moonlight.jpg\" title=\"Moonlight - Full Image\">\n        <img\n            alt=\"Moonlight\"\n            src=\"/images/collections/a6000/moonlight-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/bark.jpg\" title=\"Bark - Full Image\">\n        <img\n            alt=\"Bark\"\n            src=\"/images/collections/a6000/bark-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/private.JPG\" title=\"Private - Full Image\">\n        <img\n            alt=\"Private\"\n            src=\"/images/collections/a6000/private-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n    <a href=\"/images/collections/a6000/tank.JPG\" title=\"Tank - Full Image\">\n        <img\n            alt=\"Tank\"\n            src=\"/images/collections/a6000/tank-web.jpg\"\n            style=\"display:inline-block;width:350px;margin-left:auto;margin-right:auto;\"\n        />\n    </a>\n</div>", "date_published": "2019-08-18T01:25:00-08:00", "title": "A New Adventure", "id": "http://brianschrader.com/archive/a-new-adventure/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/dont-ban-infinite-scrolling-license-engineers-instead/", "tags": ["software engineering", "ethics", "legal", ""], "content_html": "<p>Yesterday, the <a href=\"https://www.theverge.com/2019/7/30/20746878/josh-hawley-dark-patterns-platform-design-autoplay-youtube-videos-scrolling-snapstreaks-illegal\">Verge reported that Sen. Josh Hawley sponsored</a> a bill that aims to reduce the tech industry’s use of \"addictive design\" practices by putting a ban on features like infinite scrolling and autoplaying video. While I applaud Congress for focusing on this important issue, the proposed solution is both naive and unproductive. When a surgeon is accused of malpractice, the appropriate solution is not to ban their use of the scalpel, it's to revoke their license.</p>\n<p>I have long argued that Software Engineers (especially those at large companies that affect the lives of millions of people) <a href=\"/archive/software-engineering/\">should be licensed</a>. Requiring a license to practice Software Engineering would finally place software in the realm of the other classical engineering fields and require practitioners to use their skills ethically and for the benefit of society. It would also help educate engineers on the risks and trade-offs with the decisions they make and give the government a lever to pull when trying to encourage ethical practices across the industry. Likewise, licensed engineers are able to refuse to implement unethical or unsafe designs when they fear that they could lose their license.</p>\n<p>One common argument against this point is that the tech industry is filled with lots of independent developers and others who operate relatively small businesses and that licensing them would put an damper on overall innovation in the industry. However, while we do often require Civil Engineers to have a license, we don't apply the same logic to carpenters, and we can apply the same kinds of criteria to Software Enginering licensure.</p>\n<p>We've required licenses for those practicing classical Engineering, Medicine, and Law for a long time<sup>1</sup>, and those licenses have helped governments and the licensed individuals themselves steer industry practice away from things that can be considered unethical or unsafe. Instead of trying to take powerful tools away from Engineers, we should instead be focused on enabling and educating them to make ethical and societally beneficial decisions. The Internet is part of the infrastructure of our modern world, so let's ensure that the people who build and maintain it have society's best interests at heart.</p>\n<div class=\"footnote\">\n<sup>1</sup> As an aside, we even license hairdressers and locksmiths. If unlocking cars or cutting hair requires a license, why doesn't building software that impacts 20% of the world's population?\n</div>", "date_published": "2019-07-31T17:46:00-08:00", "title": "Don't Ban Infinite Scrolling, License Engineers Instead", "id": "http://brianschrader.com/archive/dont-ban-infinite-scrolling-license-engineers-instead/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-social-web/", "tags": ["open web", "social media", "pine.blog"], "content_html": "<p>Things have been quiet here recently, and that's largely because I've been really busy working on lots of cool new stuff for <a href=\"https://pine.blog/\">Pine.blog</a>. While the last few months have been full of steady progress, there's still a ways to go before the next set of features are ready for the world. If everything goes according to plan, the next major release should allow premium users to start their own blog on the site.</p>\n<p>So far, Pine.blog has been mostly focused on being a good feed reader, and while I think it is, there's so much more that can be done with feeds and blogs than just read them.</p>\n<h3>Feed Readers are the First Step</h3>\n<p>I've wanted Pine.blog to support custom blogs since the beginning, and that's largely because I think that by making it easier to both read and write on the open web, we can give people a viable alternative to more traditional social networks and offer them an escape from the problems those platforms have.</p>\n<p>Using tools and technologies that have existed for years, the web itself can be a social network, but in order for people to embrace that idea there have to be easy-to-use tools that are new and powerful, but also familiar and approchable, and importantly, there also have to be people to talk to; the web has to <em>feel</em> like a social network.</p>\n<h3>Pushing Forward</h3>\n<p>One of the things I've come to strongly believe is that as developers (or as anyone who makes a thing) we can work to push the world toward we think it should be, and I think that the Web can and should be our shared social network.</p>\n<p>This is why I'm so excited by what I see as the future for Pine.blog. If we want people to move off of the platforms we think are the cause of so many problems in our world, we need to give those people a place to go. Most people aren't going to start a blog and use a feed reader unless we, as the people with the skills to do so, make the Social Web better than Social Media.</p>", "date_published": "2019-07-28T06:35:00-08:00", "title": "The Social Web", "id": "http://brianschrader.com/archive/the-social-web/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/updates-on-using-nsoperation/", "tags": ["development", "nsoperation"], "content_html": "<p>Last time <a href=\"/archive/i-love-nsoperation/\">I talked about NSOperation</a>, I mentioned that I really liked using it to do things like networking and asynchronous operations in my app. Well, I've made a few tweaks to my <code>BackgroundNetworkingController</code> recently (alas a new name was not among them) and I think the new version is even more readable and expressive.</p>\n<p>For those who don't know, NSOperation (or just Operation in Swift) is a class that when paired with (NS)OperationQueue allow you to order and track long running and often asynchronous tasks in your apps. You can use it to do API calls, animate transitions, walk a user through a process, and a lot more.</p>\n<p>In my last blog post I demoed this piece of code as an example of how I use Operations in the Pine.blog app.</p>\n<p><code class=\"swift\"><pre>\nfunc updateTimeline() {\n    let reauthorize = TokenReauthorizationOperation()\n    let fetchTimeline = FetchTimelineOperation()\n    fetchTimeline.delegate = self\n    fetchTimeline.addOperation(reauthorization)\n    BackgroundQueueController.queue?.addOperations(\n        [reauthorize, fetchTimeline],\n        waitUntilFinished: false\n    )\n}\n</pre></code></p>\n<p>And while that example is pretty straight forward, I knew it could be better. There's so many times when I just need to tell my app: do these things in the background, in this order, and tell me when you're done (and let me know if something comes up). Operations allow me to do that, but setting up delegates and adding dependencies seems like cruft that I don't really want to care about.</p>\n<p>With that in mind, I added a new set of methods to my queue controller: <code>performInSeries(operations:)</code> and <code>performInSeries(operations: with:)</code>. Using those instead, the above example becomes:</p>\n<p><code class=\"swift\"><pre>\nBackgroundNetworkingController.performInSeries(\n    operations: [\n        TokenReauthorizationOperation(),\n        FetchTimelineOperation(),\n    ],\n    with: self\n)\n</pre></code></p>\n<p>This code sets up the given operation with each previous operation as a dependency and assigns their delegate to <code>self</code>. Reading this it becomes pretty clear that I want these operations to be performed in the order I specify and I want them to alert me if anything comes up, which is exactly what I want.</p>\n<p>Even the most complex uses in all of the Pine.blog app still retain their readability (aside from array concatenation). This example reauthorizes the user's token, then fetches the most recent posts in  each of the user's timelines, finds any new posts that the user has liked, and finally calls the given completionHandler to let the app know that it has completed updating its data.</p>\n<p><code class=\"swift\"><pre>\nBackgroundNetworkingController.performInSeries(\n    operations:\n        [ ReauthorizationTask() ]\n        + timelines.map { FetchNewestPostsInTimeline(timeline: $0) }\n        + [ FetchLikesOperation(), BlockOperation { completionHandler?(self.fetchResult) }],\n    with: self\n)\n</pre></code></p>\n<p>There's still a bit further I can go with this, but I'm really happy with the readability and clarity improvement that these changes have made to my codebase.</p>\n<p><link rel=\"stylesheet\"\n      href=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/styles/default.min.css\">\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.13.1/highlight.min.js\"></script><script>hljs.initHighlightingOnLoad();</script></p>", "date_published": "2019-06-29T19:31:00-08:00", "title": "Updates on using NSOperation", "id": "http://brianschrader.com/archive/updates-on-using-nsoperation/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/lots-of-little-things/", "tags": ["pine.blog", "update"], "content_html": "<p>Recently I've been focused on finishing the next set of major features for <a href=\"https://pine.blog/\">Pine.blog</a>, but as happens from time-to-time I got a bit distracted and ended up knocking out a whole lot of little features that I've wanted to build for a long time. Today's update was entirely server-side, and I'll have a new update for the iOS app coming in a few days.</p>\n<h3>Wordpress Enhancements</h3>\n<p>In addition to making a lot of things just plain faster, I've also added a new <a href=\"https://pine.blog/kb/add_external_blog\">feature for Wordpress users</a> so that when users post on their blog, Wordpress will automatically let Pine.blog know and their posts show up much more quickly in their (and other user's) timelines.</p>\n<p>For me, this feature involved yet another foray into undocumented XML-RPC APIs from over a decade ago. So much of the information just isn't easy to find anymore so building features that use them is more archeology than software development.</p>\n<h3>API Keys and Webhooks</h3>\n<p>Users that want to write scripts using Pine.blog (or build custom applications) can now get an API key quickly and easily that lets you access the full range of Pine.blog APIs.</p>\n<p>For those who want to dive even deeper into their data with Pine.blog, users can now add a Webhook URL if they'd like to receive updates from Pine.blog whenever a feed they're subscribed to changes.</p>\n<h3>API Documentation Revamp</h3>\n<p>I've completely redone the Pine.blog API documentation. Hopefully this makes it much easier for developers to discover and use the Pine.blog/Feed Directory API. The new documentation includes much more detailed information about the throttling limits, what to expect from each endpoint, and much much more. If you're looking to use the Pine.blog/Feed Directory API in your app or service <a href=\"https://pine.blog/api/documentation\">you can find out more from the documentation here</a>.</p>\n<p>A lot of these developer-focused features are test runs for much broader features that I have cooking in the background. Meanwhile I'm trying to keep the majority of what I do with Pine.blog a lot more user-focused.</p>", "date_published": "2019-06-29T04:02:00-08:00", "title": "Lots of Little Things", "id": "http://brianschrader.com/archive/lots-of-little-things/"}], "author": {"url": "https://brianschrader.com", "name": "Brian Schrader", "avatar": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "icon": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}