{"home_page_url": "https://brianschrader.com", "version": "https://jsonfeed.org/version/1", "description": "Thoughts, and ramblings about technology, programming, history, and whatever else I'm interested in.", "feed_url": "https://brianschrader.com/feed.json", "title": "BiteofanApple by Brian Schrader", "items": [{"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-people-vs-democracy/", "tags": ["democracy", "politics", "technology"], "content_html": "<p>I just finished <a href=\"https://www.amazon.com/People-vs-Democracy-Freedom-Danger/dp/0674976827/ref=sr_1_1?ie=UTF8&amp;qid=1526762388&amp;sr=8-1&amp;keywords=the+people+vs+democracy\">Yascha Mounk's excellent book <em>The People vs. Democracy</em></a>. In it Yascha talks about how the two main parts of a Liberal Democracy are now at odds with each other, not working together.</p>\n<blockquote>\n<ul>\n<li>A <em>democracy</em> is a set of binding electoral institutions that effectively translate popular views into public policy.</li>\n<li><em>Liberal</em> institutions effectively protect the rule of law and guarantee individual rights such as freedom of speech, worship, press, and association to all citizens (including ethnic and religious minorities).</li>\n<li>A <em>liberal democracy</em> is simply a political system that is both liberal and democratic &mdash; one that both protects individual rights and translates popular views into public policy.</li>\n</ul>\n<p>...Democracies can be illiberal...[especially] where most people favor subordinating independent institutions...or curtailing the rights of minorities they dislike. Conversely, liberal régimes can be undemocratic, despite having regular competitive elections.</p>\n</blockquote>\n<p>I've been thinking a lot about that distinction lately. Democracy is kind of a holy word in our society, a thing that cannot be bad, but as Yascha points out, the original democracy in Athens was known for executing writers and philosophers, and not extending suffrage past its male elites. It's the combination of Enlightenment era liberalism and democracy that gives us the systems we see around us today. Yascha's main point is that this combination seems to be falling apart all over the world as systems either become less democratic, or less liberal, or both at the same time.</p>\n<p>Yascha also dives into the possible causes of this split, and how to fix it; from social media to housing prices. It's a fascinating read, and it really changed the way I think about today's political climate for the better. I haven't torn through a book that quickly in a long time.</p>", "date_published": "2018-05-19T13:46:00", "title": "The People vs. Democracy", "id": "http://brianschrader.com/archive/the-people-vs-democracy/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/safaris-websocket-stream-view/", "tags": ["development", "software", "programming", "adventurer's codex", "xmpp"], "content_html": "<p>I've mentioned before that <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> uses XMPP over WebSockets for it's live-chat and party features, and we're planning to add lots more of these kinds of features in the future. That being said, as a developer, I've had a pretty difficult time building features that rely on WebSockets because it's kind of annoying to see exactly what is being sent and received over the connection. I know that Chrome has some features to help with developing WebSocket applications, but I've never had a good experience with them, and I use Safari as my default browser for both casual use and for web development.</p>\n<p>That said, I stumbled across a new WebSocket Stream View in Safari's Dev Tools and, just like when <a href=\"/archive/gits-hidden-feature-notes/\">I discovered that Git supports notes</a>, I got really excited. Clicking on an active WebSocket connection now brings up a live timeline of every message sent and received by the browser over that connection. It even shows the <code>ping/pong</code> frames that the browser occasionally sends to verify that the connection is still open.</p>\n<div class=\"image-container\">\n    <img src=\"/images/blog/safari-websocket-stream-viewer.png\"\n         alt=\"safari websocket viewer\">\n    <p><small>Safari's New WebSocket Stream View</small></p>\n</div>\n\n<p>I'm hoping that this new view will make it a lot easier to debug problems because I can now see exactly what's being sent over the connection. I'm not sure when this was added to the Safari Dev Tools, but it's definitely very welcome.</p>", "date_published": "2018-03-04T22:16:00", "title": "Safari's WebSocket Stream View", "id": "http://brianschrader.com/archive/safaris-websocket-stream-view/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/gits-hidden-feature-notes/", "tags": ["git", "development", "software", "programming"], "content_html": "<p>When I'm programming I tend to create a lot of experimental branches to test my ideas before actually implementing them, and a lot of times I'll leave these branches in some half-state or with uncommitted changes. Then when I come back I've forgotten what I was doing and why. After running into exactly this problem earlier today, I started wondring if there was something built into Git that would give me a place to write notes to myself without committing.</p>\n<p>Well, apparently there is: Git has built in notes!</p>\n<p>According <a href=\"https://git-scm.com/docs/git-notes\">to the docs</a> you can use the command <code>git notes</code> which:</p>\n<blockquote>\n<p>Adds, removes, or reads notes attached to objects, without touching the objects themselves.</p>\n</blockquote>\n<p>It's always exciting for me to discover a cool new tool, and even more so when I learn more about one I already use.</p>\n<p><a href=\"https://git-scm.com/docs/git-notes\">Git Notes Documentation &#8594;</a></p>", "date_published": "2018-03-04T20:37:00", "title": "Git's Hidden Feature: Notes", "id": "http://brianschrader.com/archive/gits-hidden-feature-notes/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/real-life-science-fiction/", "tags": ["space", "spacex", "rockets", "future"], "content_html": "<p>Earlier today SpaceX launched their first Falcon-Heavy Rocket with Elon's personal Tesla onboard. All in all the launch went really well, and congrats to everyone at SpaceX for making it possible 🎉. There was a lot of amazing technological development and hard-core engineering that had to happen to make all of it possible, and it was amazing to watch, but one part in particular felt surreal.</p>\n<p>Falcon Heavy is an absolutely huge rocket. According to <a href=\"http://www.spacex.com/falcon-heavy\">SpaceX</a>:</p>\n<blockquote>\n<p>Only the Saturn V moon rocket, last flown in 1973, delivered more payload to orbit.</p>\n</blockquote>\n<p>For me though, the real crowning moment, the minute everything stopped being real and starting being Science Fiction was when the first stage boosters came back down, and landed in perfect sync; it felt like complete magic.</p>\n<video class=\"image-center\" controls>\n  <source src=\"/images/blog/SpaceX-Booster-Landing-Short.mp4\" type=\"video/mp4\">\n    Your browser does not support this video.\n</video>\n\n<p>Most days we're trapped in the real world, but things like today's landing are so awesome that, for a second, it can feel like we're living in a Fantasy or Sci-Fi universe. While I don't really approve of SpaceX's corporate practices, they do truly amazing and fantastic work, and the people there are top notch. I can't wait for the next launch.</p>\n<ul>\n<li><a href=\"/images/blog/SpaceX-Booster-Landing-Docks.jpg\">Another view of the landing &#8594;</a></li>\n<li><a href=\"/images/blog/SpaceX-Booster-Landing.mp4\">The full landing video with audio &#8594;</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=BHIo6qwJarI\">Some music to go with the video &#8594;</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=wbSwFU6tY1c&amp;t=2279s\">The full stream on YouTube &#8594;</a></li>\n</ul>", "date_published": "2018-02-06T17:59:00", "title": "Real Life Science Fiction", "id": "http://brianschrader.com/archive/real-life-science-fiction/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-web-as-a-social-network/", "tags": ["open web", "social networking"], "content_html": "<p><a href=\"http://inessential.com/2018/02/01/why_micro_blog_is_not_another_app_net\">Brent Simmons on Micro.blog</a></p>\n<blockquote>\n<p>Twitter and Facebook are convenient, sure, but so are fossil fuels, and the cost was similarly unknown for a long time. But now we have some idea just how bad these things are for the world....</p>\n<p>[With <a href=\"https://micro.blog\">Micro.Blog</a>] your posts are just a normal, everyday part of the open web. At this writing, mine appear on micro.inessential.com — but it’s on my to-do list to have those appear on my main blog (this blog) instead. (Probably won’t happen until after I ship the app I’m currently working on.)</p>\n<p>And this is how it used to be, and how it never should have stopped being: my blog is me on the web. I own my blog: I own me.</p>\n</blockquote>\n<p>Here's where I'd normally write something like this:</p>\n<blockquote>\n<p>Brent is right. Blogs and microblogs can and are the future of social networks. They allow you to keep control of your content, and protect you from huge, often nefarious corporate whims...</p>\n</blockquote>\n<p>But any reader of this site will already know my feelings on the Open Web and Social Networking. So this time I've decided to make this post a retrospective on what I've said before, and how my opinions, and the web has changed over the last few years.</p>\n<h2>The Open Web Series Collection</h2>\n<p>My first post about the Open Web was from July 2014, when this blog was still in it's infancy. Since then I've basically written about this subject whenever it's come up in the circles I travel in. At first I was just concerned with preserving my site and my thoughts for the future, but over time I morphed into the Open Web loving nerd you see before you today.</p>\n<ul>\n<li><a href=\"/archive/re-permanence/\">Re: Permanence (2014)</a></li>\n</ul>\n<blockquote>\n<p>How much history is lost by those who live it not writing it down. With the internet, we have the ability (assuming storage is cheap) to preserve everything we ever say, think, write, or post. That's really powerful, and possible accountability and privacy issues aside, its probably the most important use of an invention in the history of man.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/permanence-revisited/\">Permanence Revisited (2014)</a></li>\n</ul>\n<blockquote>\n<p>I've retweeted <a href=\"https://twitter.com/gruber/status/1024766035\">this tweet</a> multiple times, mostly because it's hilarious, but every time I want to do so, even though I have it saved in Instapaper and favorited on Twitter, its easier to google the text of the tweet (as close as I can remember) and let Google do the work.</p>\n</blockquote>\n<p>After a while I got it into my head that RSS could be used for a new (old?) kind of social network, and I've been rolling with that idea ever since.</p>\n<ul>\n<li><a href=\"/archive/waffle-brent-and-marco-on-social-networks/\">Waffle, Brent and Marco on Social Networks (2014)</a></li>\n</ul>\n<blockquote>\n<p>What would it mean to have a social network (like Dispora) that is decentralized, and independent of corporate ties? Could such a thing exist?</p>\n</blockquote>\n<p>Then I was (am still) mad at Twitter for a while, which just stoked the Open Web flames.</p>\n<ul>\n<li><a href=\"/archive/twitter-and-the-open-web/\">Twitter and the Open Web (2014)</a></li>\n</ul>\n<blockquote>\n<p>Could it be that the time for new social networks is past us? I hope not. RSS succeeded as an open standard, and so did email (though email had an early start). The podcasting industry is growing, powered by RSS... RSS use floundered after Google Reader shutdown, but RSS is still with us. That's important.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/how-to-stimulate-the-open-web/\">How to stimulate the open web (2014)</a></li>\n</ul>\n<blockquote>\n<p>Create systems that are ambivalent about the open or closed web. If I create a tool that's good at posting content to Facebook and Twitter, it should also post to RSS feeds...</p>\n</blockquote>\n<p>I tried <a href=\"https://www.xkcd.com/927/\">making a standard once</a>, but putting something on GitHub in a README doesn't make it a standard.</p>\n<ul>\n<li><a href=\"/archive/the-open-microblog-standard/\">The Open Microblog Standard (2014)</a></li>\n</ul>\n<blockquote>\n<p>A few weeks ago I began drafting a new standard for open, platform independent communication service. You can think of it as Twitter meets RSS...</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/making-rss-real-time/\">Making RSS Real-Time (2014)</a></li>\n</ul>\n<blockquote>\n<p>One of the critiques of RSS feeds in a world dominated by Facebook and Twitter is that RSS just isn't fast enough. You can't hope to achieve what Twitter calls \"in-the-moment updates\" and \"watch events unfold\" if your client is polling each web site's RSS feed once an hour for new microblog posts...</p>\n</blockquote>\n<p>After a while I started noticing that a lot of creators and bloggers I followed were moving back to open, platform-less distribution methods (like CGP Grey and his RSS feeds and email lists).</p>\n<ul>\n<li><a href=\"/archive/the-professional-sharer/\">The Professional Sharer (2014)</a></li>\n</ul>\n<blockquote>\n<p>[Social Media Platforms] have to do this to make money. It just sucks that how they make money is by compromising the people that made the service what it is (<em>cough</em> Twitter <em>cough</em>).</p>\n</blockquote>\n<p>I was still mad at Twitter.</p>\n<ul>\n<li><a href=\"/archive/twitter-is-not-a-replacement-for-blogs/\">Twitter is not a replacement for blogs (2014)</a></li>\n</ul>\n<blockquote>\n<p>Twitter is a complementary medium to blogging, but it's not a replacement...</p>\n<p>By knocking down a few walls and moving some furniture around, blogging is preparing for a comeback, and we'll all be better off for it.</p>\n</blockquote>\n<p>More recently though I've gotten more realistic and still more optimistic about the future of social networks and openness. Facebook and Google's Algorithms still loom high and mighty, but I started to see a resistence forming, and then Manton Reece released <a href=\"https://micro.blog\">Micro.blog</a></p>\n<ul>\n<li><a href=\"/archive/a-vision-of-the-open-web/\">A Vision of the Open Web (2016)</a></li>\n</ul>\n<blockquote>\n<p>I've long heard people say that we've lost video, music, and messaging to the walled worlds of YouTube, iTunes, and WhatsApp/Facebook/Twitter respectively, and while I believe that is the current state of the web, I don't believe it's the end-state.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/can-we-save-the-open-web/\">Can we save the open web? (2016)</a></li>\n</ul>\n<blockquote>\n<p>If we're going to allow... algorithms to be such a huge part of our lives, which I don't believe is necessarily a bad thing, then they should at least be subject to some sort oversight.</p>\n</blockquote>\n<ul>\n<li><a href=\"/archive/mantons-microblog/\">Manton's Micro.blog (2017)</a></li>\n</ul>\n<blockquote>\n<p>I've written lots of stuff about services like Manton's, and the Open Web in general. It's really important that we preserve not just the way the Web used to work, but as Manton says: the way it <strong>should work</strong>.</p>\n</blockquote>\n<p>The future looks bright for the open web and social networking, but the fight is ongoing.</p>", "date_published": "2018-02-02T12:12:00", "title": "The Web as a Social Network", "id": "http://brianschrader.com/archive/the-web-as-a-social-network/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/primitive-tech-is-here-for-the-long-haul/", "tags": ["primitive technology", "news"], "content_html": "<p>John's <a href=\"https://primitivetechnology.wordpress.com/2017/11/24/new-area-starting-from-scratch/\">most recent Primitive Technology blog post</a> has me pretty excited. The new video is great, as his videos tend to be, but the post mentions something a bit more exciting.</p>\n<blockquote>\n<p>I bought a new property to shoot primitive technology videos on. The new area is dense tropical rainforest with a permanent creek. Starting completely from scratch, my first project was to build a simple dome hut and make a fire.</p>\n</blockquote>\n<p>This is just me speculating here, but he wouldn't be buying a whole new plot of land to shoot videos on if he wasn't planning on making more videos long term. While I never had any reason to believe he'd be stopping anytime soon, such a big purchase is great news for him, his channel, and fans like me.</p>\n<p><a href=\"https://primitivetechnology.wordpress.com/2017/11/24/new-area-starting-from-scratch/\">Primitive Technology Blog &#8594;</a></p>", "date_published": "2017-11-24T14:46:00", "title": "Primitive Tech is Here for the Long Haul", "id": "http://brianschrader.com/archive/primitive-tech-is-here-for-the-long-haul/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-fcc-moves-to-dismantle-net-neutrality/", "tags": ["fcc", "net neutrality", "internet"], "content_html": "<p><a href=\"https://techcrunch.com/2017/11/21/fcc-officially-moves-to-unwind-net-neutrality-rules/amp/\">Jonathan Shieber for TechCrunch &#8594;</a></p>\n<blockquote>\n<p>Federal Communications Commission Chairman Ajit Pai today made good on his long-standing pledge to tackle regulations established in the last administration designed to protect the distribution of internet content.</p>\n<p>On Tuesday, Pai distributed to the other commissioners at the FCC a draft of his suggested rule changes under the auspices of the “Restoring Internet Freedom Order.”</p>\n<p>The move sets up a December 14 vote at the FCC that could have broad ramifications for the entire internet. Under the rules established by the Obama administration, internet providers are required to provide open access to their networks for all digital content.</p>\n</blockquote>\n<p>I'm really sad to see the FCC going forward with their plan to dismantle the Net Neutrality protections. What's worse is that Ajit Pai seems to know full well what this will mean for the web, and seemingly no amount of public comment against his proposal can disuade him.</p>\n<p>It seems like the only recourse we really have now is either to chip away at Ajit Pai's resolve with public comments before the December vote, or wait for some act of Congress to reverse the decision: something I can't even imagine them doing.</p>\n<p><a href=\"https://act.eff.org/action/congress-don-t-sell-the-internet-out\">Help Protect the Internet by Contacting Your Representative &#8594;</a></p>", "date_published": "2017-11-23T21:18:00", "title": "The FCC Moves to Dismantle Net Neutrality", "id": "http://brianschrader.com/archive/the-fcc-moves-to-dismantle-net-neutrality/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/mygenerank-behind-the-scenes-of-the-newest-researchkit-app/", "tags": ["django", "software", "technical overview", "review", "researchkit"], "content_html": "<p>I'm super excited to announce that <a href=\"https://mygenerank.scripps.edu\">MyGeneRank</a>, an app that I've been working on at my jobby-job at the <a href=\"https://www.stsiweb.org\">Scripps Translational Science Institute</a> for a year and a half, is now available on the <a href=\"TODO\">App Store</a>, and the source code is <a href=\"https://github.com/TorkamaniLab/mygenerank-api\">available on GitHub</a>!</p>\n<p>I've wanted to talk about this project for a while, I've written many unpublished posts about how it works, and now the time is finally right. If you're looking for the scientific or research parts, I'm going to leave that to <a href=\"http://www.biorxiv.org/content/early/2017/01/19/101519\">the paper we published</a>. I want to talk more about my experiences and what I've learned in building the system.</p>\n<p>As a quick overview: MyGeneRank is a ResearchKit based research study app aimed at providing users with their Genetic Risk for diseases, and measuring their reactions to this information. The first disease being Coronary Artery Disease. I'm definitely not a doctor, statistician, or biologist, and everyone else on the team handled all of the scientific work, but I am a Software Developer and I worked on the vast majority of the <a href=\"https://github.com/TorkamaniLab/mygenerank-api\">API</a>, Computation Engine, <a href=\"https://mygenerank.scripps.edu\">Website</a>, and <a href=\"TODO\">iOS App</a> development, DevOps, and System Administration as the sole developer. I learned a hell of a lot during the last year and a half and looking back, I'm not sure how I even got this far. Since the source code is available, at least for the API, (iOS source is coming) so now you too can see my mistakes and pass judgement! 🎉</p>\n<h2>From a Technical Perspective</h2>\n<p>Vaguely, MyGeneRank's backend has three main parts: a database (<a href=\"https://twitter.com/tonymillion/status/417213069572714496\">Postgres</a>), a Django REST API (which is open source), and what we've called a Computation Engine. All of it runs in-house, maintained by yours truly. The API and database are pretty self-explanatory, and the \"engine\" is really a Celery cluster and Redis queue which runs, among other things, a series of Python wrapped command-line tools and custom R scripts to calculate a person's genetic risk given their <a href=\"https://www.23andme.com\">23andMe</a> <a href=\"https://api.23andme.com/docs/reference/\">genotype data</a>. While the computation stuff is a sort of special case (what with the CLI tools and R scripts), the API's design goal was to be as industry-standard practice as possible. It's 90% covered with tests, leverages Travis-CI, uses <a href=\"http://www.django-rest-framework.org\">DRF</a> and <a href=\"http://docs.celeryproject.org/en/latest/index.html\">Celery</a> for the vast majority of its work, and everything runs in Docker containers on CentOS.</p>\n<p>If this stack sounds familiar to readers of this site, then you're catching on. In my post about <a href=\"/archive/adventurers-codex-the-stack/\">Adventurer's Codex's stack</a> I spelled out basically the same setup. In truth the stack for AC was heavily influenced by MyGeneRank. I took everything I learned building MyGeneRank and ported it to Adventurer's Codex a year later. That's how developers work, we do things once, then copy-pasta it everywhere.</p>\n<h2>Scientific Computing at Scale: Performance and Throughput</h2>\n<p>MyGeneRank has very demanding computational needs. Currently, we have <strong>178 cores and almost a terabyte of RAM</strong> powering the app and its backend. Turns out, calculating a person's genetic risk, even using genotyping data and not <a href=\"https://www.illumina.com/science/technology/next-generation-sequencing.html\">NGS</a>, requires a lot of computational power. Scaling this kind of intense scientific computation for public use was one of the most challenging (and enjoyable) parts of the project. But even now I don't really have many concrete answers to the problem other than the twin suggestions: add more cores and make your work as functional and therefore parallel as possible.</p>\n<h4>Into the Weeds for a Bit</h4>\n<p>The calculations needed to return a given user's genetic risk score can be broken into roughly 110 individual tasks and is mostly trivial to parallelize. What takes ~110 minutes of CPU time per user can be done in 3.5-4 minutes of wall time on our current system, but as any web developer knows, even that kind of processing time is hard to scale. The first couple tasks are run in series and then two chunks of tasks are run in parallel. The first chunk contains a single task which calculates the user's genetic ancestry, and the other chunk has 52 two-part tasks. This means that at any one time, 53 tasks per user are running during the bulk of the computation. These first 52 tasks take ~1.5-1.8 minutes each depending on which chromosome they're processing (<a href=\"https://www.youtube.com/watch?v=C906lbkcYug\">some are bigger than others</a>) and then the second batch takes about the same amount of time per chunk. The genetic ancestry takes ~3.2 minutes. Once all of these tasks are complete there's a final step that calculates the actual risk score, which is fairly instantaneous. What this means is that the time from start to finish for a given user's score is parallelize-able up to ~54 cores, then it's core speed that matters, which is harder to improve. The extra cores we have allows us to calculate more scores at once, but <strong>even with our huge core count, we can only calculate ~3-4 users' scores at a time</strong>. The good news is that all of the steps are really good at keeping memory use low; CPUs are the bottleneck here.</p>\n<p>Improving API and Website level performance is much more straightforward than doing the same for the backend. Like most sites, MyGeneRank sits behind an Nginx Reverse Proxy with some out of the box microcaching for popular pages.</p>\n<p>At time of writing, I'm not sure what the load will be like when we finally announce the study publicly, but I've spent a lot of time worrying about and trying to ensure that the site can handle the loads we hope for. There's been a <a href=\"https://www.macworld.com/article/2895941/stanfords-researchkit-app-gained-more-users-in-24-hours-than-most-medical-studies-find-in-a-year.html\">lot</a> of <a href=\"https://www.fastcompany.com/3058125/in-its-first-year-has-apples-researchkit-revolutionized-medical-research\">interesting</a> <a href=\"http://parkinsonsnewstoday.com/2016/03/28/parkinsons-mpower-app-celebrates-milestone-12000-registered-users-upgrade-apple-product-launch/\">news</a> and <a href=\"https://stories.appbot.co/how-i-got-2-3m-app-downloads-without-spending-a-cent-on-marketing-f4823b6bc779\">blog posts</a> over the years about what kind of download numbers an app, and especially a research app can expect, and I wanted to build MyGeneRank with those kinds of numbers in mind. Once the project has hit its first month I'm going to do a retrospective on how it all went and we'll see if my performance enhancements were enough.</p>\n<h2>Lessons Learned</h2>\n<p>There's a lot of little things that I've learned in building MyGeneRank (and later Adventurer's Codex). When we started, I'd worked on a few toy iOS apps and  a few corporate web projects, but MyGeneRank turned out to be of a completely different scale.</p>\n<p>Before MyGeneRank, I'd never used Django, or Django REST. I'd heard of them, and had a friend who used them, but aside from a few <a href=\"https://github.com/HyperTextCoffeePot/HyperTextCoffeePot\">toy projects</a> in Flask, my web experience was in front-ends or Java/Spring (and I guess PHP). My work at that time was mostly in writing <a href=\"https://github.com/TorkamaniLab/metapipe#metapipe\">analysis pipelines in Python</a> and since it's my preferred language, I wanted to use it for MyGeneRank. To this day, the structure of the API project is a little wonky and apps aren't where they should be; both are cruft from those early days. I try not to worry about it too much since I was learning as I went, and this kind of legacy cruft is impossible to avoid unless you knew everything at the start, and we most assuredly didn't. I can say that Django/Django REST has shown me just how boring building websites really is because it does most of it for you automatically and supports anything you'd ever really need right out of the box; you should definitely use it.</p>\n<p>The modern web is really complex and there's a reason that it takes so many skilled developers to build large systems. Server setup, administration, DevOps, reporting, and application development are all sub-disciplines unto themselves (which is why they're separate jobs at most places). And I've found that jumping in and out of these different worlds can result in a sort of Programmer's Jet Lag as your body adjusts to the new environment after spending days in a completely different one.</p>\n<p>On the native side, Apple's frameworks can be fun to use, and their OS frameworks, documentation, and user guides are world-class, but their tooling can also be frustrating and slow at times. The iOS app is written entirely in Swift and that has had some major effects on the development. Swift's tooling is still very new and the language has changed drastically since it came out. Having worked in both, I can say that, while I do enjoy Swift, nothing has made me appreciate the maturity of Python more.</p>\n<p>Overall, my advice for building these kinds of systems is the same as when I wrote a <a href=\"/archive/adventurers-codex-behind-the-curtain/\">similar post about Adventurer's Codex</a>:</p>\n<blockquote>\n<p>...ask people who've done it before... The internet is great, but it's actually pretty difficult to find out how to design modern web systems from scratch with just a vague notion and Google.</p>\n</blockquote>\n<p>MyGeneRank, to me, represents my passing from a junior to a senior developer in a lot of ways. By no means have I learned all there is to know, but having now built two large web projects, and being the  sole developer for one of them, I feel like a different person from the one who started the project a year and a half ago. I'd love to know what you all think of the source, and if you find a bug, file an issue please.</p>", "date_published": "2017-10-25T10:11:00", "title": "MyGeneRank: Behind the Scenes of the Newest ResearchKit App", "id": "http://brianschrader.com/archive/mygenerank-behind-the-scenes-of-the-newest-researchkit-app/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/oauth-over-xmpp/", "tags": ["django", "software", "xmpp", "oauth", "adventurerscodex"], "content_html": "<p>As <a href=\"/archive/adventurers-codex-xmpp/\">I've said before</a>, <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> uses XMPP for it's real-time features. During development we ran into a couple of interesting challenges with integrating such a mature system with our new-ish web stack, one of which was User Authentication.</p>\n<p>The majority of Adventurer's Codex uses an OAuth Provider model for user authentication but Ejabberd (our XMPP server) requires that the username and password be sent at connection time. Obviously we didn't want to have two different auth schemes to support, and we didn't want our client app to store any passwords (hence OAuth). We spent a while hunting for different possible solutions, and in the end we stumbled into a really simple one.</p>\n<p>Ejabberd allows for authentication to be handled by an external script, which allows us to use our core database as the auth backend. We could, in principle, use a Django management command to make a call to our database, hash the password that we were given by the client and compare it to the one stored in our database, but not only is that a lot of work and error prone, it's too coupled to our database layer, and it still required the client to store the user's password.</p>\n<p>In the end we went with what might seem like the obvious solution: just keep using OAuth. After the client receives the initial user data at load time, it sends the same OAuth token as the password along with the user's XMPP JID to Ejabberd. Ejabberd then calls out to an external script which makes an HTTP request to our API to see if the user exists and that the token is valid. Clean and simple.</p>\n<p><img alt=\"A visualization of the OAuth over XMPP process.\" src=\"/images/blog/xmpp-auth.svg\" /></p>\n<p>There's a few major advantages to using this method. First, The client no longer has to store user passwords, which not only makes our implementation simpler, but also protects our users from a whole host of attacks. Second, the user's XMPP session is now bound to the same limits as the rest of their access to the site which greatly simplifies permissions handling. Third, and perhaps the most interesting is that Ejabberd is no longer tied to either the Django CLI or the database and can be spun off as essentially a separate microservice on another machine.</p>\n<p><a href=\"https://gist.github.com/Sonictherocketman/aefd78575280978af0562a0b9841a903\">Check out the Ejabberd Auth Script &#8594;</a></p>", "date_published": "2017-10-24T18:24:00", "title": "OAuth Over XMPP", "id": "http://brianschrader.com/archive/oauth-over-xmpp/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/todolist-update/", "tags": ["development", "bash"], "content_html": "<p>Over the last week, I've made some changes to <a href=\"//gist.github.com/Sonictherocketman/77dd6cd8fd907dbbc00031acb08f3ba0\">my todolist script</a>: I've cleaned up the printing a bit and removed the temp file.</p>\n<p><img alt=\"todolist terminal output\" src=\"/images/blog/todolist-update.png\" /></p>\n<p>I had to remove the temp file because it was actually causing performance problems with BBEdit. Since the temp file came into and out of existence every few seconds, BBEdit's project view would dutifully redraw the project file list twice in quick succession, wasting quite a bit of CPU power<sup>1</sup>, and sometimes causing my MacBook's fan to spin up. Now that the temp file is gone, that problem is too.</p>\n<div class=\"footnote\">\n<sup>1. </sup>I'm not sure why BBEdit needs so much power to redraw the project list and I've reached out to their support. Hopefully they can resolve the issue. At the very least my script is a little more well behaved so it's no longer an issue.\n</div>\n\n<p><a href=\"//gist.github.com/Sonictherocketman/77dd6cd8fd907dbbc00031acb08f3ba0\">todolist &#8594;</a></p>", "date_published": "2017-10-10T15:35:00", "title": "todolist update", "id": "http://brianschrader.com/archive/todolist-update/"}], "author": {"url": "https://brianschrader.com", "name": "Brian Schrader", "avatar": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "icon": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}