{"home_page_url": "https://brianschrader.com", "version": "https://jsonfeed.org/version/1", "description": "Thoughts, and ramblings about technology, programming, history, and whatever else I'm interested in.", "feed_url": "https://brianschrader.com/feed.json", "title": "BiteofanApple", "items": [{"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/the-fall-of-civilizations-podcast/", "tags": ["podcasts", "history", "cultures"], "content_html": "<p>I love history. I grew up watching the History channel (back when they actually had real history shows) and PBS documentaries. These days those kinds of things don't really hit the spot anymore. I've turned to podcasts instead. There's a ton of great history podcasts out there and I've written before about my love of this <a href=\"https://thehistoryofrome.typepad.com\">History of Rome</a> podcast, its successor <a href=\"https://thehistoryofbyzantium.com\">The History of Byzantium</a> podcast, the <a href=\"https://www.thebritishhistorypodcast.com\">British History Podcast</a> and the fantastic <a href=\"https://www.revolutionspodcast.com\">Revolutions podcast</a>. But there's another show that I've really fallen in love with recently: <a href=\"https://fallofcivilizationspodcast.com\">The Fall of Civilizations Podcast</a>.</p>\n<p>Each episode of TFoC is a narrative re-telling of the fall of a particular civilization. The, typically 2-3 hour long, episodes start with an overview of the culture, exposing you to how it felt to live at that time and in that place, and the second half covers how this civilization fell. Each show has voice actors, music, excerpts from songs or stories shared at the time, and is chock full of well-researched, excruciatingly detailed history.</p>\n<p>That's not why I love the show though. I love it because I've left every episode feeling some degree of the same feeling: a mixture of wonder, sadness, hope, and intense loss for the cultures of the past who watched their world come to an end. It's cheery stuff. That may not sound very... good, and perhaps it isn't, but it reminds me that history is full of tragedy, and loss, but also full of hope and positive change. It reminds me that our world has not become what it is by accident or without pain and suffering. I just finished the episode about the fall of the Aztec empire, a tale I'd studied in school, but never truly understood at the level I feel I do now. As with every episode, I know how it ends, but it's always the journey that matters.</p>\n<p>This podcast, as well as all of the others mentioned in this post come <strong>highly</strong> recommended. Each of these shows is so captivating in its own right that I've, on many occasions, just sat with a cup of tea, coffee, or a cocktail and just listened, as if to a radio play, for hours. It's almost as if these kinds of narrative histories are like the oral tales that ancient tribes would tell around a fire: the stories of cultures, ancient and great, and the tale of how they fell.</p>", "date_published": "2020-06-29T03:47:00-08:00", "title": "The Fall of Civilizations Podcast", "id": "http://brianschrader.com/archive/the-fall-of-civilizations-podcast/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/d20photos-a-public-domain-dd-image-repository/", "tags": ["d20.photos", "D&D", "Pathfinder", "public domain", "image hosting", "primitive"], "content_html": "<p>I bought the domain <a href=\"https://d20.photos/\">d20.photos</a> on Nov 23rd, 2018 with the goal of building a free-to-use, public-domain image hosting service for D&amp;D, Pathfinder, and other fantasy RPGs. Today, that goal is realized.</p>\n<p><a href=\"https://d20.photos/\">\n  <img\n    src=\"https://d20.photos/static/images/apple-touch-icon.jpg\"\n    alt=\"d20.photos Logo\"\n    style=\"max-width:150px; width:80%; box-shadow:3px 3px 5px darkgrey; border-radius:30px; padding:0; margin:15px; float:right;\">\n</a></p>\n<p>Finding images for your D&amp;D campaigns is really difficult, especially if you're looking to sell your campaign. Most artwork isn't licensed in a way that makes it easy for low-budget creators to use and often there's no way to easily find images for settings or places in your game. <a href=\"https://d20.photos/\">d20.photos</a> aims to change that by providing a free, community-driven, human-curated image hosting service for D&amp;D/Pathfinder related images. <a href=\"https://d20.photos/\">d20.photos</a> aims to be a one-stop-shop for all your image needs. Since all images on the site are released into the Public Domain, you can be sure that you're ok to use, re-use, modify, them and even include them in your paid campaign or story.</p>\n<p>I've been collecting images for years (over 100) with the goal of eventually adding them to a service like this. I have a lot more to upload, and anyone in the D&amp;D community can do the same.</p>\n<h3>Abstract Images</h3>\n<p>One common problem for campaign or story writers is that while there are a plethora of photos on the Web that they can use in their games, pictures of the real-world are often too real. I know I will almost always choose a painting or other artwork over a photo even if they're harder to find. <a href=\"https://d20.photos/\">d20.photos</a> tries to solve this problem as well.</p>\n<p><img\n    class=\"image-right\" src=\"https://p.d20.photos/file/d20-photos/finalized-media/05422d20-f39e-4e8f-a254-255281204f65-05422d20-f39e-4e8f-a254-255281204f65_sm3423.jpg\"\n    width=\"300\"\n    height=\"300\"\n    style=\"max-width:300px;\"\n/></p>\n<p>Whenever a new photo is approved, a computer-generated version of the image is created by a wonderful open-source library called <a href=\"https://github.com/fogleman/primitive\">Primitive</a> by Michael Fogleman. The library uses primitive shapes (in this case triangles) of various colors and sizes to reproduce the original image. These primitive, or abstract, versions are often really beautiful and have a certain fantasy air about them. <a href=\"http://adventurerscodex.com\">Adventurer's Codex</a> actually uses these primitive images too <a href=\"https://adventurerscodex.com/dm.html\">on the landing pages</a>.</p>\n<p>I find that these abstract versions \"feel\" more appropriate for a fantasy game and while Primitive does struggle with images with a ton of fine detail (like photos with lots of trees), it's certainly better than nothing.</p>\n<h3>The Environment (Again)</h3>\n<p>Like <a href=\"https://nine9s.cloud/\">Nine9s.cloud</a>, <a href=\"https://d20.photos/\">d20.photos</a> is hosted in London in a datacenter powered by 92% clean and renewable energy. d20.photos runs on the same size of server as Nine9s, so I didn't need to recalculate the environmental impact. Unless I just can't make it work, I think I'm going to be hosting most of my software in the Linode U.K. datacenter from now on, or at least until one of their U.S. partners commits to using renewable energy in the same way. It's not a big thing, but it's a thing I can do.</p>\n<p>I hope <a href=\"https://d20.photos/\">d20.photos</a> is useful to you, and if it is, I'd love to hear about it. The site is donation based, so if you like what you see, please consider supporting it. If enough people do, it'll be a lot easier to justify improving it in the future.</p>", "date_published": "2020-06-24T17:00:00-08:00", "title": "d20.photos: A Public Domain D&D Image Repository", "id": "http://brianschrader.com/archive/d20photos-a-public-domain-dd-image-repository/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/careful-with-complex-querysets/", "tags": ["django", "databases", "Querysets", "cautionary-tale"], "content_html": "<p>Today I learned something about filtering Django Querysets and fixed a long standing bug. But first some context.</p>\n<p>As a feed reader, Pine.blog needs to parse feeds. To do this, every 5 minutes, Pine.blog checks to see which feeds it needs to parse. A feed can fall into one of three categories:</p>\n<ul>\n<li><strong>Constantly changing feeds with active subscribers</strong>: Feeds that change regularly (i.e. microblogs, Reddit feeds, etc) and have recently active users subscribed to them.</li>\n<li><strong>Less frequently changing feeds with active subscribers</strong>: Feeds that may update rarely, but still have recently active users subscribed to them.</li>\n<li><strong>Everything else</strong>: Feeds with no one subscribed to them, but are still included in the Feed Directory, or feeds with subscribers who haven't logged in to Pine.blog recently.</li>\n</ul>\n<p>To do all of this, Pine.blog keeps track of how often a feed is typically updated, but if it can't tell, it sets the <code>approximate_update_frequency</code> to <code>NULL</code>. Then each of the three categories are checked at different frequencies, ensuring that everything gets parsed at least once every 24 hours, but things that change more often, or with active users subscribed to them, are given priority and parsed more regularly: every 15 or every 30 minutes respectively.</p>\n<p>It's the second category that's long been acting weird. And that's where my bug comes in.</p>\n<h3>The Actual Code</h3>\n<p>The bug I discovered has to do with how I group the feeds into those categories. Specifically, I learned that this:</p>\n<pre><code>Q(approximate_update_frequency__in=[\n    None,\n    UpdateFrequency.CONSTANTLY,\n    UpdateFrequency.FEW_PER_DAY,\n])\n</code></pre>\n<p>Is not the same as this:</p>\n<pre><code>Q(approximate_update_frequency__in=[\n    UpdateFrequency.CONSTANTLY,\n    UpdateFrequency.FEW_PER_DAY,\n]) | Q(approximate_update_frequency__isnull=True)\n</code></pre>\n<p>The critical change is the switch from including <code>None</code> in the list of allowed items to explicitly filtering by <code>isnull</code>. It seems minor, and it totally feels like you should be able to use None in an <code>IN</code> collection, but you can't.</p>\n<p>Funnily enough, the query sort-of works with the <code>None</code> in there, it just ignores the <code>None</code> and uses the other two. The true issue arises when you try to inverse the condition using the <code>NOT</code> operator. This is exactly what Pine.blog's dispatch tasks were doing. It would first fetch the list of every feed matching that criteria, and then do a second fetch of everything that didn't match, and that second one is where results were getting lost.</p>\n<p>All this means that some feeds in the second group were being lumped into the third group, delaying their posts from appearing for hours. I've known about this issue for a while, because the posts from this blog (which squarely fall into the second group) weren't showing up in Pine.blog until the following day.</p>\n<p>Glad to finally squash that bug.</p>\n<div class=\"footnote\">\n* This update also migrates Pine.blog to Python 3.7. It's been on 3.6 for years, and I only upgraded it because homebrew screwed up my 3.6 install and it was easier to upgrade Pine.blog than downgrade my Mac's Python version. Fun times.\n</div>", "date_published": "2020-06-18T18:57:00-08:00", "title": "Careful with Complex Querysets", "id": "http://brianschrader.com/archive/careful-with-complex-querysets/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/announcing-nine9scloud-/", "tags": ["nine9s", "launch", "announcement", "uptime monitoring", "saas"], "content_html": "<p><center><i>We interrupt this blog for a special announcement</i></center></p>\n<p>I'm super excited to announce the release of <a href=\"https://nine9s.cloud/?ref=ba\">Nine9s</a>, a service providing simple, no-fuss uptime monitoring for developers on a budget. Whether you're a hobbyist with a blog, an indie-dev working on some side projects, or a small dev shop, Nine9s is here to make sure your site is up and responsive for your users and to alert you of any slowdowns or outages.</p>\n<p>I've used Uptime Monitoring services for years, but I've always been left slightly dissatisfied. There's lots of great services out there and they do a lot of stuff, but they either feel like overkill, cost way too much, or don't quite do what I need. That's why I built Nine9s.</p>\n<p>If you're in the market for inexpensive, but powerful, Uptime Monitoring, then please check out Nine9s. You can even get started for free and see what it has to offer, and check out the <a href=\"https://nine9s.cloud/kb/feature-roadmap\">roadmap</a> for what's coming.</p>\n<p><a href=\"https://nine9s.cloud/?ref=ba\">Nine9s.cloud: No-fuss Uptime Monitoring for Developers &#8594;</a></p>\n<h3>Nine9s and the Environment</h3>\n<p>Nine9s is the first service I've ever run that's powered by servers outside the U.S., and there's a reason for that. I care about the environment and about mitigating the effects of Climate Change (I'm a vegetarian for some of the same reasons). I've always preferred to use <a href=\"https://www.linode.com\">Linode</a> for my hosting and while they have lots of datacenters in the U.S., none have committed to using energy from clean and renewable sources; though, their datacenters in Europe do.</p>\n<p>I've written up a whole explanation about how and why <a href=\"https://nine9s.cloud/kb/infrastructure\">Nine9s is hosted in London as well as calculating the environmental impact of running the service</a>, and I hope you check it out. Running a small service like Nine9s off of green energy isn't really going to make a big difference in the world, but it's not going to actively make things worse either, and that's what matters.</p>\n<h3>From Idea to Launch in Two Weeks</h3>\n<p>I've had the idea for Nine9s for years, but I'd never gotten around to actually building out the service. Besides the fact that I never do anything until I have a domain name, I'd just never had the time. That has changed recently.</p>\n<p>On May 27th, exactly two weeks ago, I bought the domain <a href=\"https://nine9s.cloud/?ref=ba\">nine9s.cloud</a> and got to work. Everything you see was built and designed in that time. This is the fastest I've ever launched a commercial product, and I don't think I could really do it again. Nine9s is a fairly simple service, and I ripped most of the infrastructure from <a href=\"https://pine.blog/\">Pine.blog</a> which made getting started really trivial. That said, I'm really amazed just how quickly I was able to put everything together. I took very few shortcuts, wrote good code, and spent a good chunk of time designing and implementing the service; I don't think it's what I did that matters, it's what I didn't do. Nine9s has no dynamic front-end, it runs on one server, it uses tools I know by heart, and it does one job and does it well.</p>", "date_published": "2020-06-10T16:43:00-08:00", "title": "Announcing Nine9s.cloud 🎉", "id": "http://brianschrader.com/archive/announcing-nine9scloud-/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/this-site-supports-webmentions/", "tags": ["webmentions", "indie web", "open web"], "content_html": "<p>Today is an exciting day! As of today, this static blog supports Webmentions. For those who aren't aware, Webmentions is a technology that allows websites to let each other know when one mentions another. Webmentions can be used to support likes, comments, replies, and reposts over the Open Web with no platform in the middle. This means blogging gets all of the great social features that previously required a Social Media company. Webmentions rock.</p>\n<p>Typically, Webmentions require code running on the host server, and since this is a static site, it hasn't been possible for me to implement them here. However, the <a href=\"https://blog.pine.blog/2020/05/bring-us-your-static-sites-yearning-to-breathe-free/\">newest version of Pine.blog</a> now lets you add Webmention support to any site. Pine.blog acts as a simple middle man and provides you with a Mentions timeline just like you'd expect from social media. All you have to do is add a <code>&lt;link&gt;</code> tag to your site's header. Which is precisely what I've done here. There's no server code on my end, and I can see all of my mentions in my Pine.blog Mentions timeline.</p>\n<blockquote>\n<p>Cross-Site mentions are yet another way that Pine.blog is trying to push us towards the Open and Indie Web future! No matter where you blog you can get all the interactivity of Webmentions and cross-site replies.</p>\n<p>Blogs can and should be the social network of the future, and Pine.blog is here to help make that better world a reality.</p>\n</blockquote>\n<p><a href=\"https://blog.pine.blog/2020/05/bring-us-your-static-sites-yearning-to-breathe-free/\">Bring Us Your Static Sites, Yearning to Breathe Free &#8594;</a></p>", "date_published": "2020-05-30T21:27:00-08:00", "title": "This Site Supports Webmentions!", "id": "http://brianschrader.com/archive/this-site-supports-webmentions/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/a-whole-new-mac/", "tags": ["mac", "macos", "apple", "new hardware"], "content_html": "<p>Today was an important day. Today I'm finally retiring my 2013 MacBook Pro. I'm even writing these words on a new Mac. It's been a <a href=\"/archive/an-ode-to-the-13-inch-macbook-pro/\">long road</a>, but my dependable, old 2013 MBP has reached the end of its life... as my primary computer. It still works well, so I can't bear getting rid of it. At this point I think I'll wipe it and use it for editing music.</p>\n<h3>A New Fantastic Point of View</h3>\n<p>As I type these words on my new 13\" Macbook Pro, I feel extremely relieved. This laptop feels great to use. It's small, light, powerful, and beautiful. The keyboard works well and feels good, the display is beautiful, the touch bar with an escape key is a good compromise, Touch ID is great, and Migration Assistant transferred everything over perfectly (even my blogging engine and the outdated versions of Python 2 on which it depends).*</p>\n<p>I look forward to taking this thing through it's paces. I've taken my 2013 MBP  across the US and beyond, so there's no telling where this one will go. I'll miss the HDMI port and Magsafe moreso, but c'est la vie. The years start coming and they don't stop coming; so must I march along with them.</p>\n<p>Welcome to the party, new MacBook. I hope you're ready to rock.</p>\n<div class=\"footnote\">\n* Migration Assistant remains one of the most magical and underrated pieces of software Apple makes. It transfers apps, files, .rc files, everything in /usr/local/bin and more. The idea of having to manually migrate my files and applications makes me cringe. I've never set up a new personal Mac after my first one.\n</div>", "date_published": "2020-05-22T00:43:00-08:00", "title": "A Whole New Mac", "id": "http://brianschrader.com/archive/a-whole-new-mac/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/why-were-polarized/", "tags": ["ezra klein", "book review", "politics"], "content_html": "<p>It took me way too long, but I finally finished <a href=\"https://www.barnesandnoble.com/w/why-were-polarized-ezra-klein/1132833789?ean=9781476700328\"><em>Why We're Polarized</em> by Ezra Klein</a>. I got the book when it came out, but after making it half-way through I got distracted. I regret not finishing it sooner.</p>\n<p>Before I go any further into the whats and the whys, I will pause to just briefly say: <strong>you should read this book</strong>. Just do it. It's a quick read (unless you take 6 months off) and it's exactly the kind of thing Ezra is famous for: good, thoughtful, explanatory writing on a nuanced and complicated topic.</p>\n<h3>A Systems Perspective on These United States</h3>\n<p>For the curious, <em>Why We're Polarized</em> details the story of, well why we're polarized. Specifically, Ezra explains what polarization means and why it's a problem in modern American politics, then takes us through how we got here, what polarization has done to our government (and us), and then offers some advice on how we can mitigate its more potent aspects.</p>\n<p>Ezra brings the weight of recent social science to bear in supporting his theories and he's spent countless hours before and after the release of his book discussing the finer points in audio form. I won't go any deeper here, just read the book and listen to those episodes.</p>\n<p>What drew me to this book the most is that, in it, Ezra looks at our politics not as the result of individuals and their actions, but through the lens of systems and their incentives. That perspective isn't just what brings me back to Ezra's work over and over again, it's exactly what makes me recommend it to friends and others who aren't interested in, or those who don't follow, politics. It's an uncommon take, but one that I, and I know many others really enjoy.</p>\n<h3>What Now</h3>\n<p>I can't say the book is terribly encouraging. It's pretty downright depressing at times, but it does clarify a lot of nuanced truths: from what motivates the push toward radicalism in the Republican Party, and yet moderation in the Democratic Party, to detailing how the supposed glory of midcentury American politics was in part due to the long shadow that slavery, racism, and the failures of Reconstruction cast over this nation. It's a real pick-me-up.</p>\n<p>That said, I found myself even more hopeful and optimistic that these problems with our politics can be solved. Knowledge of the problem and understanding of its nuances is a huge part of the work towards finding a solution, and I for one, feel better armed in the fight after reading this book.</p>\n<p>Ezra has said on his podcast, as well as in the book itself, that the solutions he offers at the end are mostly there for decorum. Books about the problems in politics usually end with solutions, so he does too for the sake of fitting in. But one of his suggestions has actually helped me significantly in my understanding (and coping) with the world of politics, law, and government.</p>\n<blockquote>\n<p>\"There are over five hundred thousand elected officials in the United States, only 537 of whom serve at the federal level.\" ... The 537 federal officials are the ones we have the least power to influence, if only because they have, on average, the most constituents. But we often don't know the names of the officials nearest to us, even though they'd be glad to meet for coffee...</p>\n<p>[T]here's a real reward from rooting more of out political identities in the places we live.</p>\n</blockquote>\n<p><center><small>This book is obviously pre-pandemic.</small></center></p>\n<p>I live in California and lately I've tried to focus more on my state and less on the national dramas. I've started following more local papers and more state news. I feel better about the world, more hopeful about the future, and more connected to the place I live. I'm not always successful (in fact I have a lot of room for improvement), but following the goings on of my City, my County, and my State have made me more optimistic, more informed, and arguably more influential. I've started emailing my City Councilmember and my State Assemblymember, and they actually respond, not with a cheap form letter, but with a real, human response! Even if it's only to take my comment and throw it on the pile, I feel like I've actually contributed, much more so than I ever would just ranting about the President or the Senate on the Internet.</p>\n<p>I think we've all let the inter-connectedness of the Internet overshadow the communities we have at home. Community on the Web is a marvelous thing, but there is also a sense of community to be had... in our communities.<sup>1</sup></p>\n<div class=\"footnote\">\n<sup>1</sup> This advice also works in our current pandemic-laden world. As I said <a href=\"https://pine.blog/u/sonicrocketman/archive/19dfc5d5-5542-4a1b-9029-d6e6a217a2d9\"> on my microblog</a>:\n<blockquote>In this time of crisis, look to your local goverments: city and county. There are thousands of people working hard and looking out for you and for your community.</blockquote>\n</div>", "date_published": "2020-05-18T04:45:00-08:00", "title": "Why We're Polarized", "id": "http://brianschrader.com/archive/why-were-polarized/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/spring-cleaning-and-microformats/", "tags": ["microformats", "spring cleaning", "blogging", "meta"], "content_html": "<p>This site now supports microformats! I've added a feed to the homepage, and styled each post as an entry. Hopefully this'll make it possible to follow this site in a MicroSub reader. I've also completely redone the nav and the core styling. The nav bar on this site has bugged me for years, but until tonight it never bothered me enough to actually fix it. That deed is done.</p>\n<p>I can't remember the last time I actually dove into the templates and CSS that power this blog. The last significant change would have to be at least three years ago. Hopefully this time I won't have to touch it for even longer.</p>", "date_published": "2020-05-17T07:41:00-08:00", "title": "Spring Cleaning and Microformats", "id": "http://brianschrader.com/archive/spring-cleaning-and-microformats/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/an-uplifting-tale-in-these-dark-times/", "tags": ["uplifting", "covid19", "human condition"], "content_html": "<p>Like a lot of people, these last few weeks have been challenging. I've been working from home for years, so California's stay-at-home order hasn't affected my work all that much, but I do find myself battling a constant anxiety. I'm an optimist by nature, but these last few weeks have stretched that belief to its limits and every day I've found myself flailing in a sea of uncertainty while a thick blanket of brain fog smothers out the sun.</p>\n<p>All of that put me in the perfect head-space for <a href=\"https://www.theguardian.com/books/2020/may/09/the-real-lord-of-the-flies-what-happened-when-six-boys-were-shipwrecked-for-15-months\">this article</a> from the Guardian. I needed an optimism booster shot and I found it. A story of six boys who set out on an ill-fated journey in 1965. Sounds super uplifting right?</p>\n<blockquote>\n<p>No one noticed the small craft leaving the harbour that evening. Skies were fair; only a mild breeze ruffled the calm sea. But that night the boys made a grave error. They fell asleep. A few hours later they awoke to water crashing down over their heads.</p>\n</blockquote>\n<p>The full article is definitely worth a read. It follows a similar plot to the Lord of the Flies, except with the exact opposite conclusion. In this story, the boys are inherently good.</p>\n<p>I won't spoil how, but all six kids are eventually rescued (after <strong>15 months</strong>) and are reunited with their families. It's a great story, but one passage stood out to me more than any other:</p>\n<blockquote>\n<p>Kolo fashioned a makeshift guitar from a piece of driftwood, half a coconut shell and six steel wires salvaged from their wrecked boat – an instrument Peter has kept all these years – and played it to help lift their spirits.</p>\n</blockquote>\n<p>In dark times we turn to things that bring us together. For many, that thing is music. I don't, for a second, want to re-live what those boys went through, but it makes me extremely happy to know that even in their darkest times they turned to one of mankind's oldest remedies to lift their spirits.</p>\n<p>We can't gather in crowds right now, but music can still help us get through this crisis together. We just need to be creative with how we play it.</p>\n<p><a href=\"https://www.theguardian.com/books/2020/may/09/the-real-lord-of-the-flies-what-happened-when-six-boys-were-shipwrecked-for-15-months\">What happened when six boys were shipwrecked for 15 months &#8594;</a></p>", "date_published": "2020-05-10T00:01:00-08:00", "title": "An Uplifting Tale in these Dark Times", "id": "http://brianschrader.com/archive/an-uplifting-tale-in-these-dark-times/"}, {"author": {"name": "Brian Schrader"}, "url": "http://brianschrader.com/archive/where-it-comes-from-nobody-knows/", "tags": ["software", "london", "time immemorial", "ancient", "software development", "history"], "content_html": "<p>A friend of mine stumbled across <a href=\"https://www.x.org/releases/current/doc/man/man5/xorg.conf.5.xhtml\">this page</a> today. It has an interesting section about <a href=\"https://www.x.org/releases/current/doc/man/man5/xorg.conf.5.xhtml#heading11\">X Video Adapters</a> that got me thinking; though it wasn't what was on the page that got me all wound up, <em>it's what wasn't</em>.</p>\n<blockquote>\n<h3>VIDEOADAPTOR SECTION</h3>\n<p>Nobody wants to say how this works. Maybe nobody knows ...</p>\n</blockquote>\n<p>I presume that last bit is a joke, but maybe it's not. The X Windowing system dates back to the early 80's, and it's gone through so many iterations and revisions that it's probably safe to say that there are definitely parts that literally no one understands.</p>\n<p>As computing and the Internet get older, the nuances and particulars of most software will be lost as it fades from living memory. It's quite possible that, years from now, we'll all be depending on lots of software that no one has seen or touched in decades. Its secrets lost, its workings unknown.</p>\n<h2>Time Immemorial</h2>\n<p><a href=\"https://en.wikipedia.org/wiki/City_of_London\">The City of London</a>, not to be mistaken for the <a href=\"https://en.wikipedia.org/wiki/England\">city named London</a>, is an ancient city alive today in the center of the capital of the U.K.. To this day it has its own customs, rights, and traditions, and in most respects it's more of a country than a city. This small 1-square mile of land is extremely special. Why? Because it always has been. The <a href=\"https://www.cgpgrey.com/blog/the-secret-city-of-london.html\">founding of The City of London predates the country that surrounds it by several hundred years</a>. For as far back as anyone can remember the City has been there, lying on the Thames. It gets its special status and powers, not from The People, or from God, but from Time Immemorial. The City just <em>is</em>, and always has been.</p>\n<p>We are still in the bright, starry-eyed youth of the software world. But our software, should it continue to run that long, may outlive its founders, maintainers, and followers. In the future we may find that lots of software just is, and always has been.<sup>1</sup> Future help articles may offer little more than this:</p>\n<blockquote>\n<h3>Why does it do X?</h3>\n<p>It just always has.</p>\n</blockquote>\n<div class=\"footnote\">\n<sup>1</sup> NASA already has lots of experience with software that has outlived and outlasted its creators, maintainers, and who's documentation has been lost to fire, flood, and the careless efforts of man.\n</div>", "date_published": "2020-04-08T02:18:00-08:00", "title": "Where it Comes From, Nobody Knows", "id": "http://brianschrader.com/archive/where-it-comes-from-nobody-knows/"}], "author": {"url": "https://brianschrader.com", "name": "Brian Schrader", "avatar": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "icon": "http://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}