{"version": "https://jsonfeed.org/version/1", "title": "BiteofanApple", "home_page_url": "https://brianschrader.com", "feed_url": "https://brianschrader.com/feed.json", "description": "Thoughts, and ramblings about technology, programming, history,\n and whatever else I'm interested in.", "icon": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595", "author": {"name": "Brian Schrader", "url": "https://brianschrader.com", "avatar": "https://www.gravatar.com/avatar/11b074a636e00292c98e3e60f7e16595"}, "items": [{"id": "http://brianschrader.com/archive/users-tools-platforms-and-the-shifting-goals-of-software/", "url": "http://brianschrader.com/archive/users-tools-platforms-and-the-shifting-goals-of-software/", "title": "Users, Tools, Platforms, and the Shifting Goals of Software", "date_published": "2024-03-22T19:04:00", "tags": ["software", "technology"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I've been around long enough now to remember when we used different words to refer to our favorite apps and websites. Long before the words <q>Platform</q>, <q>Service</q>, or <q>Ecosystem</q> infected our discourse there were <q>Tools</q>. And I think we need fewer of the former and more of the latter.</p>\n<p>The word <q>User</q> is also partly a holdout of this now bygone age. A User is anyone (even a dog) that <q>uses</q> the website or app. By traditional parlance, a User is the person being served by the software. On an Ecosystem, Service, or Platform though the User is likely not the Customer, they're often the Product.</p>\n<p>A hammer is a tool and it is <em>used</em> for a purpose by a <em>user</em>&mdash;it's right there in the name. The user uses the tool to accomplish a goal in their lives and the tool exists to make the user's life easier in doing the thing they want to do. We used to think of software that way, but alas that mode of thought has long faded from popular conception. These days a User is more likely to be a person <em>used by</em> the software rather than someone who <em>uses</em> it to accomplish a goal. The software's goal is paramount, not the human's.</p>\n<p>No doubt many of us out there still believe the old adage I've recited as:</p>\n<blockquote>\n<p>A computer is a tool. I don't wait for a hammer, it waits for me. Hammers exist to make life easier not harder. Computers and software should be no different.</p>\n</blockquote>\n<p>These days it is more likely for software to feel like an entertainment product, a movie theatre. The User then isn't a person trying to accomplish a goal, but is a captive audience who paid for one experience but gets a bunch of extra content thrown at them for the privilege of getting what they paid for. Though, thinking about it more, perhaps the better comparison is that of an airport. A user's every movement is tracked and monitored both for security and sales, everything is overpriced and cheaply-made, yet at the end of the day you still  get where you need to go (assuming your bags make it and the plane has no loose bolts).</p>\n<p>Perhaps this transformation is part of the increased scope and scale of modern software or perhaps it has to do with the professionalization and financialization of the industry. Maybe it's something else. I don't know.</p>\n<p>Apps like <a href=\"https://netnewswire.com\">NetNewsWire</a> or <a href=\"https://mastodon.social/\">Mastodon</a> (just to name two examples) remind me of what we've lost. They're not trying to get me to adopt some platform. They're tools to help me get work done, like good software should.</p>"}, {"id": "http://brianschrader.com/archive/more-on-handwriting-amp-cursive/", "url": "http://brianschrader.com/archive/more-on-handwriting-amp-cursive/", "title": "More on Handwriting &amp; Cursive", "date_published": "2024-03-07T20:51:00", "tags": ["writing", "personal"], "author": {"name": "Brian Schrader"}, "content_html": "<p>My <a href=\"/archive/on-handwriting-and-switching-to-cursive/\">last post</a> seemed to garner a fair amount of interest and so I figured it would be good to cover some of the unspecified particulars that I left out of the previous post.</p>\n<h2>On Writing Cursive Left-Handed</h2>\n<p>I mentioned in the previous post that I write using a fountain pen (and occasionally with a dip pen). Given that, it may come as a surprise to some, but I am left handed. And while yes, writing with a dip pen does occasionally leave me with blackened palms from ink-smear, I've found this to be increasingly rare. It was certainly the case early on, but it's actually rare these days. Most modern inks dry incredibly quickly (so long as the right amount of ink lands on the page). That said I do end up with lots of ink on my fingers whenever I change the cartridges on my fountain pen.</p>\n<p>I've also found that the amount of ink that smears on my hand <em>went down</em> now that I write in cursive. That may seem strange as cursive uses a lot more ink than print, but I think it has to do with the extreme bias I tend to write with. As I'm left-handed, I also tilt the page the <q>wrong</q> way. This helps with ink smear because I'm almost always writing on already dry text.</p>\n<div class=\"image-center\">\n    <figure title=\"This figure depicts a piece of legal paper tilted 32 degrees. It may not render correctly outside of a browser because it's just a hacky HTML div.\">\n        <div style=\"\n            margin-right: auto;\n            margin-left: auto;\n            padding-top: 0.4rem;\n            width: 8.5rem;\n            height: 11rem;\n            transform: rotate(-32deg);\n            background-color: antiquewhite;\n            border-top: solid #444 0.4rem;\n        \">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n            <hr style=\"color: lightgrey;\">\n        </div>\n    </figure>\n    <figcaption class=\"text-center\">\n        <small>I tend to write on a 30-35° bias (32° is depicted here).</small>\n    </figcaption>\n</div>\n\n<p>I was taught to write in the <a href=\"https://en.wikipedia.org/wiki/Zaner-Bloser_(teaching_script)\">Zaner-Bloser</a> cursive style as a kid and that's what I picked up again last year. As with all forms of handwriting, I've simplified my take on the style to be what I now consider to be a mix of Zaner-Bloser and the New American style which incorporate several print letters for capitals (ridding me of the annoying Zaner-Bloser F, G, H, and its uninspired A). None of these tweaks were born of me trying to adopt a formal style, instead each came from me tweaking my own style which happened to converge and resemble those above.</p>\n<p>As part of this quest of mine, I spent a fair amount of time researching the history of cursive and its various styles. I learned a lot about how different  techniques evolved and how the style I most recognize as \"fancy, old-style cursive\" (i.e. the <a href=\"https://en.wikipedia.org/wiki/Palmer_Method#/media/File:Palmer_Method_sample.jpg\">Palmer Method</a>) lost the battle mid-century to the style that I was taught as a kid. I still think the Palmer Method is cooler looking, but I have no interest in breaking my brain again to learn it.</p>\n<h2>On the Gear</h2>\n<p><img alt=\"Pen and paper on my desk\" src=\"/images/blog/pen-paper.jpg\" /></p>\n<div class=\"text-center\"><small>\n    My daily driver.\n</small></div>\n\n<p>As this is partly a techie blog, I'd be remis if I didn't talk about the gear I use, though it's not particularly exciting.</p>\n<p>I use a wide variety of notebooks (<a href=\"https://www.amazon.com/gp/product/B07YLTJHH4/\">some</a>. <a href=\"https://www.amazon.com/gp/product/B0BLC876QN/\">are</a>. <a href=\"https://www.amazon.com/gp/product/B0027Z14AG/\">linked</a>. <a href=\"https://www.amazon.com/gp/product/B07PLR8DJZ/\">here</a>), though most of the time I just write on <a href=\"https://www.amazon.com/gp/product/B004YK4VHA/\">cheap legal pads</a>.</p>\n<p>As for the pens I use, my daily driver is a <a href=\"https://www.amazon.com/Schneider-Fountain-Medium-Barrel-160201/dp/B001B2IFLM?th=1\">Schneider Base Uni</a>. I have two of them (one stocked with black ink and the other with blue which I rarely use).</p>\n<p>For my dip pen, I really like <a href=\"https://www.amazon.com/gp/product/B004YK4VHA/\">this ink</a>. It's nothing special but it's cheap and works well.</p>\n<h2>Now What?</h2>\n<p>I continue to write a fair amount each day, and like I mentioned in my other post, that's largely because I find it fun to do. I've ended up performing a sort of near-nightly ritual where I write about something, anything just to feel the pen in my hand and hear the scratch of nib on paper. Sometimes it's (bad) poetry other times it's just stream-of-conscious rambling. Most of what comes out is uninspired or repetitive, but some aren't! Some are (dare I say it) even good!</p>\n<p>Writing for me has become a new hobby, something I do to unwind and de-stress. That's not something I expected, but it is what happened.</p>"}, {"id": "http://brianschrader.com/archive/on-handwriting-and-switching-to-cursive/", "url": "http://brianschrader.com/archive/on-handwriting-and-switching-to-cursive/", "title": "On Handwriting and Switching to Cursive", "date_published": "2024-02-25T07:25:00", "tags": ["writing", "personal"], "author": {"name": "Brian Schrader"}, "content_html": "<blockquote>\n<p>I'm a software developer; I make my living on a computer. In this age there just isn't much reason for me to bother improving my handwriting.</p>\n</blockquote>\n<p>I've thought that for years. While like most people my age, I learned to write in cursive in school (and to write in general) I'd essentially stopped using such an all-important skill in my daily life, save for the odd sticky-note here and reminder scribble there.</p>\n<h2>How It Began</h2>\n<p><img alt=\"Examples of my typical print writing\" src=\"/images/blog/writing-example-print.png\" /></p>\n<p>I never wrote by hand. Why would I? You can't <code>⌘+f</code> handwritten text, you can't change-control it, you can't even back it up easily. Why would you bother writing anything significant by hand at all?</p>\n<p>An old programming teacher of mine once quipped:</p>\n<blockquote>\n<p>People say that stuff on a computer isn't real, it's just digital. You can't touch it or save it. If the computer dies, it's gone. But I say they've got it backwards. Files on a computer are so much more real. I can prevent them from getting old, I can back them up for free, and I can send them to you without losing my original. On a computer, it's <strong>more</strong> real than it is on paper.</p>\n</blockquote>\n<p>While I'm not sure I ever truly agreed with his point there, I did take that advice to heart for most of the past 12 years. In college, most of my work was digital already, and once school ended, I stopped writing by hand for all but a few rare tasks. I've always been a fan of writing <em>in principle</em> and many years ago I got a few fountain pens as a gift. Mostly they sat in a drawer, but occasionally I'd take them out and pine over how cool they were, then go about my day. I do keep a journal by hand, but writing in it has been an oft-forgot afterthought for most of my adult life.</p>\n<p>Until last year.</p>\n<h2>How it Went</h2>\n<p><img alt=\"Examples of my slightly enhanced print writing\" src=\"/images/blog/writing-examples-better-print.png\" /></p>\n<p>I've been working on a bit of a project now for over two years and part of that project has been writing a ton of notes for myself. I used to keep them in Notes.app on my Mac (since it syncs with all my devices), but after a while I got sort of disillusioned on doing that. As mentioned above, I <em>live</em> on my computer and it was starting to really get to me just how much time I spend at my desk, staring at a screen. So I took out a fresh notebook I'd been given years ago, and I started to take notes there instead.</p>\n<p>I was hooked.</p>\n<p>Within a few short weeks I had dozens of pages of notes, sketches, and musings in this little book (that was poorly made and now falling apart), so I dusted off the old fountain pens, bought some <a href=\"https://www.amazon.com/gp/product/B07YLTJHH4/\">better notebooks on Amazon</a>, and kept at it. I'd been taken in by writing. Writing by hand had so many downsides, but there were incredible upsides too. I no longer got distracted by notifications while writing. I loved flipping through my notes to review them. I rarely lost track of notes because I <em>knew where they were</em> in relation to other notes because human brains know where stuff is in space (mind-blowing, I know). I even got to talking to some friends about this new hobby of mine.</p>\n<p>And that's when I went into overdrive. You see, a friend of mine gifted me a dip pen as a birthday present and I was supercharged.</p>\n<p>One thing I've learned, that I find difficult to describe, is just how expressive it feels to write with pen on paper, even when you have nothing to write about. I was genuinely taken in by the sound of scritches of metal on paper. Over that first half of the year I wrote, by hand, over <em>one hundred pages</em> of text! That's likely more than I'd written in the past decade (and likely even further back) combined!</p>\n<p>One thing still bothered me though: my terrible handwriting.</p>\n<p>It's always been bad. It was bad when I was 5, 12, 20, and it's still bad. I knew it, everyone knew it. I never bothered to improve it either because:</p>\n<ol>\n<li>I knew how to read it (most of the time).</li>\n<li>Writing is something I rarely did, so why get better?</li>\n<li>I'm lazy.</li>\n</ol>\n<p>However, writing poorly didn't just mean my scribbles were sometimes difficult for me to read (and impossible for others to do so), it also meant something more important: my hand hurt when I wrote. My grip was too tight and my hand was unpracticed and sloppy. That meant I couldn't write for very long, even when I wanted to. What's more I've always romanticized writing (see the fountain pens above). I <em>wanted</em> to write better, but I didn't want it enough and I never really needed to. Now though, I was writing constantly and my bad penmanship was getting in my way.</p>\n<p>It was time. I needed to revisit cursive.</p>\n<h2>How It's Going</h2>\n<p><img alt=\"Examples of my cursive writing\" src=\"/images/blog/writing-examples-cursive.png\" /></p>\n<p>I hadn't written in cursive since second grade. I stopped doing it the moment it was no longer required and I never looked back &mdash; until last October.</p>\n<p>I can confidently say that I've written more cursive in the past four months than I have in my whole life before, combined. Easily. Over two hundred pages.</p>\n<p>And it's great.</p>\n<p>I'm by no means <em>good</em> at it, but I'm improving. I started with just trying to remember the letters. I have to imagine this is how learning to type on a DVORAK keyboard feels: your brain just breaks for a while. I even used those <a href=\"https://www.worksheetworks.com/english/writing/handwriting/cursive-practice.html\">cursive worksheets</a> they give to kids (with <a href=\"https://tolkiengateway.net/wiki/Song_of_Parting#In_The_Silmarillion\">custom text</a> of course).</p>\n<p>After that I graduated to journaling in cursive and later writing in general in cursive. After four months, I can say that almost everything I write these days is in cursive <em>by default</em>. In fact I really only print when I need to scribble down a quick sticky-note or reminder (exactly as I did before all this).</p>\n<p>My handwriting is by no means good, but I think my cursive is better than my print (especially if you take into account how long I've been practicing the latter vs. the former).</p>\n<p>I've fallen in love with writing by hand. It's something I've always wanted to do well, but it took until now for me to set aside the time and effort to do it. I only regret waiting this long.</p>"}, {"id": "http://brianschrader.com/archive/my-favorite-books-from-2023/", "url": "http://brianschrader.com/archive/my-favorite-books-from-2023/", "title": "My Favorite Books from 2023", "date_published": "2024-01-14T22:14:00", "tags": ["books", "book", "book recommendations", "book review"], "author": {"name": "Brian Schrader"}, "content_html": "<p>In what seems to be a new annual tradition, I'd like to discuss my favorite books from 2023. While I didn't achieve the same level of reading as 2022, last year was still one of the most productive reading years I've ever had&mdash;18 in total! You can see the totals of the books on my <a href=\"/archive/reading-report/\">reading progress</a> page, which at time of writing will look off since it doesn't count audiobooks in the counts (something I need to fix).</p>\n<p>As a side note, I am curious if I can somehow automate the posting of recommended/recent books on that page. An interesting idea 🤔</p>\n<p>In no particular order here are the books I recommend from last year:</p>\n<h3>The Book of Hidden Things, Francesco Dimitri</h3>\n<p>Francesco is quickly becoming my favorite author. I read <em>Never the Wind</em> last year and fell in love with his writing, and <a href=\"https://bookshop.org/p/books/the-book-of-hidden-things-francesco-dimitri/9925689?ean=9781785657078\"><em>The Book of Hidden Things</em></a> is more of the same excellent storytelling. Seriously, check him out.</p>\n<p>Also he has a <a href=\"https://www.amazon.com/Dark-Side-Sky-Francesco-Dimitri-ebook/dp/B0CF11RY1H\">new book</a> coming out this year, which I have already pre-ordered.</p>\n<h3>The Ocean at the End of the Lane, Neil Gaiman</h3>\n<p><a href=\"https://books.google.com/books?id=erG2zQEACAAJ&amp;hl=&amp;source=gbs_api\">This one</a> was a really fun read. Neil Gaiman is a master and it shows. Really enjoyed this one, but I don't have much to say about it. A lovely story.</p>\n<h3>The Internet Newspaper, Adam Gnade</h3>\n<p>The <a href=\"https://books.google.com/books?id=T80tzwEACAAJ&amp;hl=&amp;source=gbs_api\">cover hooked me</a> immediately when I picked this one up on a whim from a local bookstore. The story takes place in San Diego (the author's and my hometown). If you like San Diego, 90's/00's music, and early 20-somethings mischief you'll like this. Also I love the size of this thing. Pocket novels are a lost medium.</p>\n<h3>The Secrets of Alchemy, Lawrence Principe</h3>\n<p>The book is an overview of the history of the practices of alchemy (mostly attempts to create a philosopher's stone and turn lead to gold), though it touches on the other uses for alchemy including metallurgy, medicine, and pre-modern chemistry. However the book really hits it out of the park when Principe does the homework and attempts to replicate several of the ancient alchemical recipes! Instantly I was hooked.</p>\n<p>I read a lot of ancient history and one things I always try to keep in mind is that while ancient worldviews are very different from our own, and scientific thinking as we know it today didn't exist yet, that doesn't mean that people weren't experimenting, verifying, and sharing their ideas. For years people dismissed old alchemical recipes because we know their goal (chemically turn lead to gold) to be impossible, but that doesn't mean their experiments were useless, as Principe discovers. Some were very nuanced and precise. 10/10, fascinating read. Highly recommended.</p>\n<p>It's available to <a href=\"https://archive.org/details/secretsofalchemy0000prin\">rent for free</a> on the Internet Archive, so please check it out.</p>\n<h3>Beren and Luthien, J.R.R. Tolkein</h3>\n<p>I read a lot of Tolkien this year and <a href=\"https://www.audible.com/pd/Beren-and-Luthien-Audiobook/0008214239\">this one</a> was my favorite. It's a little happier than the excellent <em>Children of Hurin</em> and features some of my favorite scenes from <em>The Silmarillion</em>. Basically if you enjoyed that chapter with the same name in <em>The Silmarillion</em>, you'll love this.</p>\n<p>My favorite part: the song battle between a demi-god and an elf lord. 10/10. No notes.</p>"}, {"id": "http://brianschrader.com/archive/experimenting-with-the-game-of-life/", "url": "http://brianschrader.com/archive/experimenting-with-the-game-of-life/", "title": "Experimenting with the Game of Life", "date_published": "2023-09-25T04:18:00", "tags": ["programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>As I am <a href=\"/archive/fun-with-math-calculating-multiplicative-persistence/\">want</a> to do, I spent an evening a while back putting together a Python version of <a href=\"https://en.wikipedia.org/wiki/John_Horton_Conway\">John Conway's</a> Game of Life: a &quot;zero-player game&quot; in which the board state progresses automatically according to a set of rules.</p>\n<p>You can find the code for the <a href=\"https://gist.github.com/Sonictherocketman/4551dcf001932639a03e8849be92ff71\">game here</a>. It requires just the Python standard library to run, so its easy to get started assuming you have Python &gt;=3.10 installed. (It might run on lower than that but I didn't test it.)</p>\n<p><img alt=\"A screenshot of the Game of Life\" src=\"/images/blog/life.png\" />\n<center><small>A screenshot of my version of The Game of Life</small></center></p>\n<details>\n<summary>Gameplay Video</summary>\n<div>\n\n<video autoplay=\"false\" preload=\"false\" controls>\n    <source src=\"/images/blog/Gol.mp4\" type=\"video/mp4\">\n</video>\n<center><small>Thrilling, right?</small></center>\n</div>\n</details>\n\n<p>The initial board state for the game is randomized so each run-through is unique. Some end immediately, so you may have to run the script several times to see something cool happen.</p>\n<p>Because it's written in Python, the game is single threaded and quite lacking in raw performance, but because it's written in Python the game was also incredibly easy to put together&mdash;taking about three hours in total including debugging, though I did spend three more hours optimizing the render performance for no reason.</p>\n<p>As with most of my recent script projects, I don't really have a point or reason for doing it other than to have some fun building toy projects. Like I've said before:</p>\n<blockquote>\n<p>Scripts are programming candy whereas app development is the real meat and potatoes. In a script you can take shortcuts, be a bit messy, and forgo worrying about the complexities of large software.<br />\n- <a href=\"/archive/take-a-break-script-something/\">Take A Break, Script Something</a></p>\n</blockquote>\n<p>In that same time I've also thrown together a few little scripts to <a href=\"https://gist.github.com/Sonictherocketman/5d51d3c8e739624404f3f8535fb1f564\">visualize the chaos of the Collatz Conjecture</a> and <a href=\"https://gist.github.com/Sonictherocketman/be0a4aa1a43d3c74604ea9f3f5352e63\">simulate the dynamics of 2-D gas expansion</a>. Are these important? Nope, not at all. Were they fun? Yes, yes they were.</p>"}, {"id": "http://brianschrader.com/archive/building-bots-for-fun-and8230/", "url": "http://brianschrader.com/archive/building-bots-for-fun-and8230/", "title": "Building Bots for Fun and&#8230;", "date_published": "2023-08-05T21:41:00", "tags": ["mastodon", "programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>For all of the good things about Mastodon and the Fediverse more broadly, the technology has so far struggled to spread far outside of tech circles and into the broader public. Mastodon especially is pretty big these days, but its mostly filled with a lot of computer nerds like myself; there really isn't a very large music scene like there is on other social media sites.</p>\n<div class=\"image-container\" style=\"padding-left: 1rem;\">\n<iframe allowfullscreen sandbox=\"allow-top-navigation allow-scripts allow-popups allow-popups-to-escape-sandbox\" width=\"320\" height=\"400\" src=\"https://www.mastofeed.com/apiv2/feed?userurl=https%3A%2F%2Fmastodon.social%2Fusers%2Fsdmusiceventsbot&theme=auto&size=80&header=true&replies=false&boosts=false\"></iframe>\n</div>\n\n<p>I wanted to help fix that, so I threw together a simple <a href=\"https://mastodon.social/@sdmusiceventsbot\">Mastodon bot</a> (a toot bot?) that regularly shares information about local music shows in San Diego.</p>\n<p>With the <a href=\"https://www.sandiegoreader.com\">San Diego Reader</a> as its data source, the bot posts every hour about shows happening in the next day or two. Hopefully it will help my fellow San Diegans keep tabs on the music scene, and help to inspire more musicians and local music fans onto the platform.</p>\n<p>So if you're at all interested in the San Diego music scene, be sure to follow <a href=\"https://mastodon.social/@sdmusiceventsbot\">sdmusiceventsbot</a> on Mastodon! And if you're a local artist, make sure you <a href=\"https://mastodon.social/@sdmusiceventsbot\">add your event</a> to the Reader to get yourself noticed by the bot! Be warned, San Diego has a lot of shows (more than the bot could ever reasonably post without looking like spam), so not all shows will get posted. The choices are random, so it's all up to the luck of the dice.</p>"}, {"id": "http://brianschrader.com/archive/announcing-paper-peaks/", "url": "http://brianschrader.com/archive/announcing-paper-peaks/", "title": "Announcing Paper Peaks", "date_published": "2023-07-31T22:53:00", "tags": ["music"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Nearly two years ago, my band <a href=\"https://thefourthsection.com\">The Fourth Section</a> released an EP called <a href=\"/archive/the-road-to-glass--stone/\">Glass &amp; Stone</a> and this month we released our first, full-length album: Paper Peaks.</p>\n<p>Recording an album has been a long-time goal of mine and something we as a band have been working toward for over three years.</p>\n<p><a href=\"https://thefourthsection.com\">\n<img\n    src=\"https://thefourthsection.com/img/paperpeaks.webp\"\n    class=\"image-center\"\n    style=\"width: 400px;\"\n/>\n</a></p>\n<p>I don't have much to say about the album, other than you should listen to it, but I can say it's been a true honor to have been able to make something like this with such amazing people. The three of us have worked hard since March to record, produce, publish, and promote the thing and it's taken a lot more out of us than I think we expected. Paper Peaks was a labor of love and something that could not have been done save for the support of my bandmates, our producer Jeff Berkley, and so many others.</p>\n<p>If you like indie-rock and alt-rock, give it a listen and if you like it, please share it with your friends.</p>"}, {"id": "http://brianschrader.com/archive/some-thoughts-on-adventurers-codex/", "url": "http://brianschrader.com/archive/some-thoughts-on-adventurers-codex/", "title": "Some Thoughts on Adventurer's Codex", "date_published": "2023-04-30T00:39:00", "tags": ["programming", "software development", "adventurerscodex"], "author": {"name": "Brian Schrader"}, "content_html": "<p>Last year <a href=\"https://adventurerscodex.com\">Adventurer's Codex</a> reached its 8th birthday. It's a milestone that I honestly didn't believe we'd ever hit, both because eight years is a long time and because&mdash;if I'm honest&mdash;I've never been sure how long this little project would actually last.</p>\n<p>These days Adventurer's Codex is primarily built and maintained by three people: two are founders (including myself) and the third is a friend of ours, and as with any long-lived side-project Adventurer's Codex has occasionally suffered a lack of interest or enthusiasm from all of us. At the beginning the three founders met every week (sometimes twice a week) to build new features and plan the roadmap, later we rarely met at all, and sometimes nearly a year could go by before any of us even thought about Adventurer's Codex at all.</p>\n<p>These days though the app is alive and healthy and with the support of our amazing <a href=\"http://patreon.com/adventurerscodex\">patrons on Patreon</a> we continue to make improvements and release features at a steady pace, and this year we're set to release a slate of amazing features that eight-years-ago-me could only dream of.</p>\n<p>It makes me very happy to say this: the future is very bright for Adventurer's Codex.</p>"}, {"id": "http://brianschrader.com/archive/more-scripting-nonsense-rocket-edition/", "url": "http://brianschrader.com/archive/more-scripting-nonsense-rocket-edition/", "title": "More Scripting Nonsense: Rocket Edition", "date_published": "2023-03-17T23:15:00", "tags": ["programming", "fun"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I was browsing <a href=\"https://gist.github.com/Sonictherocketman\">my Github Gists</a> the other day, as you do, and I came across my first one published back in 2015: <a href=\"https://gist.github.com/Sonictherocketman/11339552\">Rocket.py</a>. This script was one part of a rocket trajectory simulator I built for a class in college. Now I don't remember much about that project, but I do remember that the simulation never actually worked&mdash;or rather that it never worked <em>properly</em>.</p>\n<p><img alt=\"A screenshot of the trajectory over time\" class=\"image-right hide-on-mobile\" src=\"/images/blog/rocket-trajectory.png\" /></p>\n<p>So since I had some idle time on my hands, I decided to spend an evening and take another stab at the project. These days I'm a far better programmer but I remember next to nothing about rocketry, and so I added a bit of a challenge for myself: try to look up as little as possible.</p>\n<p>About two hours later <a href=\"https://gist.github.com/Sonictherocketman/2b3836cb2bc2ca7fdb5283deb67d20c6\">I had this</a>, a new rocket simulation that seems to produce accurate values (if you neglect drag&mdash;more on that later). Now my first simulation only output a set of numerical values for each second of flight, and while those numbers were useful for the class, they're not very interesting to look at so I added a little visualization (drawn with Python's turtle graphics).</p>\n<p>Each phase of the flight is color-coded: green for powered flight, blue for cruising, and red for descent, and the flight statistics seem accurate enough to me when I plug in the numbers for the <a href=\"https://en.wikipedia.org/wiki/Falcon_9\">first stage of SpaceX's Falcon 9</a>, so that bodes well. And at the end of each flight you get a summary readout in the terminal.</p>\n<p>The code is pretty full-featured, and since it uses turtle graphics (and my other <a href=\"/archive/generating-deterministic-procedural-artwork-with-pdraw/\">drawing project</a>) it can even save the trajectories as EPS files for easy printing &amp; saving. You can customize the launch angle, the burn time, specific impulse, fuel and payload weights and even the screen refresh rate using the many CLI flags. The script requires nothing but Python3.10 or later (with the tkinter module included of course), and so it's easy to play with if you're interested.</p>\n<p>All in all it was a fun evening project, and I was especially surprised to find that I remembered a lot more of the intricacies than I expected. I still had to look up the equations for specific impulse, but that was it really. The kinematics stuff was beaten into my head in school so I doubt I'll ever forget that. Really the only thing that gave me any trouble was the drag&mdash;which I decided to omit anyway.</p>\n<p><img alt=\"A screenshot of the stats of the flight in the Terminal\" src=\"/images/blog/rocket-stats.png\" /></p>\n<p>I had initially wanted to add the drag based on the mach number, but my memory failed me on how to do that and late-night searching only threw me down a rabbit hole of further questions. Past me knew a lot more about this stuff than current me does. In the end the drag was a nice-to-have feature anyway and by the time I got to that point it was nearly one in the morning, so I just declared victory and went to bed.</p>\n<p>I have no real point to this post other than to show how much (and how little) I remember about rocket mechanics after all these years and to show off a cool bit of scripting. It's toy projects like this that got me interested in programming and they can be a really fun way to spend an idle evening.</p>\n<hr />\n<p>Disclaimer: I <em>think</em> the values in the simulation make sense, but I didn't spend too much time validating them. If there's any real rocket people out there who find issues with my results, then I'm sorry; now you know one of the reasons I didn't go into aerospace.</p>"}, {"id": "http://brianschrader.com/archive/a-cross-post-life/", "url": "http://brianschrader.com/archive/a-cross-post-life/", "title": "A Cross Post Life", "date_published": "2023-03-10T03:47:00", "tags": ["software", "programming"], "author": {"name": "Brian Schrader"}, "content_html": "<p>I use <a href=\"https://pine.blog/\">Pine.blog</a> for microblogging, and following the Post Once Sindicate Elsewhere strategy, I like to have those updates automatically cross-posted to other platforms like <a href=\"https://micro.blog/sonicrocketman\">Micro.Blog</a> and <a href=\"http://twitter.com/sonicrocketman\">Twitter</a> so that they gain a larger audience, and so that anyone who wants to can follow me no matter which platform or software they prefer.</p>\n<p>Obviously I'm not manually posting to five different sites&mdash;that's what computers are for&mdash;and so I need some way to automate that work. Micro.blog makes most of that very easy since it can automatically ingest content from an RSS feed and not only add it to my microblog there, but also cross-post it to Twitter. That only leaves Mastodon out in the cold.</p>\n<p>In recent months there's been a lot of <a href=\"/archive/on-the-web-the-best-outcome-is-email/\">new activity</a> on Mastodon and I've really enjoyed seeing a larger segment of people discover such a great open-web focused tool. It was well past time that I add Mastodon to my cross-posting workflow, but there was a problem: Mastodon's posts are text only (with links at the bottom&mdash;like Twitter), but Pine.blog outputs HTML (or Markdown). I tried several tools, but each one would mangle my posts or just include the raw HTML as the text, neither of which was an acceptable solution. I needed something custom.</p>\n<p>So I <a href=\"https://gist.github.com/Sonictherocketman/7951ec710b7be1f675e2e95cbcc5220e\">wrote a script</a>! It runs every few minutes on the Raspberry Pi under my desk checking for new posts from Pine.blog and posting them to Mastodon. It starts with the raw Markdown, parses the HTML, strips and appends links, and even keeps track of what has and hasn't been posted before. It's a pretty handy script and I encourage you to check it out if you need something like it. I even made use of one of Mastodon's very handy features: <code>Idepotency-Key</code> which helps prevent duplicate entries from being posted in a short period of time.</p>\n<p>As of today my posts are now <a href=\"https://micro.blog/sonicrocketman\">Live On Mastodon</a>, so you can rest assured that if you follow me there you aren't missing a beat. You'll get all... <strong>five posts</strong> I've made this year!</p>"}]}