{
"articles" : 3,
"title3" : "Microsoft and a Unix-based Windows",
"link3" : "http://brianschrader.com/archive/microsoft-and-a-unix-based-windows/",
"published3" : "2014-02-11",
"content3" : "<p>Does it make sense for Microsoft to develop, and ship a future Windows OS that is Unix based? To date, Microsoft is the only major player in the Operating System game to have a non-Unix based system. I don&#39;t think that such a switch would help Microsoft in any immediate way, and it would definitely kill compatibility and enterprise support, destroying a lot of Microsoft&#39;s core business. </p><p>In truth, I&#39;m not trying to draw a parallel to Apple&#39;s Unix switch, now almost a decade and a half behind us, but I am trying to look at the future of the computer industry as a whole. Are there any substantial benefits from having the same &quot;core&quot; in every major computing system? The implementations of these systems would be drastically different surely, and there would be no cross compatibility as a result, but I&#39;m not sure that&#39;s the point. </p><p>Computers are very mature now. Their early days were filled with turmoil and garage-based teams building entire consumer computers from the ground up. This, obviously, led to an enormously diverse implementation between any major competitor and its rivals, but now &quot;the world runs on Unix&quot;<a href='#note'>*</a>, or at least the non-Windows majority does. Is it time for Microsoft, and the industry as a whole to decree a common ancestor and build on that, or should Microsoft continue to develop their own system for the foreseeable future?</p><p>Microsoft has spent decades building  their development environment, and indeed their entire ecosystem around their Windows OS[&#39;s] and their current system is well evolved and supported, and I realize that this move, however hypothetical it may be, would destroy their decades of work and their business. I just feel that since the whole world has gone Unix, Microsoft could be on the losing side if they stay the course, it may lead them into dangerous waters.</p><p><b>Update:</b> After some more thought, I realize that using Unix as the common ancestor of the modern computer OS does make the entire industry subscribe to the shortfalls of Unix as well, something John Siracusa would point out to anyone in depth, but it still seems to me, in my gut at least, as a positive step. It would be like an OS standard.</p><span id='note' style='font-size:70%;'>* This is a quote from Gruber on this week&#39;s episode of The Talk Show. He discusses the fact that the server world and indeed most of the consumer computing market (i.e. phones, tablets, and some PCs) are running some flavor of Unix (Mac OS X, iOS, Android, Linux, etc). Microsoft holds a huge market share in the traditional PC market, but that&#39;s really the only place where a non-Unix OS still hold majority stake. Linux won the server market, and iOS/Android won the mobile market. </span>",
"title1":"MarkDown Syntax Feature Request: Math Syntax",
"published1":"2013-09-19",
"link1" : "http://brianschrader.com/archive/markdown-syntax-request-math-syntax/",
"content1":"<p><a href=\"http://daringfireball.net/projects/markdown/\">MarkDown</a> provides a simple way to write in plaintext, that can easily be translated into HTML. The syntax provides support for headers, paragraphs, images, links, emphasis, and more. It really makes it easy to write content without worrying about tags or formatting. </p>\n<p>One of the most painful, and tedious things to do on a computer is enter mathematical formulas and functions. Until now, if you wanted to enter equations into a computer interface, you were forced to use MS Word's terrible equation editor, or HTML and do all of the span elements manually. MarkDown can make it easy. I believe that adding a simple extension to MarkDown will make this time-consuming and fairly arduous task a lot easier and bring mathematics into the folds of the computing era.</p>\n<h2>The Proposed Syntax</h2><p>The syntax for entering an equation into MarkDown syntax you enter the equations between a curly-brace followed immediately by a colon.</p>\n<p>{: <em>Anything entered here is treated as an equation</em> :}</p>\n<p>Even Multi-Line equations</p>\n<p>{: </p>\n<p>(2x^2) = 54</p>\n<p>x=2+34y^2</p>\n<p>:}</p>\n<p>The above equations would become:</p>\n<p></p>\n<p><img src=\"http://images.biteofanapple.com/blog/eq1.png\" alt=\"math equation\"/></p>\n<p><img src=\"http://images.biteofanapple.com/blog/eq2.png\" alt=\"math equation\"/></p>\n<p></p>\n<p>Inside the equation delimiters (an I will call them) text and characters are treated as mathematical expressions, not as text. Examples: ^ (carats) are parsed to subscripts; x/y (forward slashes) are converted to a vertical division symbol; * (asterisks) are parsed as multiplication; etc.</p>\n<p>Special symbols like greek letters, and integrals (essential in math intensive fields) will use <em><a href=\"http://web.ift.uib.no/Teori/KURS/WRK/TeX/symALL.html\">TeX-like</a></em> \terms. </p>\n<p>Note: Symbols like \\int (which makes an integral) will only work <em>inside</em> the equation delimiters.  </p>\n<p>{:</p>\n<p>Y(x) = \\int:4,8\\ 2x dx</p>\n<p>:}</p>\n<p>Would become:</p>\n<p><img src=\"http://images.biteofanapple.com/blog/eq3.png\" alt=\"eq3\"/></p>\n<h2>The Goal is not to remake LaTeX</h2><p>The goal of MarkDown is to make writing simple things easier, and to cut away distractions. It doesn't cover everything nor should it. Similarly, this MarkDown extension will not be a remake of LaTeX, it will not cover every symbol in mathematics. Instead it will be a way to easily write the most common mathematical symbols (fractions, greek letters, integrals, and functions). </p>\n<p>Note: Some <a href=\"http://www.cs.tut.fi/~jkorpela/math/\">others</a> have written on this subject and it seems to be a limitation in HTML that holds this idea back since HTML has no way to display a lot of elements in mathematics. This could probably be worked around by keeping the symbol library relatively small and limited to standard font characters.</p>\n",
"title0" : "Re: Comic-Con",
"published0" : "2013-07-24",
"link0" : "http://brianschrader.com/archive/re-comic-con/",
"content0" : "<p>The now world famous convention in San Diego California is one of the largest pop culture conventions in the world, and over the years has grown far beyond expectation. As a lucky local who has been going to Comic-Con since 2005, there are a few things worth mentioning that seem to bother myself and the other repeating attendees. </p>\n\n\t<h2> Too Big for its Britches</h2>\n\n\t<p>Comic-Con is huge. This year alone the convention boasted a whopping 130,000 attendees. With that number of participants, it's clear that the San Diego Convention Center (the current home of the convention) is in no way big enough to contain such an event. In recent years the convention has been expanded to include the neighboring Hilton and Marriot hotels as well as the park next to the convention center, Petco Park baseball stadium, and the entire Gas Lamp District, but it isn't enough. </p>\n\t<img src=\"http://images.biteofanapple.com/blog/comic-con-line.jpg\" class=\"body-image-right\" width=\"400px\" alt=\"A view of the Convention Center from the Trolley stop.\">\n\t<p>The convention center is overflowing with people. Signs are posted throughout the building to warn of where not to stand by order of the Fire Marshal. The three biggest halls (Ballroom 20, Hall H, and Indigo Ballroom in the Hilton) can't hope to fit even half of the people who line up. In order to get into a popular panel, say at 5:30pm, attendees will line up around 5am and sometimes the night before. While some people are obsessive, and over excited, the fact is that even those people may not get in. They waste their whole day in line, 12 hours of queuing, and they can't get in, it's unacceptable. While I understand that even with all the room in the world some people won?t get in, however it shouldn't be this bad.  The smaller panel rooms are filled to the brim as well, and independent panelists have a hard time getting a spot because the spots fill too quickly with corporations paying for the publicity. All the overcrowding has gotten to the point of ridiculous. </p>\n\n\t<p>Out of everything though, the exhibit hall is the hardest hit. The hall stretches from one end of the 5 block convention center to the other, and is filled with booths selling everything from videogames, to clothing, from artist commissions to hentai. It's crowded even before the attendees show up, but when they do, it gets maddening. </p>\n\n\t<p>Comic-Con still wants to be a small, basement get-together, and it isn't. It has to grow.</p>\n\n\t<h2>Grow with the Times</h2>\n\t<img src=\"http://images.biteofanapple.com/blog/comic-con-crowd.jpg\" class=\"body-image-right\" width=\"400px\" alt=\"A view of the massive crowds at Comic-Con.\">\n\t<p>The Consumer Electronics Show (C.E.S) in Las Vegas is another huge convention (just over 150,000 attendees) and it handles things differently. Unlike Comic-Con, which takes place in a specific place, the Convention Center, C.E.S. takes place in the city of Las Vegas. This is a huge change in mindset. The convention is in a multitude of hotels, exhibit halls, and convention centers throughout Las Vegas, and attendees can shuttle between them. True, this does spread the goodies out to many places but the overall idea is to increase attendance, increase safety, and decrease overcrowding (to an extent at least). This is something Comic-Con could learn a lot from.</p>\n\t<p>San Diego and Comic-Con are perfect for each other, but Comic-Con cannot stay confined in the convention center. It needs to expand; luckily San Diego already has places for it to expand to close by. San Diego actually has 2 convention centers! San Diego Concourse, or 'the old convention center'' as it is most commonly known, is a building just a few blocks from the heart of Comic-Con. This building, along with the Civic Theatre that sits right next door, are perfect for use as Comic-Con panel rooms. The Concourse's Golden Hall seats 4,300 people, and the Civic Theatre seats 2,900. While these numbers aren't even close to hall H at 6,100 and only ties Ballroom 20 at 4,200, the use of these two additional venues would alleviate the stress and overcrowding in the Convention Center. These venues could be perfect for medium to large sized panels that would otherwise be forced into a much smaller panel room to make up for Ballroom 20 and Hall H being booked solid.</p>\n\n\t<p>The Concourse also has additional space for exhibitor. A shuttle could move people back and forth, and with Comic-Con recently adding the Lyceum theatre to its list, the attendees would have quite a good reason to venture out away from the convention center, and into the heart of downtown. I can't imagine that the businesses and restaurants in Horton Plaza, next door to the Lyceum and the Civic, would be too inconvenienced with the thousands of potential customers that would now be walking past and through their stores.</p>\n\n\t<h2>Moving Up</h2>\n\t<img src=\"http://images.biteofanapple.com/blog/SD-convention-center.jpg\" class=\"body-image-right\" width=\"400px\" alt=\"A view of the preview night registration line.\">\n\t<p>The convention has done this kind of expansion before. It started as a get-together in a basement, and then moved to the Grant building, then to its current home at the Convention Center, and it?s time to expand again. The Convention Center is a perfect place to have the heart of Comic-Con. Leave the Masquerade and Hall H where they are, but move other things out to another venue. There are lots of hotels nearby and the two places mentioned above are open as well. I see no reason why the city of San Diego cant embrace the convention fully and become a city of comics, movies, TV, and games. Turn the whole city into Comic-Con, and grow from there.</p>\n\t\n\t<p>TL;DR: Comic-Con is awesome, but overcrowded. A possible solution is presented: Expand.</p>" 
}