{"status":"publish","pubdate":"Sun, 14 Sep 2014 02:04:11 -0000","tags":"space debris","author":"Brian Schrader","content":"<p>In a break from our regularly scheduled developer-oriented topics, we're taking a break to talk about orbital space debris...</p>\n<p><img alt=\"Insert canned space junk image here\" src=\"http://brianschrader.com/images/blog/space_junk.jpeg\" /></p>\n<p>The amount of <a href=\"http://en.wikipedia.org/wiki/Space_debris\">debris in Earth orbit</a> is <a href=\"http://orbitaldebris.jsc.nasa.gov/faqs.html#5\">growing every year</a>. Every launch we dump more things into orbit to float around aimlessly crowding an already crowded area. That junk hits other junk and breaks apart, good right?. No. <a href=\"http://orbitaldebris.jsc.nasa.gov/faqs.html#3\">Smaller pieces</a>, often moving faster, are harder to track. Some of these pieces are fractions of inches big and are impossible to track. Combine this small size with the fact that the pieces move at a speed of around <a href=\"http://orbitaldebris.jsc.nasa.gov/faqs.html#7\">7km/s</a> (per <em>second</em>) and that pebble-sized debris becomes <em>really</em> dangerous.</p>\n<p>Because of a lot of regulation and Cold War era crap cleaning up this space junk is a legal nightmare. Nations can only clean up the stuff they own, cleaning up another nation's junk immediately makes that nation in violation of a whole myriad of laws, and any private vendor who touches this debris immediately becomes a \"<a href=\"http://en.wikipedia.org/wiki/Space_pirate\">space pirate</a>\" (awesome name, not-so-awesome ramifications).</p>\n<p>The amount of space debris is growing every year, and although there is a lot of collaboration to prevent the growth of such debris, the amount currently in orbit is already worrisome. <a href=\"http://orbitaldebris.jsc.nasa.gov/faqs.html#12\">It doesn't go away either</a>.</p>\n<p>The problem is still unsolved and remains a <em>huge</em> economic and political challenge. The most harrowing fact about this debris is that if unchecked it may soon be very <a href=\"http://www.newscientist.com/article/dn18050-space-debris-threat-to-future-launches.html#.U_AtxEuzsgo\">dangerous if not impossible to launch craft into orbit.</a></p>\n<p>I'm not trying to be a sandwich-board-wearing, doomsday-heralding, rambling, crazy-person here. I'm just bringing it up. We do need to find a solution. Its a serious problem.</p>\n<p><a href=\"http://orbitaldebris.jsc.nasa.gov/faqs.html\">NASA's Space Debris FAQ</a></p>\n<p><a href=\"http://www.universetoday.com/113884/how-can-we-clean-up-that-space-junk/\">How Can We Clean Up That Space Junk?</a></p>","link":"http://brianschrader.com/archive/space-junk","location":"/archive/space-junk/","published":"Sun, 14 Sep 2014 ","title":"Space Junk","slug":"space-junk","article-number":48}