{"status":"publish","pubdate":"Wed, 16 Apr 2014 06:31:48 -0000","tags":"ios8, apple, wwdc","author":"Brian Schrader","content":"<p>WWDC is right around the corner. It's not a very long list, but here's my feature wish list for iOS 8 and a little on the iPhone 6:</p>\n<ul>\n<li><a href=\"http://www.imore.com/ios-7-wants-actionable-notifications-push-interface\">Actionable Notifications</a> (like in OS X Mavericks)</li>\n<li>Maps travel time (<em>also</em> like in OS X Mavericks)</li>\n<li>Better Inter-App Communication (we've been asking for this for years now)</li>\n<li>That Siri API we've been wanting (<a href=\"http://www.techradar.com/us/news/phone-and-communications/mobile-phones/cortana-everything-you-need-to-know-about-microsoft-s-siri-rival-1183607\">Cortana</a> and Google Now aren't getting worse).</li>\n<li>Offline Siri dictation (like in Mavericks...)</li>\n<li>Battery Shaming (like in Mavericks... you get the point?)</li>\n<li>Mac-iOS AirDrop compatability</li>\n<li>A public <a href=\"http://stackoverflow.com/questions/19019031/how-can-an-ios-7-app-make-itself-transparent-to-see-a-users-home-screen-image\">API for developers to see and use the home screen background </a>(Safari can do this, but its private)</li>\n<li>As for the iPhone 6 I have but one request: better battery life (I can dream can't I?).</li>\n</ul>\n<p>It'll be interesting to see what Apple brings to the table this year. The feature request lists get shorter every year, and this year its really short. It would make me happy just to see the features in Mavericks that I love make their way to iOS. I'd be thrilled with just that, though I'm sure there's more.</p>\n<p>Really my biggest concern is if they'll announce any new retina Macbook Pros. I'll be in the market for one soon, and I don't want to get one if they are just about to refresh them.</p>","link":"http://brianschrader.com/archive/my-ios-8-wishlist","location":"/archive/my-ios-8-wishlist/","published":"Wed, 16 Apr 2014 ","title":"My iOS 8 Wishlist","slug":"my-ios-8-wishlist","article-number":11}