{"status":"publish","pubdate":"Fri, 28 Nov 2014 18:04:36 -0000","tags":"star wars, teaser","author":"Brian Schrader","content":"<p>It looks good. As a few people on Twitter have said, this trailer feels more like Star Wars than the prequels did, and I'd have to agree. There's X-Wings, the Millennium Falcon, Rebel pilots, and more. Truth be told though, my brain still doesn't know how to process the trailer. Its harder than I would have thought to accept that there's going to be a new Star Wars. Regardless, the teaser looks very promising. Let's hope the movie is as good.</p>\n<p><a href=\"https://www.youtube.com/watch?v=OMOVFvcNfvE\">Star Wars VII Teaser Trailer &#8594;</a></p>\n<p>...</p>\n<p>Ok well I thought I could get through this without talking about the new lightsaber. I can't, so here goes.</p>\n<p>I like the new lightsaber a lot. For something that was on screen for literally two seconds, I have more thoughts on it than the entire rest of the trailer.</p>\n<p>To start, it looks like reinventing the lightsaber is something that only the Sith can do, and it's nice to see them continuing to change the design. Putting aside the impracticality of it, (since come on, it's Star Wars) I really like the new look of the blade. By making it more than just a solid beam of light, it gives the weapon a dangerous look. The blade looks like it's just barely contained; it could fail at any moment. It gives the weapon a feeling it's never had before. The lightsaber is no longer a dignified weapon of noble knights, but savage weapon, a shadow of its former self, a relic of a bygone age.</p>\n<p>Star Wars has always been a \"used-future\" universe, and the lightsabers have always looked too new, too nice for the world they're in. The Sith are stretched thin, as far as we know, and the Jedi are in the process of recovering from utter destruction. The Empire is trying to recover from the loss of its leader, and the Rebellion is trying to make the most of it's victory over the Empire. A barely functional lightsaber in a barely functional world is a nice bit of symbolism. </p>\n<p>Lightsabers are the weapons of the Jedi Knights, elegant weapons, for a more civilized age... a bygone age. This Star Wars takes place in a new world, a brutal world, a broken world. It's only fitting that the new lightsabers reflect that.</p>","link":"http://brianschrader.com/archive/star-wars-vii-teaser-and-thoughts-on-the-new-lightsabers","location":"/archive/star-wars-vii-teaser-and-thoughts-on-the-new-lightsabers/","published":"Fri, 28 Nov 2014 ","title":"Star Wars VII Teaser (and thoughts on the new lightsabers)","slug":"star-wars-vii-teaser-and-thoughts-on-the-new-lightsabers","article-number":74}