{"status":"publish","pubdate":"Sun, 22 Feb 2015 23:20:50 -0000","tags":"microblog crawler diary","author":"Brian Schrader","content":"<p>Akin to <a href=\"http://inessential.com/vespersyncdiary\">Brent Simmons' Vesper Sync Diary</a> I think I'm gonna start posting updates and concerns that I have as I continue to develop the various parts of Microblogger. </p>\n<p>So far, my biggest issue, aside from learning <a href=\"http://flask.pocoo.org\">Flask</a>, has been constructing the user's home timeline. For those who are unfamiliar with Microblogger, basically the home timeline looks just like Twitter's timeline. It consists of a reverse chronological list of posts by people that the user follows. Since Microblogger has to construct this timeline from disparate XML feeds, I have to account for future developers not including timezones in their <code>pubdate</code> strings. </p>\n<p>Here's the basic problem. Consider that I have a correctly formatted microblog post:</p>\n<pre><code>&lt;item&gt;\n    &lt;guid&gt;{some guid}&lt;/guid&gt;\n    &lt;description&gt;Hi!&lt;/description&gt;\n    &lt;pubdate&gt;Wed, Feb 28 2014 08:00:00 EST&lt;/pubdate&gt;\n&lt;/item&gt;\n</code></pre>\n<p>Now consider that I have an incorrectly formatted one:</p>\n<pre><code>&lt;item&gt;\n    &lt;guid&gt;{some guid}&lt;/guid&gt;\n    &lt;description&gt;Hi!&lt;/description&gt;\n    &lt;pubdate&gt;Wed, Feb 28 2014 05:01:00&lt;/pubdate&gt;\n&lt;/item&gt;\n</code></pre>\n<p>Which post comes first? Initially you would think the top one would come first since it was posted after the second. However if we know that the second was posted in Pacific Standard Time, then it should actually come first, and not 3 hours behind. Accounting for bad formatting is arguably something I should hold off on doing until I encounter it, and I've thought about that a lot. However, I think I've come up with a very simple way to work around this problem for a large percentage of cases where this happens.</p>\n<p>My workaround is to use the timezone present in the HTTP response timestamp. </p>\n<pre><code>HTTP/1.1 GET\nDate: Wed, Feb 28 2014 08:31:00 EST\n</code></pre>\n<p>This will tell me the timezone that the server is in, and from there I can assume the most likely timezone for the <code>pubdate</code> is the same.</p>\n<p>So that's how I'm proceeding: If there is no timezone present in the <code>pubdate</code>, then use the timezone from the HTTP response header. </p>","link":"http://brianschrader.com/archive/microblog-crawler-diary-timezones","location":"/archive/microblog-crawler-diary-timezones/","published":"Sun, 22 Feb 2015 ","title":"Microblog Crawler Diary: Timezones","slug":"microblog-crawler-diary-timezones","article-number":87}