{"status":"publish","pubdate":"Sat, 12 Apr 2014 19:25:09 -0000","title":"The NSA knew about and exploited the Heartbleed Bug","author":"Brian Schrader","content":"<p>The <a href=\"http://www.cnet.com/news/heartbleed-bug-what-you-need-to-know-faq/\">Heartbleed SSL</a> bug is <a href=\"http://time.com/59390/heartbleed-internet-security-routers/\">no joke</a>. If you don't know, SSL is the security mechanism that websites use for HTTPS security. Your bank, your Facebook account, your mortgage lender, your online stores, your home router, everything uses HTTPS for encryption and this bug is something that compromises all of that, and its been there for 3 years! It was a bug that the developers, had they discovered it sooner, they would have patched it immediately, but they didn't know about it. Turns out the NSA did know about it, and they chose to keep it a secret, and worse to exploit it.</p>\n<p><a href=\"http://www.bloomberg.com/news/2014-04-11/nsa-said-to-have-used-heartbleed-bug-exposing-consumers.html\">Reports claim</a> that the NSA not only knew, for years I might add, about this bug, but they exploited it to get our private information. Its almost hilarious how much they were able to acquire.</p>\n<p><a href=\"http://www.marco.org/2014/04/11/nsa-knew-of-heartbleed\">Marco Arment</a> gave his input on this, and I mostly agree with him on this. The NSA exploits and undermines the security of major tech companies and infrastructures to steal information, to infringe on privacy, and to <a href=\"http://www.washingtonpost.com/wp-srv/special/national/black-budget/\">sabotage the backbones of the internet</a> in order to get this information. To me, the worst thing about the NSA, <em>aside</em> from the fact that they maliciously steal our private data and take no heed as to what they steal, is that after all that, the NSA refuses to be helpful, they refuse to use their powers to do anything good.</p>\n<p>The NSA knew about this bug years ago, <em>years ago</em>, and did nothing. They took advantage of it instead of fixing it. Software, and security won't get better without the people who discover these vulnerabilities telling the developers about it so they can, wait for it, FIX IT! We don't know who <em>else</em> was able to steal data during those years and its bad enough that even the NSA did. Wouldn't we all be better off if they used their billions of dollars to help the world's security, and not compromise it? To me that's the real danger of the NSA. They spend billions and act just as maliciously as common hackers. They aren't doing the world any good, they're just assholes.</p>\n<p><span style=\"font-size:small;\">\nNote: What's worse is that the bug has been out there so long and is in so many systems that it will be a long time before its fully patched, and your data is vulnerable the entire time that's the case.\n</span></p>","link":"http://brianschrader.com/archive/heartbleed-and-the-nsa","location":"archive/heartbleed-and-the-nsa","published":"Sat, 12 Apr 2014 ","slug":"heartbleed-and-the-nsa","article-number":8}