{"status":"draft","pubdate":"Fri, 17 Jul 2015 07:45:59 -0000","author":"Brian Schrader","tags":"hiking, pct, section c","content":"<p>I've always wanted to hike the <a href=\"https://en.wikipedia.org/wiki/Pacific_Crest_Trail\">Pacific Crest Trail</a>. Last week, a part of that dream came true. Last week, two friends and I hiked a section of the PCT, from Klamath Falls, OR to Crater Lake, OR. It was a trip long awaited, and it meant a lot to those of us involved. I knew one friend, Sean, from Scouting years ago, and Nathaniel from college. The three of us had talked about the possibility of doing a trip like this back in November of 2014, the weekend of Thanksgiving, and last week it finally happened.</p>\n<p>For those who don't know, the Pacific Crest Trail is a 2,663 mile long trail that begins at the U.S. border with Mexico in California, and goes north, through the Sierra Nevada Mountains, into Oregon, into Washington, and ends at the U.S. border with Canada. It's mind-blowing that this trail, which is only 2 feet wide, stretches from Mexico to Canada. It goes through the <a href=\"http://www.pcta.org/discover-the-trail/geography/southern-california/\">desert</a> over the <a href=\"http://bikehikesafari.com/2015/05/31/pct-day-43-into-the-sierras/\">Sierras</a>, past <a href=\"http://trailsandtreasures.com/pct_near_mt_shasta.htm\">Mt. Shasta</a>, into the Cascades, and into British Columbia. To hike the whole thing, \"through-hikers\" set aside three to four months. This wasn't the case for us. We had decided to hike one of the many sections that the PCT is broken into: Oregon Section C. Totaling 53 miles, this section is often referred to as one of the easiest sections of the trail, which made it good for us (Sean and I hadn't been backpacking in years), and it's one of the most beautiful, forested sections (coming from Southern California and Tucson there aren't too many trees, so that was a nice change). We'd be on the trail for 4-5 days and have a few days on either side to see Crater Lake, and rest.</p>\n<h2>What follows is an account of the journey</h2>\n<p><strong>Day 1:</strong> Once everyone had arrived, Sean on the train, and Nathaniel and I on a plane, and <a href=\"https://www.youtube.com/watch?v=uT9MITGrcFk\">no one from a car</a>, we set off, with smiles on our faces, on a shuttle from Klamath Falls, OR to our starting point off Hwy 140. We'd spent months planning to get here, and we were all thrilled to get started.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/the-gangs-all-here.jpg\"><img alt=\"The Gang's All here!\" src=\"http://brianschrader.com/images/collections/pct-hike/the-gangs-all-here-comp.jpeg\" /></a></p>\n<p>After being dropped off by the shuttle, we started hiking. </p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/the-trailhead.jpg\"><img alt=\"The Trailhead\" src=\"http://brianschrader.com/images/collections/pct-hike/the-trailhead-comp.jpeg\" /></a></p>\n<p>At the trailhead I found a walking stick that someone had left there. The tip was covered in charcoal and the handle was already worn; someone had used and loved that stick, and now I was its next holder. It served me well.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/setting-out.jpg\"><img alt=\"Setting out\" src=\"http://brianschrader.com/images/collections/pct-hike/setting-out-comp.jpeg\" /></a></p>\n<p>Needless to say, the trail was gorgeous.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/hiking-day-1.jpg\"><img alt=\"Hiking Day 1!\" src=\"http://brianschrader.com/images/collections/pct-hike/hiking-day-1-comp.jpeg\" /></a></p>\n<p>At the end of a tiring day, and 10.5 miles, we set up camp, exhausted, and went to sleep.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/day-1-camp.jpg\"><img alt=\"Day 1 Camp\" src=\"http://brianschrader.com/images/collections/pct-hike/day-1-camp-comp.jpeg\" /></a></p>\n<p><strong>Day 2</strong> was filled with amazing vistas and high ridges.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/the-trail-forested.jpg\"><img alt=\"The trail forested 1!\" src=\"http://brianschrader.com/images/collections/pct-hike/the-trail-forested-comp.jpeg\" /></a></p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/resting-ridge.jpg\"><img alt=\"Resting on a ridge\" src=\"http://brianschrader.com/images/collections/pct-hike/resting-ridge-comp.jpeg\" /></a></p>\n<p>Surprisingly, we had cell service up here.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/ridge-view.jpg\"><img alt=\"Ridge view\" src=\"http://brianschrader.com/images/collections/pct-hike/ridge-view-comp.jpeg\" /></a></p>\n<p>And a spectacular camp site on the top of a mountain.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/day-2-camp.jpg\"><img alt=\"Day 2: Camp\" src=\"http://brianschrader.com/images/collections/pct-hike/day-2-camp-comp.jpeg\" /></a></p>\n<p>It was a long, mosquito filled day, but we were happier, and more energetic than the day before. We cooked ourselves dinner, and, from our high perch, we watched the sun go down, mantling the mountains in the red-purple evening light.</p>\n<p>One of the weirdest things was being in the middle of nowhere, but still hearing fighter jets fly over, and still having cell signal enough to call home. The wilderness isn't as devoid of distraction as one might have thought, and that's both a good and bad thing at times.</p>\n<p><strong>Day 3 </strong> would prove to be the day of our highest highs, and lowest lows. We would reach the tallest peaks, feel the best we had in days, and end on the worst note of the entire trip.</p>\n<p>It all started off on a weird note as we entered the remnants of an old forest fire.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/burned-forested-trail.jpg\"><img alt=\"Burned out forest\" src=\"http://brianschrader.com/images/collections/pct-hike/burned-forested-trail-comp.jpeg\" /></a></p>\n<p>Traversing such a breathtaking and scarred landscape was something none of us had done before, and it was an experience I recommend, if only for its wonder. The utter silence is, at the same time, both captivating, and deeply unsettling as no sound of birds, or buzzing of mosquitos was present here. All was silent.</p>\n<p>After the journey through the silent, dead swaths of burned out forest, we found ourselves on the top of a hill. A perfect retrospective of our progress thus far.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/lookback.jpg\"><img alt=\"Looking back\" src=\"http://brianschrader.com/images/collections/pct-hike/lookback-comp.jpeg\" /></a></p>\n<p>That mountain in the back was where we started.</p>\n<p>After a short break, we found ourselves traversing some rocky ridges on the way to our highest high.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/rocky-ridge.jpg\"><img alt=\"Rocky ridge\" src=\"http://brianschrader.com/images/collections/pct-hike/rocky-ridge-comp.jpeg\" /></a></p>\n<p>When we'd finally ascended to 7,329ft above sea level, we found ourselves at the top (or almost at the top) of Devil's Peak...</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/devils-peak.jpg\"><img alt=\"Devil's Peak\" src=\"http://brianschrader.com/images/collections/pct-hike/devils-peak-comp.jpeg\" /></a></p>\n<p>with a most spectacular view to the west.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/the-view-from-the-top.jpg\"><img alt=\"view from the top\" src=\"http://brianschrader.com/images/collections/pct-hike/the-view-from-the-top-comp.jpeg\" /></a></p>\n<p>The way back down would greet us with 5 water stops in the span of 2 miles, which we heartily enjoyed, and some trail guides tasked with clearing logs and cutting trees in the area. Nice people, but they were only carrying day-packs so they must have been getting in and out somewhere, but alas, we never found out where.</p>\n<p>After filling up on water, and cooking our dinner at the river, we had decided to hike one more mile before setting up camp. We were optimistic, and enthusiastic. Today had been our best day by far... at least until now...</p>\n<p>During that last mile, Sean slipped and fell in a stagnant, mosquito filled pond, and I received a lovely gift from the microbes in the river water. All of that, coupled with that last mile being the most mosquito filled section of the trail had us quite beaten down when we finally settled and set up camp for the night. We went to bed exhausted, and nearly beaten from that last mile. </p>\n<p>Unfortunately, as we all knew, the next day would be a hard one: it was our first of two whole days without the ability to fill our water stores. Whatever we had now was all we'd have to last 2 days. We'd known about this section of the trail before setting out. There's a 20 mile section where there is no place to get water. The last stop, after that river Sean fell into, was the campground Mazama. </p>\n<p>Battered and tired, and less willing then ever to go without water for long, we elected to try to cover the entire 20 miles in one day, double our so-far daily milage. We all knew it was going to be a difficult thing to attempt, but the prospect of being left without water, and with another night between ourselves and a burger at the Mazama cafe, war too much to stand. We would try 20 miles in one day.</p>\n<p><strong>Day 4:</strong> I have only one picture of day 4; it was a long one. We did it though, 20 miles. </p>\n<p>The trail took us over more ridges, through more burned, and scarred terrain, and onto some lovely vistas, all of which are left to the imagination of the reader. We didn't have much time to stop and take pictures, we were on a tight schedule.</p>\n<p>I do have this picture though. It's of the 3 of us when we finally arrived at Mazama and sat in our campsite. We'd been hiking for 12 hours and had covered 20 miles. Each of us had blisters galore on our feet, and desperately needed a shower. Nathaniel was so dazed in this picture couldn't even lift his thumb, while I looked like a hobo. At least Sean managed to hold back the pain long enough to take a semi-decent picture (he's lying though. He hurt a lot).</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/at-mazama.jpg\"><img alt=\"At Mazama\" src=\"http://brianschrader.com/images/collections/pct-hike/at-mazama-comp.jpeg\" /></a></p>\n<p>We didn't last long that night after this. We showered, ate microwave burritos from the convenience store, and went to bed.</p>\n<p><strong>Day 5:</strong> We literally did nothing all day. Exhausted from the day prior, and a day (actually 2) early in the schedule, we took some time to relax, play card games, and eat the burger we earned the day prior. We even built ourselves an awning from some lashed poles and my tent's rainfly to shade ourselves while we played cards.</p>\n<p>As a side note: We ate at the Mazama Cafe for both lunch and dinner that day (because we earned it, that's why) and I'd just like it to be known that Sean loved the Oregonzola burger so much, he had it for lunch <em>and</em> dinner.</p>\n<p><strong>Day 6 and 7:</strong> For the next two days we bounced between Mazama and our final destination because of logistical reasons, and I'm combining these days because, really, we spent them in the same place, our destination, Crater Lake.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/crater-lake-pano.jpg\"><img alt=\"Crater Lake\" src=\"http://brianschrader.com/images/collections/pct-hike/crater-lake-pano-comp.jpeg\" /></a></p>\n<p>There were other happenings during the day like how it rained on and off, or how we were left behind by the trolley and had to hike 5 miles back to our camp site that evening, but really the majesty of Crater Lake blew all that out of the water.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/crater-lake.jpg\"><img alt=\"Crater Lake, again\" src=\"http://brianschrader.com/images/collections/pct-hike/crater-lake-comp.jpeg\" /></a></p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/from-the-wall.jpg\"><img alt=\"Crater Lake, again, again\" src=\"http://brianschrader.com/images/collections/pct-hike/from-the-wall-comp.jpeg\" /></a></p>\n<p>At the end of the day, we spent time at the lodge, and at the meadow next door overlooking Crater Lake and all its immense glory, but as these things usually go, it was soon time to get on the shuttle and head home. Before that, I needed to leave something behind, something that had come to the trail before me, and helped another hiker get to his destination, as it had me. It was time to leave my walking stick akin to where I'd found it, at a trail marker on the PCT.</p>\n<p><a href=\"http://brianschrader.com/images/collections/pct-hike/hiking-stick.jpg\"><img alt=\"My hiking stick\" src=\"http://brianschrader.com/images/collections/pct-hike/hiking-stick-comp.jpeg\" /></a></p>\n<p>On the shuttle ride home I found myself in a somber mood. All of that awe-inspiring scenery, the grand wilderness, the epic feeling of exploration, and the grandeur of Crater Lake were all behind us now. Nothing would compare after that. Yet, here we were, flying home to our lives as they were before we left, all right where we left off. Going home was bittersweet as the ending to vacations often are. </p>\n<p>I'll miss those wide open spaces.</p>\n<h2>What I learned</h2>\n<p>Everyone, and I mean everyone, should attempt a section of the Pacific Crest Trail. Even just a day hike for 2 miles would do. The Oregon section we did covered some of the most expansive, and breathtaking scenery I've ever seen, and it truly is a wondrous experience to take that step back from our busy, city lives and see just how big the wild actually is. </p>\n<p>From the vantage point we had, upon the tops of mountains looking down, and from the bottoms of valleys looking up, you truly get the feeling that the world is a bigger place than we like to believe, that the world is grander than our daily, mundane perception of it. The Earth is a magnificent place, and being out there, seeing the things we did, connecting with the world in the way that we only can in the wild, is a truly awe-inspiring experience.</p>\n<p>The people we met along the way, either section-hikers like ourselves, or the crazy through-hikers, or even just the people at Mazama and on the shuttle, everyone was kind, enthusiastic, and helpful. We couldn't have done what we did without the help of the people at the Klamath Falls Shuttle and Point Shuttle. They ferried us back and forth from town to the trailhead and back. A backpack on your back, at least in Oregon, let people know who you were. Pacific Crest Trail hikers have a certain credibility there, and the people of Klamath Falls, Crater Lake, Mazama and Medford seem to know what that means. Everyone was courteous, and more than respectful. I can't thank them enough.</p>\n<p>This was my first excursion down a small part of the Pacific Crest trail, and I don't know when my next will be, but it can't come soon enough. </p>\n<p>Well, maybe it can wait until after my bug bites heal. Yeah, that would be good.</p>","published":"Fri, 17 Jul 2015 ","title":"Hiking the Pacific Crest Trail","slug":"hiking-the-pacific-crest-trail"}