{"status":"publish","pubdate":"Fri, 30 May 2014 04:52:14 -0000","title":"Multithreading in Java","author":"Brian Schrader","content":"<p><link rel=\"stylesheet\" href=\"http://yandex.st/highlightjs/8.0/styles/default.min.css\">\n<script src=\"http://yandex.st/highlightjs/8.0/highlight.min.js\"></script>\n<script>hljs.initHighlightingOnLoad();</script></p>\n<p>I work as a Java Software Developer. That being the case, I know comparatively little about Java<a href=\"#note1\">*</a>. I'm much more versed in Objective-C, of all things, and in PHP, or even Python, than Java. As such I've had quite a few occasions I've needed to do some task or another and I'm at a loss for the Java method, so I put together this handy-dandy little guide.  </p>\n<p><img src=\"http://brianschrader.com/images/blog/branches.png\" class=\"image-center hide-on-mobile\" style=\"width:70%;\"></p>\n<p>Let's assume that I want to do some heavy processing, but not have it clog up the main thread, a pretty common task. In Objective-C we have Grand Central Dispatch.</p>\n<h2>GCD and Multithreading in Objective-C</h2>\n<p><pre><code class=\"objc\">\ndispatch_async( dispatch_get_global_queue( DISPATCH_QUEUE_PRIORITY_DEFAULT, 0), ^(void){\n        //Do your long processing job here.\n    });\n</code></pre></p>\n<p>And in Objective-C, if I want to return to the main thread to do some UI Updates, or return to do something else I just add 1 line and it becomes:</p>\n<pre><code class=\"objc\">\ndispatch_async( dispatch_get_global_queue( DISPATCH_QUEUE_PRIORITY_DEFAULT, 0), ^(void){\n    //Do your long processing job here.\n    dispatch_async( dispatch_get_main_queue(), ^(void){\n        //Run UI Updates\n    });\n});\n</code></pre>\n\n<h2>Now, In Java</h2>\n<p>In Java, I wanted to do the same thing, dispatch work to be done on another thread. After some research, I found this on StackOverflow. It seemed to be just want I wanted.</p>\n<h3>Using Threads (The Wrong Way)</h3>\n<pre><code class=\"java\">\nnew Thread(new Runnable() {\n    public void run() {\n        //Do your heavy lifting here.\n    }\n}).start();\n</code></pre>\n\n<p><img src=\"http://brianschrader.com/images/blog/java.png\" class=\"image-right hide-on-mobile\" style=\"width:30%;\"></p>\n<p>This tells Java, literally, to make a new thread and execute this code on that new thread. Unlike in Objective-C where I'm handing some code off to a queue that might make a new thread, choose an existing one, or whatever. This also means that, in Java, the developer is tasked with maintaining that thread, and as far as I know, it isn't handled like regular system threads. As such, this is kind of frowned upon.</p>\n<p>The problem I encountered in testing this was 2-fold. First, the task was unable to give status updates or return to the main thread without considerably more code, and second, if the process encountered an Exception it went uncaught and you'd never know that anything happened. Obviously there are ways around both of those things, but they require significant changes to the source code, and I wanted an inline solution just like GCD in Objective-C. Let's try something else.</p>\n<h3>Using Executors (The Right Way)</h3>\n<p>After more research, I discovered a way to accomplish what I wanted in an inline way that was preferred by the Java community and worked the way I wanted. There's three options for doing this depending on what you need to accomplish.</p>\n<p>If you want to do some execution on another thread but don't need results or status updates from it then this code should work.</p>\n<h4>Asynchronous Execution (No Status Updates, No Returns, No Exceptions)</h4>\n<pre><code class=\"java\">\nExecutorService executorService = Executors.newSingleThreadExecutor();\nexecutorService.execute(new Runnable() {\n    public void run() {\n       //Do your heavy lifting here. \n    }\n});\nexecutorService.shutdown();\n</code></pre>\n\n<h4>Asynchronous Execution (Status Updates, but No Returns, No Exceptions)</h4>\n<p>If you need to check on the task, but not get values from it: \n(i.e. you want to know if its finished, but you dont care about getting results). </p>\n<pre><code class=\"java\">\nFuture future = executorService.submit(new Runnable() {\n    public void run() {\n        //Do your heavy lifting here.\n    }\n});\nfuture.get();  //returns null if the task has finished correctly.\n</code></pre>\n\n<h4>Asynchronous Execution (Status Updates, Returns, and Exceptions)</h4>\n<p>If the task needs to return values, or throw exceptions, then use a Callable instead of Runnable.</p>\n<pre><code class=\"java\">\nFuture future = executorService.submit(new Callable(){\n    public Object call() throws Exception {\n        //Do your heavy lifting here.\n        return \"Callable Result\";\n    }\n});\nSystem.out.println(\"future.get() = \" + future.get());\n</code></pre>\n\n<p>Hopefully this little guide helps you. Let me know if you have any suggestions or if you want to correct me. As I said, Java isn't my strongest language and I may have gotten some details wrong regarding the benefits of each approach. Overall, I still admire Objective-C's implementation, it just feels more straight forward and readable. I know that people have <a href=\"http://hawtdispatch.fusesource.org\">ported GCD</a>, which Apple <a href=\"http://libdispatch.macosforge.org\">open sourced</a>, to Java and other languages, but for business applications, that kind of thing isn't really accepted. I'm stuck doing it the Java way, which is fine.</p>\n<p><span id=\"note1\" style=\"font-size:small;\">\n* Java is a language I learned in class and hadn't touched again until I was roped in to do Java Development at work. Its not my favorite language, but it gets the job done and its community is enormous. If you have questions, the Java section of StackOverflow has an answer. \n</span></p>\n<p><span id=\"note2\" style=\"font-size:small;\">\n** I've been sitting on this article for a while, mostly because I didn't know if these \"answers\" were correct or not. Now that I've not only researched this topic more, but I've actually used it quite a bit, I'm far more confident in the answers I'm giving.\n</span></p>\n<p><span id=\"note3\" style=\"font-size:small;\">\n*** Also, <a href=\"http://highlightjs.org\">Highlight.js</a> is really cool.\n</span></p>","link":"http://brianschrader.com/archive/multithreading-in-java","location":"/archive/multithreading-in-java/","published":"Fri, 30 May 2014 ","slug":"multithreading-in-java","article-number":21}