{"status":"publish","pubdate":"Mon, 25 Aug 2014 00:01:47 -0000","tags":"twitter, open web","author":"Brian Schrader","content":"<p>Twitter announced that it will be <a href=\"http://mashable.com/2014/08/20/twitter-timeline-changes-confirmed/\">changing the way the timeline works</a>. Instead of being a list of posts from people you follow, the timeline will now include things that Twitter thinks you'd like to see (basically what Facebook does). For a lot of people, that's a huge pain-point, myself included. Twitter is great because it's what I want to see, not what Twitter wants me to see. Of course, there are people threatening to leave Twitter forever (just like the people who threaten to delete their account whenever YouTube changes their interface). The trouble is that there's no place for us to go. We'd all love to take our attention elsewhere, but where? Facebook shoo'd us away, and Twitter threatens to do the same. As a user, you'll only go where your friends are. That's the hold they have on us. I can say, \"I'm fed up and I'm going to Twitter-clone X!\" But without the people that I want to talk to also being on Twitter-clone X it's no fun there.</p>\n<blockquote class=\"twitter-tweet\" align='center' lang=\"en\"><p>It&#39;s amazing that an open standard like email became so ubiquitous. If email came out today, it would be nerd-only tech no one uses.</p>&mdash; Brian Schrader (@sonicrocketman) <a href=\"https://twitter.com/sonicrocketman/statuses/503672083805503488\">August 24, 2014</a></blockquote>\n\n<script async src=\"http://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>Social media is a very siloed operation, it doesn't have to be (not by any stretch of the imagination) but it is. Twitter, Facebook and messaging are all holed up in their little domains and that structure keeps you tied to a particular service. People blame Apple for supposed platform lock-in, but social network lock-in is arguably a lot more mischievous than anything Apple does. </p>\n<p>Twitter has made it clear that its third-party developers (like those behind amazing apps like <a href=\"http://tapbots.com/software/tweetbot/\">Tweetbot</a> and <a href=\"http://twitterrific.com/ios\">Twitterific</a>) are not crucial to its future. They were once committed to an open infrastructure, but no more (and Facebook never was). Eventually Twitter will probably become just like Facebook; what will we do then? Stay with it? I hope not, but I fear so.</p>\n<p>This whole situation has me worried, frantically looking around for alternatives. Google+ (as much as Google would try to convince you otherwise) is not very popular. App.net failed, never reaching critical mass. Could it be that the time for new social networks is past us? I hope not. RSS succeeded as an open standard, and so did email (though email had an early start). The podcasting industry is growing, powered by RSS. It's nowhere near the popularity of other social media platforms, but it is big and growing. Social media is a big part of people's lives, I don't really believe that we know just how important it is to us. Having that communication, that sharing of opinions censored, shutdown, or controlled by a single entity is a scary thought. There's no chance that Podcasts could die with a company (arguably Apple's podcast directory would be a huge loss) and RSS use floundered after Google Reader shutdown, but RSS is still with us. That's important.</p>\n<blockquote class=\"twitter-tweet\" align='center'  data-conversation=\"none\" lang=\"en\"><p><a href=\"https://twitter.com/stevedekorte\">@stevedekorte</a> Most decentralized systems fail. Every attempt at a decentralized messaging system, except email, has failed.</p>&mdash; Steve Streza (@SteveStreza) <a href=\"https://twitter.com/SteveStreza/statuses/234804015173623808\">August 13, 2012</a></blockquote>\n\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>I'm not some doomsday-warning, sandwich-board-wearing maniac here, and I'm not claiming that Twitter will do evil things in the future (the definition of \"evil\" here is up for debate), but I am saying that our communication, which is currently under the control of 1 or 2 companies, shouldn't be in such a fragile situation. Twitter is still struggling to become profitable, and it is perfectly possible that they could go under in the future. What happens when they do? The way we communicate is affected. Twitter is used, right now, as a echo chamber for public outcry. Countries have fought to ban Twitter and block it from their citizens. Twitter and Facebook are big deals, but they are controlled systems. That could become a big problem if something were to happen to them in the future.</p>\n<p>Some quick Googling yielded a couple of open alternatives <sup>1, 2</sup> to Twitter, neither has a huge following right now, and are pretty nerd-oriented. Trsst is a little friendlier, but it's still in Alpha. Overall though, I worry what the future holds for social media. I actually do hope that something forces us to adopt an open standard (like Podcasting does) so that our communication can remain out of the greedy palms of corporate interest, but I fear that may not happen. For now, we're stuck with Twitter and its stupid, not-really-timelines-anymore timelines.</p>\n<div id='alt' style='font-size:small;'><ol>\n<li><a href='http://podupti.me'>Podupti: A distributed social network</a></li>\n<li><a href='http://www.trsst.com'>Trsst: A Social Network based on BitCoin and RSS</a></li>\n</ol></div>","link":"http://brianschrader.com/archive/twitter-and-the-open-web","location":"/archive/twitter-and-the-open-web/","published":"Mon, 25 Aug 2014 ","title":"Twitter and the Open Web","slug":"twitter-and-the-open-web","article-number":40}