{"status":"publish","pubdate":"Sat, 13 Dec 2014 07:16:12 -0000","title":"Microblogger status updates and more","author":"Brian Schrader","content":"<p>Over the last few weeks I've been working on the first implementation of Microblogger (new name desired): a self hosted microblog implementing the <a href=\"http://openmicroblog.com\">Open Microblog standard</a>. Work has been slower than I'd like, but steady nonetheless. The <a href=\"http://github.com/Sonictherocketman/microblog_crawler\">microblogcrawler</a> I announced a couple weeks back, was just one of many pieces of the project, and one that could easily be spin off into its own little sub-project.</p>\n<p>Yessir, all was going well: basic crawling is almost in place, and almost everything regarding the user's data and profile is good to go. I was working on adding another crawler to the mix (for on demand requests) and flushing out the caching engine last time I touched the project, trouble is that was over a week ago. Since then all progress has stopped. </p>\n<p>Due to a colony of microbes wreaking havoc on my immune system, I've been out of commission all week. With a busy weekend ahead of me, I'm holding out hope that I'll be able to get something done, but it probably won't be much. Either way, next week, I'm diving back in. </p>\n<p>I won't promise anything, but my tentative release date is the end of the month. That said, there's still a lot to do. As of now my remaining tasks for version 1.0 are:</p>\n<ul>\n<li>Fix bugs in the posting system.</li>\n<li>Create another (more dynamic) crawler that can be spun up on demand to fulfill user requests.</li>\n<li>Make the website actually good.</li>\n<li>Implement messaging (public only for version 1.0)</li>\n<li>Complete and test the caching engine.</li>\n<li>Finish making tests for everything.</li>\n</ul>\n<p>These come in no particular order, and as you can see, some of them are pretty big. I've also documented most of these items in the <a href=\"https://github.com/Sonictherocketman/Microblogger/issues\">Issues section</a> of the project's <a href=\"https://github.com/Sonictherocketman/Microblogger\">GitHub page</a> for further reference.</p>\n<p>All this being said, I'm looking for great people to help keep the project on schedule and later improve the design. In particular, I'm looking for someone interested in building the front-end. If that sounds interesting to you, <a href=\"http://brianschrader.com/about/\">let me know</a>! I'm open to using whatever technology you'd like (Angular/Ember, Bootstrap, etc). </p>\n<p>Have a good weekend everyone! I'll be back to work on the project ASAP. See you then!</p>","link":"http://brianschrader.com/archive/microblogger-status-updates-and-more","location":"/archive/microblogger-status-updates-and-more/","published":"Sat, 13 Dec 2014 ","slug":"microblogger-status-updates-and-more","article-number":79}