{"status":"publish","pubdate":"Thu, 26 Feb 2015 19:13:09 -0000","tags":"programming","author":"Brian Schrader","content":"<p><link rel=\"stylesheet\" href=\"http://yandex.st/highlightjs/8.0/styles/default.min.css\">\n<script src=\"http://yandex.st/highlightjs/8.0/highlight.min.js\"></script>\n<script>hljs.initHighlightingOnLoad();</script></p>\n<p>In moving between my day job, programming in Java, and my personal projects, usually in Python, there tends to be a lot of bleedover from one language/paradigm to the other. I love Python. It's a fun, straghtforward, powerful language and it has lots of great features and frameworks built up around it, but Python's dynamic nature can lead to problems with readability and understandability(?) when developers take it for granted.</p>\n<p>Say one thing for Java, say that it's picky. It wants one class per file, getters and setters are explicit, and it can be very verbose (in the wrong ways). One thing Java does have though, is clear structure. Classes have members, members are laid out in advance, and you know what to expect. Python passes dictionaries like Java throws NullPointerExceptions: everywhere. Unlike NullPointerExceptions though, Python's reliance on dictionaries is one of my favorite features of the language, but relying on data types, which have no default structure, means that anyone reading your code will have to, not only decipher the meaning of the code, but also the structure of your data. Clarifying the structure of your dictionaries explicitly will help readability and enforce you to adhear to that structure down the line.</p>\n<p>Here's some sample code that doesn't clarify ahead of time what the structure of the dictionary will be:</p>\n<pre><code class='python'>    results = {}\n    results['users'] = get_users()\n    results['posts'] = [post for post in get_posts()]\n    if my_user_id not in results['users']:\n        results['users'].append(my_user_id)\n    results['last_post_times'] = [last_post_time for last_post_time in get_times()]\n    for lpt in results['last_post_times']:\n        if lpt['user'] not in results['users']:\n            raise SomeError\n    return results\n</code></pre>\n\n<p>Although it's not too hard to see, the structure of results can't be easily determined from the first line. You have to walk the code to see the structure.</p>\n<pre><code class='python'>    >>> results = {\n            'users': [\n                'terry.gilliam',\n                'eric.idle',\n                'graham.chapman',\n                'john.cleese',\n                'michael.palin',\n                'terry.jones'\n            ],\n            'posts': [\n                { \n                    'user': 'john.cleese',  \n                    'content': 'How to defend yourself against a man armed with a banana.'\n                },\n                {\n                    'user': 'eric.idle',\n                    'content': '@john.cleese What about a pointed stick?'\n                }\n            ],\n            'last_post_times': [...]\n        }\n</code></pre>\n\n<p>Another way of laying out this code would be like this. Here, we clarify the structure that results will have upfront.</p>\n<pre><code class='python'>    results = { 'users': [], 'posts': [], 'last_post_times': [] }\n    # The rest is the same...\n    results['users'] = get_users()\n    results['posts'] = [post for post in get_posts()]\n    if my_user_id not in results['users']:\n        results['users'].append(my_user_id)\n    results['last_post_times'] = [last_post_time for last_post_time in get_times()]\n    for lpt in results['last_post_times']:\n        if lpt['user'] not in results['users']:\n            raise SomeError\n    return results\n</pre>\n\n<p></code></p>\n<p>Now, from looking only at the first line, we know the structure that results will take. We don't have to decipher it. There's no performance difference in either approach, but laying out the structure of the dictionary ahead of time makes the code more easily scannable. </p>\n<p>Python will let you be sloppy in ways that Java just won't. Overall I much prefer working in Python, but because its so forgivable and dynamic, I'm constantly finding myself forcing structure onto my code to make it more understandable when I eventually come back to it.</p>","link":"http://brianschrader.com/archive/clarifying-structure","location":"/archive/clarifying-structure/","published":"Thu, 26 Feb 2015 ","title":"Clarifying Structure","slug":"clarifying-structure","article-number":89}